; ModuleID = 'example_mayo.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.mayo_params_t = type { i32, i32, i32, i32, i32, ptr, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, ptr }
%struct.sk_t = type { [113103 x i64], [2414 x i8] }

@MAYO_1 = external constant %struct.mayo_params_t, align 8
@MAYO_2 = external constant %struct.mayo_params_t, align 8
@MAYO_3 = external constant %struct.mayo_params_t, align 8
@MAYO_5 = external constant %struct.mayo_params_t, align 8
@__const.main.params = private unnamed_addr constant [4 x ptr] [ptr @MAYO_1, ptr @MAYO_2, ptr @MAYO_3, ptr @MAYO_5], align 16
@__const.example_mayo.msg = private unnamed_addr constant <{ i8, [31 x i8] }> <{ i8 14, [31 x i8] zeroinitializer }>, align 16
@.str = private unnamed_addr constant [17 x i8] c"Example with %s\0A\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [17 x i8] c"mayo_keypair -> \00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [6 x i8] c"FAIL\0A\00", align 1, !dbg !9
@.str.3 = private unnamed_addr constant [4 x i8] c"OK\0A\00", align 1, !dbg !14
@.str.4 = private unnamed_addr constant [19 x i8] c"mayo_expand_sk -> \00", align 1, !dbg !19
@.str.5 = private unnamed_addr constant [19 x i8] c"mayo_expand_pk -> \00", align 1, !dbg !24

!27 = distinct !DIGlobalVariable(scope: null, file: !2, line: 73, type: !28, isLocal: true, isDefinition: true)
!28 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 112, elements: !29)
!29 = !{!30}
!30 = !DISubrange(count: 14)
!31 = !DIGlobalVariableExpression(var: !32, expr: !DIExpression())
!32 = distinct !DIGlobalVariable(scope: null, file: !2, line: 83, type: !33, isLocal: true, isDefinition: true)
!33 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 312, elements: !34)
!34 = !{!35}
!35 = !DISubrange(count: 39)
!36 = !DIGlobalVariableExpression(var: !37, expr: !DIExpression())
!37 = distinct !DIGlobalVariable(scope: null, file: !2, line: 94, type: !38, isLocal: true, isDefinition: true)
!38 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 328, elements: !39)
!39 = !{!40}
!40 = !DISubrange(count: 41)
!41 = !DIGlobalVariableExpression(var: !42, expr: !DIExpression())
!42 = distinct !DIGlobalVariable(scope: null, file: !2, line: 105, type: !33, isLocal: true, isDefinition: true)
!43 = !DIGlobalVariableExpression(var: !44, expr: !DIExpression())
!44 = distinct !DIGlobalVariable(scope: null, file: !2, line: 118, type: !38, isLocal: true, isDefinition: true)
!45 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "clang version 23.0.0git (https://github.com/llvm/llvm-project.git 49a2335fab0e61117655f25393e86cd48d99445c)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, globals: !46, splitDebugInlining: false, nameTableKind: None)
!46 = !{!0, !7, !9, !14, !19, !24, !26, !31, !36, !41, !43}
!47 = distinct !DICompileUnit(language: DW_LANG_C11, file: !48, producer: "clang version 23.0.0git (https://github.com/llvm/llvm-project.git 49a2335fab0e61117655f25393e86cd48d99445c)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !49, globals: !60, splitDebugInlining: false, nameTableKind: None)
!48 = !DIFile(filename: "../src/mayo.c", directory: "/home/siddhesh/Desktop/MAYO-LLVM/llvm-apps", checksumkind: CSK_MD5, checksum: "2d9bf746bad8f353d74f8eb61797ea0e")
!49 = !{!50, !51, !57, !59}
!50 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !53, line: 27, baseType: !54)
!53 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "256fcabbefa27ca8cf5e6d37525e6e16")
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !55, line: 45, baseType: !56)
!55 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "e1865d9fe29fe1b5ced550b7ba458f9e")
!56 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !58, line: 18, baseType: !56)
!58 = !DIFile(filename: "/usr/local/lib/clang/23/include/__stddef_size_t.h", directory: "", checksumkind: CSK_MD5, checksum: "2c44e821a2b1951cde2eb0fb2e656867")
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!60 = !{!61, !68, !70, !72}
!61 = !DIGlobalVariableExpression(var: !62, expr: !DIExpression())
!62 = distinct !DIGlobalVariable(name: "even_nibbles", scope: !63, file: !48, line: 112, type: !67, isLocal: true, isDefinition: true)
!63 = distinct !DISubprogram(name: "transpose_16x16_nibbles", scope: !48, file: !48, line: 111, type: !64, scopeLine: 111, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !47, retainedNodes: !66)
!64 = !DISubroutineType(types: !65)
!65 = !{null, !51}
!66 = !{}
!67 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !52)
!68 = !DIGlobalVariableExpression(var: !69, expr: !DIExpression())
!69 = distinct !DIGlobalVariable(name: "even_bytes", scope: !63, file: !48, line: 113, type: !67, isLocal: true, isDefinition: true)
!70 = !DIGlobalVariableExpression(var: !71, expr: !DIExpression())
!71 = distinct !DIGlobalVariable(name: "even_2bytes", scope: !63, file: !48, line: 114, type: !67, isLocal: true, isDefinition: true)
!72 = !DIGlobalVariableExpression(var: !73, expr: !DIExpression())
!73 = distinct !DIGlobalVariable(name: "even_half", scope: !63, file: !48, line: 115, type: !67, isLocal: true, isDefinition: true)
!74 = !{!"clang version 23.0.0git (https://github.com/llvm/llvm-project.git 49a2335fab0e61117655f25393e86cd48d99445c)"}
!75 = !{i32 7, !"Dwarf Version", i32 5}
!76 = !{i32 2, !"Debug Info Version", i32 3}
!77 = !{i32 1, !"wchar_size", i32 4}
!78 = !{i32 8, !"PIC Level", i32 2}
!79 = !{i32 7, !"PIE Level", i32 2}
!80 = !{i32 7, !"uwtable", i32 2}
!81 = !{i32 7, !"frame-pointer", i32 2}
!82 = distinct !DISubprogram(name: "main", scope: !2, file: !2, line: 138, type: !83, scopeLine: 138, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !45, retainedNodes: !66)
!83 = !DISubroutineType(types: !84)
!84 = !{!85}
!85 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!86 = !DILocalVariable(name: "params", scope: !82, file: !2, line: 140, type: !87)
!87 = !DICompositeType(tag: DW_TAG_array_type, baseType: !88, size: 256, elements: !17)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!89 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !90)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "mayo_params_t", file: !91, line: 289, baseType: !92)
!91 = !DIFile(filename: "../include/mayo.h", directory: "/home/siddhesh/Desktop/MAYO-LLVM/llvm-apps", checksumkind: CSK_MD5, checksum: "f989eb6a80120ad12fa916f6a2c77682")
!92 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !91, line: 265, size: 832, elements: !93)
!93 = !{!94, !95, !96, !97, !98, !99, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !92, file: !91, line: 266, baseType: !85, size: 32)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !92, file: !91, line: 267, baseType: !85, size: 32, offset: 32)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "o", scope: !92, file: !91, line: 268, baseType: !85, size: 32, offset: 64)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "k", scope: !92, file: !91, line: 269, baseType: !85, size: 32, offset: 96)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !92, file: !91, line: 270, baseType: !85, size: 32, offset: 128)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "f_tail", scope: !92, file: !91, line: 271, baseType: !100, size: 64, offset: 192)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!101 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !50)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "m_bytes", scope: !92, file: !91, line: 272, baseType: !85, size: 32, offset: 256)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "O_bytes", scope: !92, file: !91, line: 273, baseType: !85, size: 32, offset: 288)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "v_bytes", scope: !92, file: !91, line: 274, baseType: !85, size: 32, offset: 320)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "r_bytes", scope: !92, file: !91, line: 275, baseType: !85, size: 32, offset: 352)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "R_bytes", scope: !92, file: !91, line: 276, baseType: !85, size: 32, offset: 384)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "P1_bytes", scope: !92, file: !91, line: 277, baseType: !85, size: 32, offset: 416)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "P2_bytes", scope: !92, file: !91, line: 278, baseType: !85, size: 32, offset: 448)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "P3_bytes", scope: !92, file: !91, line: 279, baseType: !85, size: 32, offset: 480)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "csk_bytes", scope: !92, file: !91, line: 280, baseType: !85, size: 32, offset: 512)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "cpk_bytes", scope: !92, file: !91, line: 281, baseType: !85, size: 32, offset: 544)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "sig_bytes", scope: !92, file: !91, line: 282, baseType: !85, size: 32, offset: 576)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "salt_bytes", scope: !92, file: !91, line: 283, baseType: !85, size: 32, offset: 608)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "sk_seed_bytes", scope: !92, file: !91, line: 284, baseType: !85, size: 32, offset: 640)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "digest_bytes", scope: !92, file: !91, line: 285, baseType: !85, size: 32, offset: 672)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "pk_seed_bytes", scope: !92, file: !91, line: 286, baseType: !85, size: 32, offset: 704)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "m_vec_limbs", scope: !92, file: !91, line: 287, baseType: !85, size: 32, offset: 736)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !92, file: !91, line: 288, baseType: !119, size: 64, offset: 768)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!120 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!121 = !DILocation(line: 140, column: 26, scope: !82)
!122 = !DILocalVariable(name: "paramslen", scope: !82, file: !2, line: 141, type: !85)
!123 = !DILocation(line: 141, column: 9, scope: !82)
!124 = !DILocalVariable(name: "i", scope: !125, file: !2, line: 142, type: !85)
!125 = distinct !DILexicalBlock(scope: !82, file: !2, line: 142, column: 5)
!126 = !DILocation(line: 142, column: 14, scope: !125)
!127 = !DILocation(line: 142, column: 10, scope: !125)
!128 = !DILocation(line: 142, column: 21, scope: !129)
!129 = distinct !DILexicalBlock(scope: !125, file: !2, line: 142, column: 5)
!130 = !DILocation(line: 142, column: 25, scope: !129)
!131 = !DILocation(line: 142, column: 23, scope: !129)
!132 = !DILocation(line: 142, column: 5, scope: !125)
!133 = !DILocation(line: 143, column: 33, scope: !134)
!134 = distinct !DILexicalBlock(scope: !135, file: !2, line: 143, column: 13)
!135 = distinct !DILexicalBlock(scope: !129, file: !2, line: 142, column: 41)
!136 = !DILocation(line: 143, column: 26, scope: !134)
!137 = !DILocation(line: 143, column: 13, scope: !134)
!138 = !DILocation(line: 143, column: 37, scope: !134)
!139 = !DILocation(line: 144, column: 13, scope: !140)
!140 = distinct !DILexicalBlock(scope: !134, file: !2, line: 143, column: 49)
!141 = !DILocation(line: 146, column: 5, scope: !135)
!142 = !DILocation(line: 142, column: 36, scope: !129)
!143 = !DILocation(line: 142, column: 5, scope: !129)
!144 = distinct !{!144, !132, !145, !146}
!145 = !DILocation(line: 146, column: 5, scope: !125)
!146 = !{!"llvm.loop.mustprogress"}
!147 = !DILocation(line: 150, column: 1, scope: !82)
!148 = distinct !DISubprogram(name: "example_mayo", scope: !2, file: !2, line: 25, type: !149, scopeLine: 25, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !45, retainedNodes: !66)
!149 = !DISubroutineType(types: !150)
!150 = !{!85, !88}
!151 = !DILocalVariable(name: "p", arg: 1, scope: !148, file: !2, line: 25, type: !88)
!152 = !DILocation(line: 25, column: 46, scope: !148)
!153 = !DILocalVariable(name: "msglen", scope: !148, file: !2, line: 27, type: !57)
!154 = !DILocation(line: 27, column: 12, scope: !148)
!155 = !DILocalVariable(name: "smlen", scope: !148, file: !2, line: 28, type: !57)
!156 = !DILocation(line: 28, column: 12, scope: !148)
!157 = !DILocation(line: 28, column: 36, scope: !148)
!158 = !DILocation(line: 28, column: 20, scope: !148)
!159 = !DILocation(line: 28, column: 41, scope: !148)
!160 = !DILocation(line: 28, column: 39, scope: !148)
!161 = !DILocalVariable(name: "pk", scope: !148, file: !2, line: 30, type: !59)
!162 = !DILocation(line: 30, column: 20, scope: !148)
!163 = !DILocation(line: 30, column: 49, scope: !148)
!164 = !DILocation(line: 30, column: 33, scope: !148)
!165 = !DILocation(line: 30, column: 26, scope: !148)
!166 = !DILocalVariable(name: "sk", scope: !148, file: !2, line: 31, type: !59)
!167 = !DILocation(line: 31, column: 20, scope: !148)
!168 = !DILocation(line: 31, column: 49, scope: !148)
!169 = !DILocation(line: 31, column: 33, scope: !148)
!170 = !DILocation(line: 31, column: 26, scope: !148)
!171 = !DILocalVariable(name: "epk", scope: !148, file: !2, line: 33, type: !51)
!172 = !DILocation(line: 33, column: 15, scope: !148)
!173 = !DILocation(line: 33, column: 21, scope: !148)
!174 = !DILocalVariable(name: "esk", scope: !148, file: !2, line: 34, type: !175)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "sk_t", file: !91, line: 294, baseType: !177)
!177 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sk_t", file: !91, line: 291, size: 7257920, elements: !178)
!178 = !{!179, !183}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !177, file: !91, line: 292, baseType: !180, size: 7238592)
!180 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 7238592, elements: !181)
!181 = !{!182}
!182 = !DISubrange(count: 113103)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "O", scope: !177, file: !91, line: 293, baseType: !184, size: 19312, offset: 7238592)
!184 = !DICompositeType(tag: DW_TAG_array_type, baseType: !185, size: 19312, elements: !187)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !53, line: 24, baseType: !186)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !55, line: 38, baseType: !50)
!187 = !{!188}
!188 = !DISubrange(count: 2414)
!189 = !DILocation(line: 34, column: 11, scope: !148)
!190 = !DILocation(line: 34, column: 17, scope: !148)
!191 = !DILocalVariable(name: "sig", scope: !148, file: !2, line: 36, type: !59)
!192 = !DILocation(line: 36, column: 20, scope: !148)
!193 = !DILocation(line: 36, column: 49, scope: !148)
!194 = !DILocation(line: 36, column: 33, scope: !148)
!195 = !DILocation(line: 36, column: 54, scope: !148)
!196 = !DILocation(line: 36, column: 52, scope: !148)
!197 = !DILocation(line: 36, column: 26, scope: !148)
!198 = !DILocalVariable(name: "msg", scope: !148, file: !2, line: 38, type: !199)
!199 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 256, elements: !200)
!200 = !{!201}
!201 = !DISubrange(count: 32)
!202 = !DILocation(line: 38, column: 19, scope: !148)
!203 = !DILocalVariable(name: "msg2", scope: !148, file: !2, line: 39, type: !199)
!204 = !DILocation(line: 39, column: 19, scope: !148)
!205 = !DILocation(line: 41, column: 44, scope: !148)
!206 = !DILocation(line: 41, column: 33, scope: !148)
!207 = !DILocation(line: 41, column: 5, scope: !148)
!208 = !DILocation(line: 43, column: 5, scope: !148)
!209 = !DILocalVariable(name: "res", scope: !148, file: !2, line: 44, type: !85)
!210 = !DILocation(line: 44, column: 9, scope: !148)
!211 = !DILocation(line: 44, column: 28, scope: !148)
!212 = !DILocation(line: 44, column: 31, scope: !148)
!213 = !DILocation(line: 44, column: 35, scope: !148)
!214 = !DILocation(line: 44, column: 15, scope: !148)
!215 = !DILocation(line: 45, column: 9, scope: !216)
!216 = distinct !DILexicalBlock(scope: !148, file: !2, line: 45, column: 9)
!217 = !DILocation(line: 45, column: 13, scope: !216)
!218 = !DILocation(line: 46, column: 9, scope: !219)
!219 = distinct !DILexicalBlock(scope: !216, file: !2, line: 45, column: 25)
!220 = !DILocation(line: 47, column: 13, scope: !219)
!221 = !DILocation(line: 48, column: 9, scope: !219)
!222 = !DILocation(line: 50, column: 9, scope: !223)
!223 = distinct !DILexicalBlock(scope: !216, file: !2, line: 49, column: 12)
!224 = !DILocation(line: 53, column: 5, scope: !148)
!225 = !DILocation(line: 54, column: 26, scope: !148)
!226 = !DILocation(line: 54, column: 29, scope: !148)
!227 = !DILocation(line: 54, column: 33, scope: !148)
!228 = !DILocation(line: 54, column: 11, scope: !148)
!229 = !DILocation(line: 54, column: 9, scope: !148)
!230 = !DILocation(line: 55, column: 9, scope: !231)
!231 = distinct !DILexicalBlock(scope: !148, file: !2, line: 55, column: 9)
!232 = !DILocation(line: 55, column: 13, scope: !231)
!233 = !DILocation(line: 56, column: 9, scope: !234)
!234 = distinct !DILexicalBlock(scope: !231, file: !2, line: 55, column: 25)
!235 = !DILocation(line: 57, column: 13, scope: !234)
!236 = !DILocation(line: 58, column: 9, scope: !234)
!237 = !DILocation(line: 60, column: 9, scope: !238)
!238 = distinct !DILexicalBlock(scope: !231, file: !2, line: 59, column: 12)
!239 = !DILocation(line: 63, column: 5, scope: !148)
!240 = !DILocation(line: 64, column: 26, scope: !148)
!241 = !DILocation(line: 64, column: 29, scope: !148)
!242 = !DILocation(line: 64, column: 33, scope: !148)
!243 = !DILocation(line: 64, column: 11, scope: !148)
!244 = !DILocation(line: 64, column: 9, scope: !148)
!245 = !DILocation(line: 65, column: 9, scope: !246)
!246 = distinct !DILexicalBlock(scope: !148, file: !2, line: 65, column: 9)
!247 = !DILocation(line: 65, column: 13, scope: !246)
!248 = !DILocation(line: 66, column: 9, scope: !249)
!249 = distinct !DILexicalBlock(scope: !246, file: !2, line: 65, column: 25)
!250 = !DILocation(line: 67, column: 13, scope: !249)
!251 = !DILocation(line: 68, column: 9, scope: !249)
!252 = !DILocation(line: 70, column: 9, scope: !253)
!253 = distinct !DILexicalBlock(scope: !246, file: !2, line: 69, column: 12)
!254 = !DILocation(line: 73, column: 5, scope: !148)
!255 = !DILocation(line: 74, column: 21, scope: !148)
!256 = !DILocation(line: 74, column: 24, scope: !148)
!257 = !DILocation(line: 74, column: 37, scope: !148)
!258 = !DILocation(line: 74, column: 42, scope: !148)
!259 = !DILocation(line: 74, column: 50, scope: !148)
!260 = !DILocation(line: 74, column: 11, scope: !148)
!261 = !DILocation(line: 74, column: 9, scope: !148)
!262 = !DILocation(line: 75, column: 9, scope: !263)
!263 = distinct !DILexicalBlock(scope: !148, file: !2, line: 75, column: 9)
!264 = !DILocation(line: 75, column: 13, scope: !263)
!265 = !DILocation(line: 76, column: 9, scope: !266)
!266 = distinct !DILexicalBlock(scope: !263, file: !2, line: 75, column: 25)
!267 = !DILocation(line: 77, column: 13, scope: !266)
!268 = !DILocation(line: 78, column: 9, scope: !266)
!269 = !DILocation(line: 80, column: 9, scope: !270)
!270 = distinct !DILexicalBlock(scope: !263, file: !2, line: 79, column: 12)
!271 = !DILocation(line: 83, column: 5, scope: !148)
!272 = !DILocation(line: 84, column: 21, scope: !148)
!273 = !DILocation(line: 84, column: 24, scope: !148)
!274 = !DILocation(line: 84, column: 39, scope: !148)
!275 = !DILocation(line: 84, column: 44, scope: !148)
!276 = !DILocation(line: 84, column: 51, scope: !148)
!277 = !DILocation(line: 84, column: 11, scope: !148)
!278 = !DILocation(line: 84, column: 9, scope: !148)
!279 = !DILocation(line: 85, column: 9, scope: !280)
!280 = distinct !DILexicalBlock(scope: !148, file: !2, line: 85, column: 9)
!281 = !DILocation(line: 85, column: 13, scope: !280)
!282 = !DILocation(line: 85, column: 24, scope: !280)
!283 = !DILocation(line: 85, column: 34, scope: !280)
!284 = !DILocation(line: 85, column: 39, scope: !280)
!285 = !DILocation(line: 85, column: 45, scope: !280)
!286 = !DILocation(line: 85, column: 27, scope: !280)
!287 = !DILocation(line: 86, column: 9, scope: !288)
!288 = distinct !DILexicalBlock(scope: !280, file: !2, line: 85, column: 54)
!289 = !DILocation(line: 87, column: 13, scope: !288)
!290 = !DILocation(line: 88, column: 9, scope: !288)
!291 = !DILocation(line: 90, column: 13, scope: !292)
!292 = distinct !DILexicalBlock(scope: !280, file: !2, line: 89, column: 12)
!293 = !DILocation(line: 91, column: 9, scope: !292)
!294 = !DILocation(line: 94, column: 5, scope: !148)
!295 = !DILocation(line: 95, column: 23, scope: !148)
!296 = !DILocation(line: 95, column: 26, scope: !148)
!297 = !DILocation(line: 95, column: 31, scope: !148)
!298 = !DILocation(line: 95, column: 39, scope: !148)
!299 = !DILocation(line: 95, column: 44, scope: !148)
!300 = !DILocation(line: 95, column: 11, scope: !148)
!301 = !DILocation(line: 95, column: 9, scope: !148)
!302 = !DILocation(line: 96, column: 9, scope: !303)
!303 = distinct !DILexicalBlock(scope: !148, file: !2, line: 96, column: 9)
!304 = !DILocation(line: 96, column: 13, scope: !303)
!305 = !DILocation(line: 97, column: 9, scope: !306)
!306 = distinct !DILexicalBlock(scope: !303, file: !2, line: 96, column: 25)
!307 = !DILocation(line: 98, column: 13, scope: !306)
!308 = !DILocation(line: 99, column: 9, scope: !306)
!309 = !DILocation(line: 101, column: 13, scope: !310)
!310 = distinct !DILexicalBlock(scope: !303, file: !2, line: 100, column: 12)
!311 = !DILocation(line: 102, column: 9, scope: !310)
!312 = !DILocation(line: 105, column: 5, scope: !148)
!313 = !DILocation(line: 106, column: 15, scope: !148)
!314 = !DILocation(line: 106, column: 14, scope: !148)
!315 = !DILocation(line: 106, column: 5, scope: !148)
!316 = !DILocation(line: 106, column: 12, scope: !148)
!317 = !DILocation(line: 107, column: 5, scope: !148)
!318 = !DILocation(line: 107, column: 21, scope: !148)
!319 = !DILocation(line: 108, column: 21, scope: !148)
!320 = !DILocation(line: 108, column: 24, scope: !148)
!321 = !DILocation(line: 108, column: 39, scope: !148)
!322 = !DILocation(line: 108, column: 44, scope: !148)
!323 = !DILocation(line: 108, column: 51, scope: !148)
!324 = !DILocation(line: 108, column: 11, scope: !148)
!325 = !DILocation(line: 108, column: 9, scope: !148)
!326 = !DILocation(line: 109, column: 9, scope: !327)
!327 = distinct !DILexicalBlock(scope: !148, file: !2, line: 109, column: 9)
!328 = !DILocation(line: 109, column: 13, scope: !327)
!329 = !DILocation(line: 109, column: 25, scope: !327)
!330 = !DILocation(line: 109, column: 36, scope: !327)
!331 = !DILocation(line: 109, column: 41, scope: !327)
!332 = !DILocation(line: 109, column: 47, scope: !327)
!333 = !DILocation(line: 109, column: 29, scope: !327)
!334 = !DILocation(line: 110, column: 9, scope: !335)
!335 = distinct !DILexicalBlock(scope: !327, file: !2, line: 109, column: 56)
!336 = !DILocation(line: 111, column: 13, scope: !335)
!337 = !DILocation(line: 112, column: 9, scope: !335)
!338 = !DILocation(line: 114, column: 13, scope: !339)
!339 = distinct !DILexicalBlock(scope: !327, file: !2, line: 113, column: 12)
!340 = !DILocation(line: 115, column: 9, scope: !339)
!341 = !DILocation(line: 118, column: 5, scope: !148)
!342 = !DILocation(line: 119, column: 23, scope: !148)
!343 = !DILocation(line: 119, column: 26, scope: !148)
!344 = !DILocation(line: 119, column: 31, scope: !148)
!345 = !DILocation(line: 119, column: 39, scope: !148)
!346 = !DILocation(line: 119, column: 44, scope: !148)
!347 = !DILocation(line: 119, column: 11, scope: !148)
!348 = !DILocation(line: 119, column: 9, scope: !148)
!349 = !DILocation(line: 120, column: 9, scope: !350)
!350 = distinct !DILexicalBlock(scope: !148, file: !2, line: 120, column: 9)
!351 = !DILocation(line: 120, column: 13, scope: !350)
!352 = !DILocation(line: 121, column: 9, scope: !353)
!353 = distinct !DILexicalBlock(scope: !350, file: !2, line: 120, column: 25)
!354 = !DILocation(line: 122, column: 13, scope: !353)
!355 = !DILocation(line: 123, column: 9, scope: !353)
!356 = !DILocation(line: 125, column: 13, scope: !357)
!357 = distinct !DILexicalBlock(scope: !350, file: !2, line: 124, column: 12)
!358 = !DILocation(line: 126, column: 9, scope: !357)
!359 = !DILocation(line: 120, column: 16, scope: !350)
!360 = !DILabel(scope: !148, name: "err", file: !2, line: 129, column: 1)
!361 = !DILocation(line: 129, column: 1, scope: !148)
!362 = !DILocation(line: 130, column: 10, scope: !148)
!363 = !DILocation(line: 130, column: 5, scope: !148)
!364 = !DILocation(line: 131, column: 10, scope: !148)
!365 = !DILocation(line: 131, column: 5, scope: !148)
!366 = !DILocation(line: 132, column: 22, scope: !148)
!367 = !DILocation(line: 132, column: 42, scope: !148)
!368 = !DILocation(line: 132, column: 26, scope: !148)
!369 = !DILocation(line: 132, column: 5, scope: !148)
!370 = !DILocation(line: 133, column: 22, scope: !148)
!371 = !DILocation(line: 133, column: 5, scope: !148)
!372 = !DILocation(line: 134, column: 10, scope: !148)
!373 = !DILocation(line: 134, column: 5, scope: !148)
!374 = !DILocation(line: 135, column: 12, scope: !148)
!375 = !DILocation(line: 135, column: 5, scope: !148)
!376 = distinct !DISubprogram(name: "mayo_keypair", scope: !48, file: !48, line: 298, type: !377, scopeLine: 298, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !47, retainedNodes: !66)
!377 = !DISubroutineType(types: !378)
!378 = !{!85, !379, !59, !59}
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64)
!380 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !381)
!381 = !DIDerivedType(tag: DW_TAG_typedef, name: "mayo_params_t", file: !91, line: 289, baseType: !382)
!382 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !91, line: 265, size: 832, elements: !383)
!383 = !{!384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406}
!384 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !382, file: !91, line: 266, baseType: !85, size: 32)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !382, file: !91, line: 267, baseType: !85, size: 32, offset: 32)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "o", scope: !382, file: !91, line: 268, baseType: !85, size: 32, offset: 64)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "k", scope: !382, file: !91, line: 269, baseType: !85, size: 32, offset: 96)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !382, file: !91, line: 270, baseType: !85, size: 32, offset: 128)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "f_tail", scope: !382, file: !91, line: 271, baseType: !100, size: 64, offset: 192)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "m_bytes", scope: !382, file: !91, line: 272, baseType: !85, size: 32, offset: 256)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "O_bytes", scope: !382, file: !91, line: 273, baseType: !85, size: 32, offset: 288)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "v_bytes", scope: !382, file: !91, line: 274, baseType: !85, size: 32, offset: 320)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "r_bytes", scope: !382, file: !91, line: 275, baseType: !85, size: 32, offset: 352)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "R_bytes", scope: !382, file: !91, line: 276, baseType: !85, size: 32, offset: 384)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "P1_bytes", scope: !382, file: !91, line: 277, baseType: !85, size: 32, offset: 416)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "P2_bytes", scope: !382, file: !91, line: 278, baseType: !85, size: 32, offset: 448)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "P3_bytes", scope: !382, file: !91, line: 279, baseType: !85, size: 32, offset: 480)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "csk_bytes", scope: !382, file: !91, line: 280, baseType: !85, size: 32, offset: 512)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "cpk_bytes", scope: !382, file: !91, line: 281, baseType: !85, size: 32, offset: 544)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "sig_bytes", scope: !382, file: !91, line: 282, baseType: !85, size: 32, offset: 576)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "salt_bytes", scope: !382, file: !91, line: 283, baseType: !85, size: 32, offset: 608)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "sk_seed_bytes", scope: !382, file: !91, line: 284, baseType: !85, size: 32, offset: 640)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "digest_bytes", scope: !382, file: !91, line: 285, baseType: !85, size: 32, offset: 672)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "pk_seed_bytes", scope: !382, file: !91, line: 286, baseType: !85, size: 32, offset: 704)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "m_vec_limbs", scope: !382, file: !91, line: 287, baseType: !85, size: 32, offset: 736)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !382, file: !91, line: 288, baseType: !119, size: 64, offset: 768)
!407 = !DILocalVariable(name: "p", arg: 1, scope: !376, file: !48, line: 298, type: !379)
!408 = !DILocation(line: 298, column: 39, scope: !376)
!409 = !DILocalVariable(name: "pk", arg: 2, scope: !376, file: !48, line: 298, type: !59)
!410 = !DILocation(line: 298, column: 57, scope: !376)
!411 = !DILocalVariable(name: "sk", arg: 3, scope: !376, file: !48, line: 298, type: !59)
!412 = !DILocation(line: 298, column: 76, scope: !376)
!413 = !DILocalVariable(name: "ret", scope: !376, file: !48, line: 299, type: !85)
!414 = !DILocation(line: 299, column: 9, scope: !376)
!415 = !DILocation(line: 301, column: 32, scope: !376)
!416 = !DILocation(line: 301, column: 35, scope: !376)
!417 = !DILocation(line: 301, column: 39, scope: !376)
!418 = !DILocation(line: 301, column: 11, scope: !376)
!419 = !DILocation(line: 301, column: 9, scope: !376)
!420 = !DILocation(line: 302, column: 9, scope: !421)
!421 = distinct !DILexicalBlock(scope: !376, file: !48, line: 302, column: 9)
!422 = !DILocation(line: 302, column: 13, scope: !421)
!423 = !DILocation(line: 303, column: 9, scope: !424)
!424 = distinct !DILexicalBlock(scope: !421, file: !48, line: 302, column: 25)
!425 = !DILocation(line: 302, column: 16, scope: !421)
!426 = !DILabel(scope: !376, name: "err", file: !48, line: 306, column: 1)
!427 = !DILocation(line: 306, column: 1, scope: !376)
!428 = !DILocation(line: 307, column: 12, scope: !376)
!429 = !DILocation(line: 307, column: 5, scope: !376)
!430 = distinct !DISubprogram(name: "mayo_keypair_compact", scope: !48, file: !48, line: 538, type: !377, scopeLine: 539, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !47, retainedNodes: !66)
!431 = !DILocalVariable(name: "p", arg: 1, scope: !430, file: !48, line: 538, type: !379)
!432 = !DILocation(line: 538, column: 47, scope: !430)
!433 = !DILocalVariable(name: "cpk", arg: 2, scope: !430, file: !48, line: 538, type: !59)
!434 = !DILocation(line: 538, column: 65, scope: !430)
!435 = !DILocalVariable(name: "csk", arg: 3, scope: !430, file: !48, line: 539, type: !59)
!436 = !DILocation(line: 539, column: 41, scope: !430)
!437 = !DILocalVariable(name: "ret", scope: !430, file: !48, line: 540, type: !85)
!438 = !DILocation(line: 540, column: 9, scope: !430)
!439 = !DILocalVariable(name: "seed_sk", scope: !430, file: !48, line: 541, type: !59)
!440 = !DILocation(line: 541, column: 20, scope: !430)
!441 = !DILocation(line: 541, column: 30, scope: !430)
!442 = !DILocalVariable(name: "S", scope: !430, file: !48, line: 542, type: !443)
!443 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 6944, elements: !444)
!444 = !{!445}
!445 = !DISubrange(count: 868)
!446 = !DILocation(line: 542, column: 19, scope: !430)
!447 = !DILocalVariable(name: "P", scope: !430, file: !48, line: 543, type: !180)
!448 = !DILocation(line: 543, column: 14, scope: !430)
!449 = !DILocalVariable(name: "P3", scope: !430, file: !48, line: 544, type: !450)
!450 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 166464, elements: !451)
!451 = !{!452}
!452 = !DISubrange(count: 2601)
!453 = !DILocation(line: 544, column: 14, scope: !430)
!454 = !DILocalVariable(name: "seed_pk", scope: !430, file: !48, line: 546, type: !59)
!455 = !DILocation(line: 546, column: 20, scope: !430)
!456 = !DILocalVariable(name: "O", scope: !430, file: !48, line: 547, type: !457)
!457 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 19312, elements: !187)
!458 = !DILocation(line: 547, column: 19, scope: !430)
!459 = !DILocalVariable(name: "m_vec_limbs", scope: !430, file: !48, line: 549, type: !460)
!460 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !85)
!461 = !DILocation(line: 549, column: 15, scope: !430)
!462 = !DILocation(line: 549, column: 47, scope: !430)
!463 = !DILocation(line: 549, column: 29, scope: !430)
!464 = !DILocalVariable(name: "param_m", scope: !430, file: !48, line: 550, type: !460)
!465 = !DILocation(line: 550, column: 15, scope: !430)
!466 = !DILocation(line: 550, column: 33, scope: !430)
!467 = !DILocation(line: 550, column: 25, scope: !430)
!468 = !DILocalVariable(name: "param_v", scope: !430, file: !48, line: 551, type: !460)
!469 = !DILocation(line: 551, column: 15, scope: !430)
!470 = !DILocation(line: 551, column: 33, scope: !430)
!471 = !DILocation(line: 551, column: 25, scope: !430)
!472 = !DILocalVariable(name: "param_o", scope: !430, file: !48, line: 552, type: !460)
!473 = !DILocation(line: 552, column: 15, scope: !430)
!474 = !DILocation(line: 552, column: 33, scope: !430)
!475 = !DILocation(line: 552, column: 25, scope: !430)
!476 = !DILocalVariable(name: "param_O_bytes", scope: !430, file: !48, line: 553, type: !460)
!477 = !DILocation(line: 553, column: 15, scope: !430)
!478 = !DILocation(line: 553, column: 45, scope: !430)
!479 = !DILocation(line: 553, column: 31, scope: !430)
!480 = !DILocalVariable(name: "param_P1_limbs", scope: !430, file: !48, line: 554, type: !460)
!481 = !DILocation(line: 554, column: 15, scope: !430)
!482 = !DILocation(line: 554, column: 47, scope: !430)
!483 = !DILocation(line: 554, column: 32, scope: !430)
!484 = !DILocalVariable(name: "param_P3_limbs", scope: !430, file: !48, line: 555, type: !460)
!485 = !DILocation(line: 555, column: 15, scope: !430)
!486 = !DILocation(line: 555, column: 47, scope: !430)
!487 = !DILocation(line: 555, column: 32, scope: !430)
!488 = !DILocalVariable(name: "param_pk_seed_bytes", scope: !430, file: !48, line: 556, type: !460)
!489 = !DILocation(line: 556, column: 15, scope: !430)
!490 = !DILocation(line: 556, column: 57, scope: !430)
!491 = !DILocation(line: 556, column: 37, scope: !430)
!492 = !DILocalVariable(name: "param_sk_seed_bytes", scope: !430, file: !48, line: 557, type: !460)
!493 = !DILocation(line: 557, column: 15, scope: !430)
!494 = !DILocation(line: 557, column: 57, scope: !430)
!495 = !DILocation(line: 557, column: 37, scope: !430)
!496 = !DILocalVariable(name: "P1", scope: !430, file: !48, line: 559, type: !51)
!497 = !DILocation(line: 559, column: 15, scope: !430)
!498 = !DILocation(line: 559, column: 20, scope: !430)
!499 = !DILocalVariable(name: "P2", scope: !430, file: !48, line: 560, type: !51)
!500 = !DILocation(line: 560, column: 15, scope: !430)
!501 = !DILocation(line: 560, column: 20, scope: !430)
!502 = !DILocation(line: 560, column: 24, scope: !430)
!503 = !DILocation(line: 560, column: 22, scope: !430)
!504 = !DILocation(line: 566, column: 21, scope: !505)
!505 = distinct !DILexicalBlock(scope: !430, file: !48, line: 566, column: 9)
!506 = !DILocation(line: 566, column: 30, scope: !505)
!507 = !DILocation(line: 566, column: 9, scope: !505)
!508 = !DILocation(line: 566, column: 51, scope: !505)
!509 = !DILocation(line: 567, column: 13, scope: !510)
!510 = distinct !DILexicalBlock(scope: !505, file: !48, line: 566, column: 63)
!511 = !DILocation(line: 568, column: 9, scope: !510)
!512 = !DILocation(line: 573, column: 14, scope: !430)
!513 = !DILocation(line: 573, column: 17, scope: !430)
!514 = !DILocation(line: 573, column: 39, scope: !430)
!515 = !DILocation(line: 573, column: 37, scope: !430)
!516 = !DILocation(line: 573, column: 54, scope: !430)
!517 = !DILocation(line: 574, column: 14, scope: !430)
!518 = !DILocation(line: 573, column: 5, scope: !430)
!519 = !DILocation(line: 576, column: 15, scope: !430)
!520 = !DILocation(line: 576, column: 13, scope: !430)
!521 = !DILocation(line: 579, column: 12, scope: !430)
!522 = !DILocation(line: 579, column: 16, scope: !430)
!523 = !DILocation(line: 579, column: 14, scope: !430)
!524 = !DILocation(line: 579, column: 37, scope: !430)
!525 = !DILocation(line: 579, column: 40, scope: !430)
!526 = !DILocation(line: 579, column: 50, scope: !430)
!527 = !DILocation(line: 579, column: 48, scope: !430)
!528 = !DILocation(line: 579, column: 5, scope: !430)
!529 = !DILocation(line: 585, column: 18, scope: !430)
!530 = !DILocation(line: 585, column: 21, scope: !430)
!531 = !DILocation(line: 585, column: 24, scope: !430)
!532 = !DILocation(line: 585, column: 5, scope: !430)
!533 = !DILocation(line: 588, column: 16, scope: !430)
!534 = !DILocation(line: 588, column: 19, scope: !430)
!535 = !DILocation(line: 588, column: 23, scope: !430)
!536 = !DILocation(line: 588, column: 27, scope: !430)
!537 = !DILocation(line: 588, column: 30, scope: !430)
!538 = !DILocation(line: 588, column: 5, scope: !430)
!539 = !DILocation(line: 591, column: 12, scope: !430)
!540 = !DILocation(line: 591, column: 17, scope: !430)
!541 = !DILocation(line: 591, column: 26, scope: !430)
!542 = !DILocation(line: 591, column: 5, scope: !430)
!543 = !DILocalVariable(name: "P3_upper", scope: !430, file: !48, line: 593, type: !544)
!544 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 88128, elements: !545)
!545 = !{!546}
!546 = !DISubrange(count: 1377)
!547 = !DILocation(line: 593, column: 14, scope: !430)
!548 = !DILocation(line: 596, column: 13, scope: !430)
!549 = !DILocation(line: 596, column: 16, scope: !430)
!550 = !DILocation(line: 596, column: 20, scope: !430)
!551 = !DILocation(line: 596, column: 30, scope: !430)
!552 = !DILocation(line: 596, column: 5, scope: !430)
!553 = !DILocation(line: 597, column: 17, scope: !430)
!554 = !DILocation(line: 597, column: 27, scope: !430)
!555 = !DILocation(line: 597, column: 33, scope: !430)
!556 = !DILocation(line: 597, column: 31, scope: !430)
!557 = !DILocation(line: 597, column: 54, scope: !430)
!558 = !DILocation(line: 597, column: 69, scope: !430)
!559 = !DILocation(line: 597, column: 68, scope: !430)
!560 = !DILocation(line: 597, column: 82, scope: !430)
!561 = !DILocation(line: 597, column: 5, scope: !430)
!562 = !DILabel(scope: !430, name: "err", file: !48, line: 600, column: 5)
!563 = !DILocation(line: 600, column: 5, scope: !430)
!564 = !DILocation(line: 602, column: 23, scope: !430)
!565 = !DILocation(line: 602, column: 5, scope: !430)
!566 = !DILocation(line: 603, column: 23, scope: !430)
!567 = !DILocation(line: 603, column: 42, scope: !430)
!568 = !DILocation(line: 603, column: 27, scope: !430)
!569 = !DILocation(line: 603, column: 44, scope: !430)
!570 = !DILocation(line: 603, column: 5, scope: !430)
!571 = !DILocation(line: 604, column: 23, scope: !430)
!572 = !DILocation(line: 604, column: 5, scope: !430)
!573 = !DILocation(line: 605, column: 12, scope: !430)
!574 = !DILocation(line: 605, column: 5, scope: !430)
!575 = distinct !DISubprogram(name: "decode", scope: !48, file: !48, line: 20, type: !576, scopeLine: 20, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !47, retainedNodes: !66)
!576 = !DISubroutineType(types: !577)
!577 = !{null, !100, !59, !85}
!578 = !DILocalVariable(name: "m", arg: 1, scope: !575, file: !48, line: 20, type: !100)
!579 = !DILocation(line: 20, column: 41, scope: !575)
!580 = !DILocalVariable(name: "mdec", arg: 2, scope: !575, file: !48, line: 20, type: !59)
!581 = !DILocation(line: 20, column: 59, scope: !575)
!582 = !DILocalVariable(name: "mdeclen", arg: 3, scope: !575, file: !48, line: 20, type: !85)
!583 = !DILocation(line: 20, column: 69, scope: !575)
!584 = !DILocalVariable(name: "i", scope: !575, file: !48, line: 21, type: !85)
!585 = !DILocation(line: 21, column: 9, scope: !575)
!586 = !DILocation(line: 22, column: 12, scope: !587)
!587 = distinct !DILexicalBlock(scope: !575, file: !48, line: 22, column: 5)
!588 = !DILocation(line: 22, column: 10, scope: !587)
!589 = !DILocation(line: 22, column: 17, scope: !590)
!590 = distinct !DILexicalBlock(scope: !587, file: !48, line: 22, column: 5)
!591 = !DILocation(line: 22, column: 21, scope: !590)
!592 = !DILocation(line: 22, column: 29, scope: !590)
!593 = !DILocation(line: 22, column: 19, scope: !590)
!594 = !DILocation(line: 22, column: 5, scope: !587)
!595 = !DILocation(line: 23, column: 19, scope: !596)
!596 = distinct !DILexicalBlock(scope: !590, file: !48, line: 22, column: 39)
!597 = !DILocation(line: 23, column: 21, scope: !596)
!598 = !DILocation(line: 23, column: 24, scope: !596)
!599 = !DILocation(line: 23, column: 14, scope: !596)
!600 = !DILocation(line: 23, column: 17, scope: !596)
!601 = !DILocation(line: 24, column: 19, scope: !596)
!602 = !DILocation(line: 24, column: 21, scope: !596)
!603 = !DILocation(line: 24, column: 24, scope: !596)
!604 = !DILocation(line: 24, column: 14, scope: !596)
!605 = !DILocation(line: 24, column: 17, scope: !596)
!606 = !DILocation(line: 25, column: 5, scope: !596)
!607 = !DILocation(line: 22, column: 34, scope: !590)
!608 = !DILocation(line: 22, column: 5, scope: !590)
!609 = distinct !{!609, !594, !610, !146}
!610 = !DILocation(line: 25, column: 5, scope: !587)
!611 = !DILocation(line: 27, column: 9, scope: !612)
!612 = distinct !DILexicalBlock(scope: !575, file: !48, line: 27, column: 9)
!613 = !DILocation(line: 27, column: 17, scope: !612)
!614 = !DILocation(line: 27, column: 21, scope: !612)
!615 = !DILocation(line: 28, column: 19, scope: !616)
!616 = distinct !DILexicalBlock(scope: !612, file: !48, line: 27, column: 27)
!617 = !DILocation(line: 28, column: 21, scope: !616)
!618 = !DILocation(line: 28, column: 24, scope: !616)
!619 = !DILocation(line: 28, column: 14, scope: !616)
!620 = !DILocation(line: 28, column: 17, scope: !616)
!621 = !DILocation(line: 29, column: 5, scope: !616)
!622 = !DILocation(line: 30, column: 1, scope: !575)
!623 = distinct !DISubprogram(name: "expand_P1_P2", scope: !48, file: !48, line: 280, type: !624, scopeLine: 280, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !47, retainedNodes: !66)
!624 = !DISubroutineType(types: !625)
!625 = !{null, !379, !51, !100}
!626 = !DILocalVariable(name: "p", arg: 1, scope: !623, file: !48, line: 280, type: !379)
!627 = !DILocation(line: 280, column: 47, scope: !623)
!628 = !DILocalVariable(name: "P", arg: 2, scope: !623, file: !48, line: 280, type: !51)
!629 = !DILocation(line: 280, column: 60, scope: !623)
!630 = !DILocalVariable(name: "seed_pk", arg: 3, scope: !623, file: !48, line: 280, type: !100)
!631 = !DILocation(line: 280, column: 84, scope: !623)
!632 = !DILocation(line: 284, column: 29, scope: !623)
!633 = !DILocation(line: 284, column: 47, scope: !623)
!634 = !DILocation(line: 284, column: 32, scope: !623)
!635 = !DILocation(line: 284, column: 67, scope: !623)
!636 = !DILocation(line: 284, column: 52, scope: !623)
!637 = !DILocation(line: 284, column: 50, scope: !623)
!638 = !DILocation(line: 284, column: 71, scope: !623)
!639 = !DILocation(line: 284, column: 100, scope: !623)
!640 = !DILocation(line: 284, column: 80, scope: !623)
!641 = !DILocation(line: 284, column: 5, scope: !623)
!642 = !DILocation(line: 285, column: 36, scope: !623)
!643 = !DILocation(line: 285, column: 39, scope: !623)
!644 = !DILocation(line: 285, column: 58, scope: !623)
!645 = !DILocation(line: 285, column: 43, scope: !623)
!646 = !DILocation(line: 285, column: 78, scope: !623)
!647 = !DILocation(line: 285, column: 63, scope: !623)
!648 = !DILocation(line: 285, column: 61, scope: !623)
!649 = !DILocation(line: 285, column: 100, scope: !623)
!650 = !DILocation(line: 285, column: 82, scope: !623)
!651 = !DILocation(line: 285, column: 81, scope: !623)
!652 = !DILocation(line: 285, column: 112, scope: !623)
!653 = !DILocation(line: 285, column: 104, scope: !623)
!654 = !DILocation(line: 285, column: 5, scope: !623)
!655 = !DILocation(line: 286, column: 1, scope: !623)
!656 = distinct !DISubprogram(name: "compute_P3", scope: !657, file: !657, line: 260, type: !658, scopeLine: 260, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !47, retainedNodes: !66)
!657 = !DIFile(filename: "../src/generic/generic_arithmetic.h", directory: "/home/siddhesh/Desktop/MAYO-LLVM/llvm-apps", checksumkind: CSK_MD5, checksum: "c74b5e3736583c2887c9257ca8300a6c")
!658 = !DISubroutineType(types: !659)
!659 = !{null, !379, !660, !51, !100, !51}
!660 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!661 = !DILocalVariable(name: "p", arg: 1, scope: !656, file: !657, line: 260, type: !379)
!662 = !DILocation(line: 260, column: 38, scope: !656)
!663 = !DILocalVariable(name: "P1", arg: 2, scope: !656, file: !657, line: 260, type: !660)
!664 = !DILocation(line: 260, column: 57, scope: !656)
!665 = !DILocalVariable(name: "P2", arg: 3, scope: !656, file: !657, line: 260, type: !51)
!666 = !DILocation(line: 260, column: 71, scope: !656)
!667 = !DILocalVariable(name: "O", arg: 4, scope: !656, file: !657, line: 260, type: !100)
!668 = !DILocation(line: 260, column: 96, scope: !656)
!669 = !DILocalVariable(name: "P3", arg: 5, scope: !656, file: !657, line: 260, type: !51)
!670 = !DILocation(line: 260, column: 109, scope: !656)
!671 = !DILocalVariable(name: "m_vec_limbs", scope: !656, file: !657, line: 262, type: !460)
!672 = !DILocation(line: 262, column: 15, scope: !656)
!673 = !DILocation(line: 262, column: 47, scope: !656)
!674 = !DILocation(line: 262, column: 29, scope: !656)
!675 = !DILocalVariable(name: "param_v", scope: !656, file: !657, line: 263, type: !460)
!676 = !DILocation(line: 263, column: 15, scope: !656)
!677 = !DILocation(line: 263, column: 33, scope: !656)
!678 = !DILocation(line: 263, column: 25, scope: !656)
!679 = !DILocalVariable(name: "param_o", scope: !656, file: !657, line: 264, type: !460)
!680 = !DILocation(line: 264, column: 15, scope: !656)
!681 = !DILocation(line: 264, column: 33, scope: !656)
!682 = !DILocation(line: 264, column: 25, scope: !656)
!683 = !DILocation(line: 267, column: 16, scope: !656)
!684 = !DILocation(line: 267, column: 19, scope: !656)
!685 = !DILocation(line: 267, column: 23, scope: !656)
!686 = !DILocation(line: 267, column: 26, scope: !656)
!687 = !DILocation(line: 267, column: 5, scope: !656)
!688 = !DILocation(line: 270, column: 31, scope: !656)
!689 = !DILocation(line: 270, column: 44, scope: !656)
!690 = !DILocation(line: 270, column: 47, scope: !656)
!691 = !DILocation(line: 270, column: 51, scope: !656)
!692 = !DILocation(line: 270, column: 55, scope: !656)
!693 = !DILocation(line: 270, column: 64, scope: !656)
!694 = !DILocation(line: 270, column: 73, scope: !656)
!695 = !DILocation(line: 270, column: 5, scope: !656)
!696 = !DILocation(line: 271, column: 1, scope: !656)
!697 = distinct !DISubprogram(name: "pack_m_vecs", scope: !48, file: !48, line: 272, type: !698, scopeLine: 272, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !47, retainedNodes: !66)
!698 = !DISubroutineType(types: !699)
!699 = !{null, !660, !59, !85, !85}
!700 = !DILocalVariable(name: "in", arg: 1, scope: !697, file: !48, line: 272, type: !660)
!701 = !DILocation(line: 272, column: 41, scope: !697)
!702 = !DILocalVariable(name: "out", arg: 2, scope: !697, file: !48, line: 272, type: !59)
!703 = !DILocation(line: 272, column: 60, scope: !697)
!704 = !DILocalVariable(name: "vecs", arg: 3, scope: !697, file: !48, line: 272, type: !85)
!705 = !DILocation(line: 272, column: 69, scope: !697)
!706 = !DILocalVariable(name: "m", arg: 4, scope: !697, file: !48, line: 272, type: !85)
!707 = !DILocation(line: 272, column: 79, scope: !697)
!708 = !DILocalVariable(name: "m_vec_limbs", scope: !697, file: !48, line: 273, type: !460)
!709 = !DILocation(line: 273, column: 15, scope: !697)
!710 = !DILocation(line: 273, column: 30, scope: !697)
!711 = !DILocation(line: 273, column: 32, scope: !697)
!712 = !DILocation(line: 273, column: 38, scope: !697)
!713 = !DILocalVariable(name: "_in", scope: !697, file: !48, line: 274, type: !59)
!714 = !DILocation(line: 274, column: 20, scope: !697)
!715 = !DILocation(line: 274, column: 44, scope: !697)
!716 = !DILocalVariable(name: "i", scope: !717, file: !48, line: 275, type: !85)
!717 = distinct !DILexicalBlock(scope: !697, file: !48, line: 275, column: 5)
!718 = !DILocation(line: 275, column: 14, scope: !717)
!719 = !DILocation(line: 275, column: 10, scope: !717)
!720 = !DILocation(line: 275, column: 21, scope: !721)
!721 = distinct !DILexicalBlock(scope: !717, file: !48, line: 275, column: 5)
!722 = !DILocation(line: 275, column: 25, scope: !721)
!723 = !DILocation(line: 275, column: 23, scope: !721)
!724 = !DILocation(line: 275, column: 5, scope: !717)
!725 = !DILocation(line: 277, column: 17, scope: !726)
!726 = distinct !DILexicalBlock(scope: !721, file: !48, line: 276, column: 5)
!727 = !DILocation(line: 277, column: 24, scope: !726)
!728 = !DILocation(line: 277, column: 26, scope: !726)
!729 = !DILocation(line: 277, column: 25, scope: !726)
!730 = !DILocation(line: 277, column: 27, scope: !726)
!731 = !DILocation(line: 277, column: 9, scope: !726)
!732 = !DILocation(line: 277, column: 32, scope: !726)
!733 = !DILocation(line: 277, column: 38, scope: !726)
!734 = !DILocation(line: 277, column: 40, scope: !726)
!735 = !DILocation(line: 277, column: 39, scope: !726)
!736 = !DILocation(line: 277, column: 51, scope: !726)
!737 = !DILocation(line: 277, column: 70, scope: !726)
!738 = !DILocation(line: 277, column: 71, scope: !726)
!739 = !DILocation(line: 278, column: 5, scope: !726)
!740 = !DILocation(line: 275, column: 32, scope: !721)
!741 = !DILocation(line: 275, column: 5, scope: !721)
!742 = distinct !{!742, !724, !743, !146}
!743 = !DILocation(line: 278, column: 5, scope: !717)
!744 = !DILocation(line: 279, column: 1, scope: !697)
!745 = distinct !DISubprogram(name: "P1_times_O", scope: !657, file: !657, line: 74, type: !746, scopeLine: 74, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !47, retainedNodes: !66)
!746 = !DISubroutineType(types: !747)
!747 = !{null, !379, !660, !100, !51}
!748 = !DILocalVariable(name: "p", arg: 1, scope: !745, file: !657, line: 74, type: !379)
!749 = !DILocation(line: 74, column: 38, scope: !745)
!750 = !DILocalVariable(name: "P1", arg: 2, scope: !745, file: !657, line: 74, type: !660)
!751 = !DILocation(line: 74, column: 57, scope: !745)
!752 = !DILocalVariable(name: "O", arg: 3, scope: !745, file: !657, line: 74, type: !100)
!753 = !DILocation(line: 74, column: 82, scope: !745)
!754 = !DILocalVariable(name: "acc", arg: 4, scope: !745, file: !657, line: 74, type: !51)
!755 = !DILocation(line: 74, column: 95, scope: !745)
!756 = !DILocation(line: 78, column: 60, scope: !745)
!757 = !DILocation(line: 78, column: 42, scope: !745)
!758 = !DILocation(line: 78, column: 64, scope: !745)
!759 = !DILocation(line: 78, column: 68, scope: !745)
!760 = !DILocation(line: 78, column: 71, scope: !745)
!761 = !DILocation(line: 78, column: 84, scope: !745)
!762 = !DILocation(line: 78, column: 76, scope: !745)
!763 = !DILocation(line: 78, column: 96, scope: !745)
!764 = !DILocation(line: 78, column: 88, scope: !745)
!765 = !DILocation(line: 78, column: 108, scope: !745)
!766 = !DILocation(line: 78, column: 100, scope: !745)
!767 = !DILocation(line: 78, column: 5, scope: !745)
!768 = !DILocation(line: 79, column: 1, scope: !745)
!769 = distinct !DISubprogram(name: "mul_add_mat_trans_x_m_mat", scope: !657, file: !657, line: 47, type: !770, scopeLine: 48, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !47, retainedNodes: !66)
!770 = !DISubroutineType(types: !771)
!771 = !{null, !460, !100, !660, !51, !460, !460, !460}
!772 = !DILocalVariable(name: "m_vec_limbs", arg: 1, scope: !769, file: !657, line: 47, type: !460)
!773 = !DILocation(line: 47, column: 42, scope: !769)
!774 = !DILocalVariable(name: "mat", arg: 2, scope: !769, file: !657, line: 47, type: !100)
!775 = !DILocation(line: 47, column: 76, scope: !769)
!776 = !DILocalVariable(name: "bs_mat", arg: 3, scope: !769, file: !657, line: 47, type: !660)
!777 = !DILocation(line: 47, column: 97, scope: !769)
!778 = !DILocalVariable(name: "acc", arg: 4, scope: !769, file: !657, line: 47, type: !51)
!779 = !DILocation(line: 47, column: 115, scope: !769)
!780 = !DILocalVariable(name: "mat_rows", arg: 5, scope: !769, file: !657, line: 48, type: !460)
!781 = !DILocation(line: 48, column: 42, scope: !769)
!782 = !DILocalVariable(name: "mat_cols", arg: 6, scope: !769, file: !657, line: 48, type: !460)
!783 = !DILocation(line: 48, column: 62, scope: !769)
!784 = !DILocalVariable(name: "bs_mat_cols", arg: 7, scope: !769, file: !657, line: 48, type: !460)
!785 = !DILocation(line: 48, column: 82, scope: !769)
!786 = !DILocalVariable(name: "r", scope: !787, file: !657, line: 50, type: !85)
!787 = distinct !DILexicalBlock(scope: !769, file: !657, line: 50, column: 5)
!788 = !DILocation(line: 50, column: 14, scope: !787)
!789 = !DILocation(line: 50, column: 10, scope: !787)
!790 = !DILocation(line: 50, column: 21, scope: !791)
!791 = distinct !DILexicalBlock(scope: !787, file: !657, line: 50, column: 5)
!792 = !DILocation(line: 50, column: 25, scope: !791)
!793 = !DILocation(line: 50, column: 23, scope: !791)
!794 = !DILocation(line: 50, column: 5, scope: !787)
!795 = !DILocalVariable(name: "c", scope: !796, file: !657, line: 51, type: !85)
!796 = distinct !DILexicalBlock(scope: !797, file: !657, line: 51, column: 9)
!797 = distinct !DILexicalBlock(scope: !791, file: !657, line: 50, column: 40)
!798 = !DILocation(line: 51, column: 18, scope: !796)
!799 = !DILocation(line: 51, column: 14, scope: !796)
!800 = !DILocation(line: 51, column: 25, scope: !801)
!801 = distinct !DILexicalBlock(scope: !796, file: !657, line: 51, column: 9)
!802 = !DILocation(line: 51, column: 29, scope: !801)
!803 = !DILocation(line: 51, column: 27, scope: !801)
!804 = !DILocation(line: 51, column: 9, scope: !796)
!805 = !DILocalVariable(name: "k", scope: !806, file: !657, line: 52, type: !85)
!806 = distinct !DILexicalBlock(scope: !807, file: !657, line: 52, column: 13)
!807 = distinct !DILexicalBlock(scope: !801, file: !657, line: 51, column: 44)
!808 = !DILocation(line: 52, column: 22, scope: !806)
!809 = !DILocation(line: 52, column: 18, scope: !806)
!810 = !DILocation(line: 52, column: 29, scope: !811)
!811 = distinct !DILexicalBlock(scope: !806, file: !657, line: 52, column: 13)
!812 = !DILocation(line: 52, column: 33, scope: !811)
!813 = !DILocation(line: 52, column: 31, scope: !811)
!814 = !DILocation(line: 52, column: 13, scope: !806)
!815 = !DILocation(line: 53, column: 31, scope: !816)
!816 = distinct !DILexicalBlock(scope: !811, file: !657, line: 52, column: 54)
!817 = !DILocation(line: 53, column: 44, scope: !816)
!818 = !DILocation(line: 53, column: 53, scope: !816)
!819 = !DILocation(line: 53, column: 68, scope: !816)
!820 = !DILocation(line: 53, column: 72, scope: !816)
!821 = !DILocation(line: 53, column: 70, scope: !816)
!822 = !DILocation(line: 53, column: 86, scope: !816)
!823 = !DILocation(line: 53, column: 84, scope: !816)
!824 = !DILocation(line: 53, column: 65, scope: !816)
!825 = !DILocation(line: 53, column: 51, scope: !816)
!826 = !DILocation(line: 53, column: 90, scope: !816)
!827 = !DILocation(line: 53, column: 94, scope: !816)
!828 = !DILocation(line: 53, column: 98, scope: !816)
!829 = !DILocation(line: 53, column: 96, scope: !816)
!830 = !DILocation(line: 53, column: 109, scope: !816)
!831 = !DILocation(line: 53, column: 107, scope: !816)
!832 = !DILocation(line: 53, column: 113, scope: !816)
!833 = !DILocation(line: 53, column: 119, scope: !816)
!834 = !DILocation(line: 53, column: 134, scope: !816)
!835 = !DILocation(line: 53, column: 138, scope: !816)
!836 = !DILocation(line: 53, column: 136, scope: !816)
!837 = !DILocation(line: 53, column: 152, scope: !816)
!838 = !DILocation(line: 53, column: 150, scope: !816)
!839 = !DILocation(line: 53, column: 131, scope: !816)
!840 = !DILocation(line: 53, column: 117, scope: !816)
!841 = !DILocation(line: 53, column: 17, scope: !816)
!842 = !DILocation(line: 54, column: 13, scope: !816)
!843 = !DILocation(line: 52, column: 48, scope: !811)
!844 = !DILocation(line: 52, column: 13, scope: !811)
!845 = distinct !{!845, !814, !846, !146}
!846 = !DILocation(line: 54, column: 13, scope: !806)
!847 = !DILocation(line: 55, column: 9, scope: !807)
!848 = !DILocation(line: 51, column: 40, scope: !801)
!849 = !DILocation(line: 51, column: 9, scope: !801)
!850 = distinct !{!850, !804, !851, !146}
!851 = !DILocation(line: 55, column: 9, scope: !796)
!852 = !DILocation(line: 56, column: 5, scope: !797)
!853 = !DILocation(line: 50, column: 36, scope: !791)
!854 = !DILocation(line: 50, column: 5, scope: !791)
!855 = distinct !{!855, !794, !856, !146}
!856 = !DILocation(line: 56, column: 5, scope: !787)
!857 = !DILocation(line: 57, column: 1, scope: !769)
!858 = distinct !DISubprogram(name: "m_vec_mul_add", scope: !859, file: !859, line: 24, type: !860, scopeLine: 24, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !47, retainedNodes: !66)
!859 = !DIFile(filename: "../src/generic/arithmetic_dynamic.h", directory: "/home/siddhesh/Desktop/MAYO-LLVM/llvm-apps", checksumkind: CSK_MD5, checksum: "9d9b1605abeeb1f8f67cf314525f5a25")
!860 = !DISubroutineType(types: !861)
!861 = !{null, !85, !660, !50, !51}
!862 = !DILocalVariable(name: "m_vec_limbs", arg: 1, scope: !858, file: !859, line: 24, type: !85)
!863 = !DILocation(line: 24, column: 24, scope: !858)
!864 = !DILocalVariable(name: "in", arg: 2, scope: !858, file: !859, line: 24, type: !660)
!865 = !DILocation(line: 24, column: 53, scope: !858)
!866 = !DILocalVariable(name: "a", arg: 3, scope: !858, file: !859, line: 24, type: !50)
!867 = !DILocation(line: 24, column: 71, scope: !858)
!868 = !DILocalVariable(name: "acc", arg: 4, scope: !858, file: !859, line: 24, type: !51)
!869 = !DILocation(line: 24, column: 84, scope: !858)
!870 = !DILocalVariable(name: "i", scope: !871, file: !859, line: 25, type: !85)
!871 = distinct !DILexicalBlock(scope: !858, file: !859, line: 25, column: 5)
!872 = !DILocation(line: 25, column: 13, scope: !871)
!873 = !DILocation(line: 25, column: 9, scope: !871)
!874 = !DILocation(line: 25, column: 18, scope: !875)
!875 = distinct !DILexicalBlock(scope: !871, file: !859, line: 25, column: 5)
!876 = !DILocation(line: 25, column: 22, scope: !875)
!877 = !DILocation(line: 25, column: 20, scope: !875)
!878 = !DILocation(line: 25, column: 5, scope: !871)
!879 = !DILocation(line: 26, column: 33, scope: !880)
!880 = distinct !DILexicalBlock(scope: !875, file: !859, line: 25, column: 39)
!881 = !DILocation(line: 26, column: 36, scope: !880)
!882 = !DILocation(line: 26, column: 40, scope: !880)
!883 = !DILocation(line: 26, column: 19, scope: !880)
!884 = !DILocation(line: 26, column: 9, scope: !880)
!885 = !DILocation(line: 26, column: 13, scope: !880)
!886 = !DILocation(line: 26, column: 16, scope: !880)
!887 = !DILocation(line: 27, column: 5, scope: !880)
!888 = !DILocation(line: 25, column: 36, scope: !875)
!889 = !DILocation(line: 25, column: 5, scope: !875)
!890 = distinct !{!890, !878, !891, !146}
!891 = !DILocation(line: 27, column: 5, scope: !871)
!892 = !DILocation(line: 28, column: 1, scope: !858)
!893 = distinct !DISubprogram(name: "gf16v_mul_u64", scope: !894, file: !894, line: 96, type: !895, scopeLine: 96, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !47, retainedNodes: !66)
!894 = !DIFile(filename: "../src/simple_arithmetic.h", directory: "/home/siddhesh/Desktop/MAYO-LLVM/llvm-apps", checksumkind: CSK_MD5, checksum: "7bd1b302fd4eda12f62b408ac2bb07c1")
!895 = !DISubroutineType(types: !896)
!896 = !{!52, !52, !185}
!897 = !DILocalVariable(name: "a", arg: 1, scope: !893, file: !894, line: 96, type: !52)
!898 = !DILocation(line: 96, column: 48, scope: !893)
!899 = !DILocalVariable(name: "b", arg: 2, scope: !893, file: !894, line: 96, type: !185)
!900 = !DILocation(line: 96, column: 59, scope: !893)
!901 = !DILocalVariable(name: "mask_msb", scope: !893, file: !894, line: 97, type: !52)
!902 = !DILocation(line: 97, column: 14, scope: !893)
!903 = !DILocalVariable(name: "a_msb", scope: !893, file: !894, line: 98, type: !52)
!904 = !DILocation(line: 98, column: 14, scope: !893)
!905 = !DILocalVariable(name: "a64", scope: !893, file: !894, line: 99, type: !52)
!906 = !DILocation(line: 99, column: 14, scope: !893)
!907 = !DILocation(line: 99, column: 20, scope: !893)
!908 = !DILocalVariable(name: "b32", scope: !893, file: !894, line: 101, type: !52)
!909 = !DILocation(line: 101, column: 14, scope: !893)
!910 = !DILocation(line: 101, column: 20, scope: !893)
!911 = !DILocation(line: 101, column: 24, scope: !893)
!912 = !DILocation(line: 101, column: 22, scope: !893)
!913 = !DILocalVariable(name: "r64", scope: !893, file: !894, line: 105, type: !52)
!914 = !DILocation(line: 105, column: 14, scope: !893)
!915 = !DILocation(line: 105, column: 20, scope: !893)
!916 = !DILocation(line: 105, column: 27, scope: !893)
!917 = !DILocation(line: 105, column: 31, scope: !893)
!918 = !DILocation(line: 105, column: 24, scope: !893)
!919 = !DILocation(line: 107, column: 13, scope: !893)
!920 = !DILocation(line: 107, column: 19, scope: !893)
!921 = !DILocation(line: 107, column: 17, scope: !893)
!922 = !DILocation(line: 107, column: 11, scope: !893)
!923 = !DILocation(line: 108, column: 12, scope: !893)
!924 = !DILocation(line: 108, column: 9, scope: !893)
!925 = !DILocation(line: 109, column: 12, scope: !893)
!926 = !DILocation(line: 109, column: 16, scope: !893)
!927 = !DILocation(line: 109, column: 26, scope: !893)
!928 = !DILocation(line: 109, column: 32, scope: !893)
!929 = !DILocation(line: 109, column: 38, scope: !893)
!930 = !DILocation(line: 109, column: 22, scope: !893)
!931 = !DILocation(line: 109, column: 9, scope: !893)
!932 = !DILocation(line: 110, column: 13, scope: !893)
!933 = !DILocation(line: 110, column: 22, scope: !893)
!934 = !DILocation(line: 110, column: 26, scope: !893)
!935 = !DILocation(line: 110, column: 32, scope: !893)
!936 = !DILocation(line: 110, column: 18, scope: !893)
!937 = !DILocation(line: 110, column: 9, scope: !893)
!938 = !DILocation(line: 112, column: 13, scope: !893)
!939 = !DILocation(line: 112, column: 19, scope: !893)
!940 = !DILocation(line: 112, column: 17, scope: !893)
!941 = !DILocation(line: 112, column: 11, scope: !893)
!942 = !DILocation(line: 113, column: 12, scope: !893)
!943 = !DILocation(line: 113, column: 9, scope: !893)
!944 = !DILocation(line: 114, column: 12, scope: !893)
!945 = !DILocation(line: 114, column: 16, scope: !893)
!946 = !DILocation(line: 114, column: 26, scope: !893)
!947 = !DILocation(line: 114, column: 32, scope: !893)
!948 = !DILocation(line: 114, column: 38, scope: !893)
!949 = !DILocation(line: 114, column: 22, scope: !893)
!950 = !DILocation(line: 114, column: 9, scope: !893)
!951 = !DILocation(line: 115, column: 13, scope: !893)
!952 = !DILocation(line: 115, column: 22, scope: !893)
!953 = !DILocation(line: 115, column: 26, scope: !893)
!954 = !DILocation(line: 115, column: 32, scope: !893)
!955 = !DILocation(line: 115, column: 18, scope: !893)
!956 = !DILocation(line: 115, column: 9, scope: !893)
!957 = !DILocation(line: 117, column: 13, scope: !893)
!958 = !DILocation(line: 117, column: 19, scope: !893)
!959 = !DILocation(line: 117, column: 17, scope: !893)
!960 = !DILocation(line: 117, column: 11, scope: !893)
!961 = !DILocation(line: 118, column: 12, scope: !893)
!962 = !DILocation(line: 118, column: 9, scope: !893)
!963 = !DILocation(line: 119, column: 12, scope: !893)
!964 = !DILocation(line: 119, column: 16, scope: !893)
!965 = !DILocation(line: 119, column: 26, scope: !893)
!966 = !DILocation(line: 119, column: 32, scope: !893)
!967 = !DILocation(line: 119, column: 38, scope: !893)
!968 = !DILocation(line: 119, column: 22, scope: !893)
!969 = !DILocation(line: 119, column: 9, scope: !893)
!970 = !DILocation(line: 120, column: 13, scope: !893)
!971 = !DILocation(line: 120, column: 22, scope: !893)
!972 = !DILocation(line: 120, column: 26, scope: !893)
!973 = !DILocation(line: 120, column: 32, scope: !893)
!974 = !DILocation(line: 120, column: 18, scope: !893)
!975 = !DILocation(line: 120, column: 9, scope: !893)
!976 = !DILocation(line: 122, column: 12, scope: !893)
!977 = !DILocation(line: 122, column: 5, scope: !893)
!978 = distinct !DISubprogram(name: "mul_add_m_upper_triangular_mat_x_mat", scope: !657, file: !657, line: 16, type: !979, scopeLine: 17, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !47, retainedNodes: !66)
!979 = !DISubroutineType(types: !980)
!980 = !{null, !460, !660, !100, !51, !460, !460, !460, !460}
!981 = !DILocalVariable(name: "m_vec_limbs", arg: 1, scope: !978, file: !657, line: 16, type: !460)
!982 = !DILocation(line: 16, column: 53, scope: !978)
!983 = !DILocalVariable(name: "bs_mat", arg: 2, scope: !978, file: !657, line: 16, type: !660)
!984 = !DILocation(line: 16, column: 82, scope: !978)
!985 = !DILocalVariable(name: "mat", arg: 3, scope: !978, file: !657, line: 16, type: !100)
!986 = !DILocation(line: 16, column: 111, scope: !978)
!987 = !DILocalVariable(name: "acc", arg: 4, scope: !978, file: !657, line: 16, type: !51)
!988 = !DILocation(line: 16, column: 126, scope: !978)
!989 = !DILocalVariable(name: "bs_mat_rows", arg: 5, scope: !978, file: !657, line: 17, type: !460)
!990 = !DILocation(line: 17, column: 53, scope: !978)
!991 = !DILocalVariable(name: "bs_mat_cols", arg: 6, scope: !978, file: !657, line: 17, type: !460)
!992 = !DILocation(line: 17, column: 76, scope: !978)
!993 = !DILocalVariable(name: "mat_cols", arg: 7, scope: !978, file: !657, line: 17, type: !460)
!994 = !DILocation(line: 17, column: 99, scope: !978)
!995 = !DILocalVariable(name: "triangular", arg: 8, scope: !978, file: !657, line: 17, type: !460)
!996 = !DILocation(line: 17, column: 119, scope: !978)
!997 = !DILocalVariable(name: "bs_mat_entries_used", scope: !978, file: !657, line: 19, type: !85)
!998 = !DILocation(line: 19, column: 9, scope: !978)
!999 = !DILocalVariable(name: "r", scope: !1000, file: !657, line: 20, type: !85)
!1000 = distinct !DILexicalBlock(scope: !978, file: !657, line: 20, column: 5)
!1001 = !DILocation(line: 20, column: 14, scope: !1000)
!1002 = !DILocation(line: 20, column: 10, scope: !1000)
!1003 = !DILocation(line: 20, column: 21, scope: !1004)
!1004 = distinct !DILexicalBlock(scope: !1000, file: !657, line: 20, column: 5)
!1005 = !DILocation(line: 20, column: 25, scope: !1004)
!1006 = !DILocation(line: 20, column: 23, scope: !1004)
!1007 = !DILocation(line: 20, column: 5, scope: !1000)
!1008 = !DILocalVariable(name: "c", scope: !1009, file: !657, line: 21, type: !85)
!1009 = distinct !DILexicalBlock(scope: !1010, file: !657, line: 21, column: 9)
!1010 = distinct !DILexicalBlock(scope: !1004, file: !657, line: 20, column: 43)
!1011 = !DILocation(line: 21, column: 18, scope: !1009)
!1012 = !DILocation(line: 21, column: 22, scope: !1009)
!1013 = !DILocation(line: 21, column: 35, scope: !1009)
!1014 = !DILocation(line: 21, column: 33, scope: !1009)
!1015 = !DILocation(line: 21, column: 14, scope: !1009)
!1016 = !DILocation(line: 21, column: 38, scope: !1017)
!1017 = distinct !DILexicalBlock(scope: !1009, file: !657, line: 21, column: 9)
!1018 = !DILocation(line: 21, column: 42, scope: !1017)
!1019 = !DILocation(line: 21, column: 40, scope: !1017)
!1020 = !DILocation(line: 21, column: 9, scope: !1009)
!1021 = !DILocalVariable(name: "k", scope: !1022, file: !657, line: 22, type: !85)
!1022 = distinct !DILexicalBlock(scope: !1023, file: !657, line: 22, column: 13)
!1023 = distinct !DILexicalBlock(scope: !1017, file: !657, line: 21, column: 60)
!1024 = !DILocation(line: 22, column: 22, scope: !1022)
!1025 = !DILocation(line: 22, column: 18, scope: !1022)
!1026 = !DILocation(line: 22, column: 29, scope: !1027)
!1027 = distinct !DILexicalBlock(scope: !1022, file: !657, line: 22, column: 13)
!1028 = !DILocation(line: 22, column: 33, scope: !1027)
!1029 = !DILocation(line: 22, column: 31, scope: !1027)
!1030 = !DILocation(line: 22, column: 13, scope: !1022)
!1031 = !DILocation(line: 23, column: 31, scope: !1032)
!1032 = distinct !DILexicalBlock(scope: !1027, file: !657, line: 22, column: 51)
!1033 = !DILocation(line: 23, column: 44, scope: !1032)
!1034 = !DILocation(line: 23, column: 53, scope: !1032)
!1035 = !DILocation(line: 23, column: 67, scope: !1032)
!1036 = !DILocation(line: 23, column: 65, scope: !1032)
!1037 = !DILocation(line: 23, column: 51, scope: !1032)
!1038 = !DILocation(line: 23, column: 88, scope: !1032)
!1039 = !DILocation(line: 23, column: 92, scope: !1032)
!1040 = !DILocation(line: 23, column: 96, scope: !1032)
!1041 = !DILocation(line: 23, column: 94, scope: !1032)
!1042 = !DILocation(line: 23, column: 107, scope: !1032)
!1043 = !DILocation(line: 23, column: 105, scope: !1032)
!1044 = !DILocation(line: 23, column: 111, scope: !1032)
!1045 = !DILocation(line: 23, column: 117, scope: !1032)
!1046 = !DILocation(line: 23, column: 132, scope: !1032)
!1047 = !DILocation(line: 23, column: 136, scope: !1032)
!1048 = !DILocation(line: 23, column: 134, scope: !1032)
!1049 = !DILocation(line: 23, column: 147, scope: !1032)
!1050 = !DILocation(line: 23, column: 145, scope: !1032)
!1051 = !DILocation(line: 23, column: 129, scope: !1032)
!1052 = !DILocation(line: 23, column: 115, scope: !1032)
!1053 = !DILocation(line: 23, column: 17, scope: !1032)
!1054 = !DILocation(line: 24, column: 13, scope: !1032)
!1055 = !DILocation(line: 22, column: 45, scope: !1027)
!1056 = !DILocation(line: 22, column: 13, scope: !1027)
!1057 = distinct !{!1057, !1030, !1058, !146}
!1058 = !DILocation(line: 24, column: 13, scope: !1022)
!1059 = !DILocation(line: 25, column: 33, scope: !1023)
!1060 = !DILocation(line: 26, column: 9, scope: !1023)
!1061 = !DILocation(line: 21, column: 56, scope: !1017)
!1062 = !DILocation(line: 21, column: 9, scope: !1017)
!1063 = distinct !{!1063, !1020, !1064, !146}
!1064 = !DILocation(line: 26, column: 9, scope: !1009)
!1065 = !DILocation(line: 27, column: 5, scope: !1010)
!1066 = !DILocation(line: 20, column: 39, scope: !1004)
!1067 = !DILocation(line: 20, column: 5, scope: !1004)
!1068 = distinct !{!1068, !1007, !1069, !146}
!1069 = !DILocation(line: 27, column: 5, scope: !1000)
!1070 = !DILocation(line: 28, column: 1, scope: !978)
!1071 = distinct !DISubprogram(name: "unpack_m_vecs", scope: !48, file: !48, line: 262, type: !1072, scopeLine: 262, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !47, retainedNodes: !66)
!1072 = !DISubroutineType(types: !1073)
!1073 = !{null, !100, !51, !85, !85}
!1074 = !DILocalVariable(name: "in", arg: 1, scope: !1071, file: !48, line: 262, type: !100)
!1075 = !DILocation(line: 262, column: 48, scope: !1071)
!1076 = !DILocalVariable(name: "out", arg: 2, scope: !1071, file: !48, line: 262, type: !51)
!1077 = !DILocation(line: 262, column: 62, scope: !1071)
!1078 = !DILocalVariable(name: "vecs", arg: 3, scope: !1071, file: !48, line: 262, type: !85)
!1079 = !DILocation(line: 262, column: 71, scope: !1071)
!1080 = !DILocalVariable(name: "m", arg: 4, scope: !1071, file: !48, line: 262, type: !85)
!1081 = !DILocation(line: 262, column: 81, scope: !1071)
!1082 = !DILocalVariable(name: "m_vec_limbs", scope: !1071, file: !48, line: 263, type: !460)
!1083 = !DILocation(line: 263, column: 15, scope: !1071)
!1084 = !DILocation(line: 263, column: 30, scope: !1071)
!1085 = !DILocation(line: 263, column: 32, scope: !1071)
!1086 = !DILocation(line: 263, column: 38, scope: !1071)
!1087 = !DILocalVariable(name: "_out", scope: !1071, file: !48, line: 264, type: !59)
!1088 = !DILocation(line: 264, column: 20, scope: !1071)
!1089 = !DILocation(line: 264, column: 45, scope: !1071)
!1090 = !DILocalVariable(name: "tmp", scope: !1071, file: !48, line: 265, type: !1091)
!1091 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 576, elements: !1092)
!1092 = !{!1093}
!1093 = !DISubrange(count: 9)
!1094 = !DILocation(line: 265, column: 14, scope: !1071)
!1095 = !DILocalVariable(name: "i", scope: !1096, file: !48, line: 266, type: !85)
!1096 = distinct !DILexicalBlock(scope: !1071, file: !48, line: 266, column: 5)
!1097 = !DILocation(line: 266, column: 14, scope: !1096)
!1098 = !DILocation(line: 266, column: 18, scope: !1096)
!1099 = !DILocation(line: 266, column: 22, scope: !1096)
!1100 = !DILocation(line: 266, column: 10, scope: !1096)
!1101 = !DILocation(line: 266, column: 26, scope: !1102)
!1102 = distinct !DILexicalBlock(scope: !1096, file: !48, line: 266, column: 5)
!1103 = !DILocation(line: 266, column: 28, scope: !1102)
!1104 = !DILocation(line: 266, column: 5, scope: !1096)
!1105 = !DILocation(line: 268, column: 9, scope: !1106)
!1106 = distinct !DILexicalBlock(scope: !1102, file: !48, line: 267, column: 5)
!1107 = !DILocation(line: 268, column: 21, scope: !1106)
!1108 = !DILocation(line: 268, column: 26, scope: !1106)
!1109 = !DILocation(line: 268, column: 28, scope: !1106)
!1110 = !DILocation(line: 268, column: 27, scope: !1106)
!1111 = !DILocation(line: 268, column: 29, scope: !1106)
!1112 = !DILocation(line: 268, column: 33, scope: !1106)
!1113 = !DILocation(line: 268, column: 34, scope: !1106)
!1114 = !DILocation(line: 269, column: 16, scope: !1106)
!1115 = !DILocation(line: 269, column: 23, scope: !1106)
!1116 = !DILocation(line: 269, column: 25, scope: !1106)
!1117 = !DILocation(line: 269, column: 24, scope: !1106)
!1118 = !DILocation(line: 269, column: 36, scope: !1106)
!1119 = !DILocation(line: 269, column: 9, scope: !1106)
!1120 = !DILocation(line: 269, column: 60, scope: !1106)
!1121 = !DILocation(line: 269, column: 71, scope: !1106)
!1122 = !DILocation(line: 270, column: 5, scope: !1106)
!1123 = !DILocation(line: 266, column: 35, scope: !1102)
!1124 = !DILocation(line: 266, column: 5, scope: !1102)
!1125 = distinct !{!1125, !1104, !1126, !146}
!1126 = !DILocation(line: 270, column: 5, scope: !1096)
!1127 = !DILocation(line: 271, column: 1, scope: !1071)
!1128 = distinct !DISubprogram(name: "mayo_expand_sk", scope: !48, file: !48, line: 310, type: !1129, scopeLine: 311, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !47, retainedNodes: !66)
!1129 = !DISubroutineType(types: !1130)
!1130 = !{!85, !379, !100, !1131}
!1131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1132, size: 64)
!1132 = !DIDerivedType(tag: DW_TAG_typedef, name: "sk_t", file: !91, line: 294, baseType: !1133)
!1133 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sk_t", file: !91, line: 291, size: 7257920, elements: !1134)
!1134 = !{!1135, !1136}
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !1133, file: !91, line: 292, baseType: !180, size: 7238592)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "O", scope: !1133, file: !91, line: 293, baseType: !184, size: 19312, offset: 7238592)
!1137 = !DILocalVariable(name: "p", arg: 1, scope: !1128, file: !48, line: 310, type: !379)
!1138 = !DILocation(line: 310, column: 41, scope: !1128)
!1139 = !DILocalVariable(name: "csk", arg: 2, scope: !1128, file: !48, line: 310, type: !100)
!1140 = !DILocation(line: 310, column: 65, scope: !1128)
!1141 = !DILocalVariable(name: "sk", arg: 3, scope: !1128, file: !48, line: 311, type: !1131)
!1142 = !DILocation(line: 311, column: 26, scope: !1128)
!1143 = !DILocalVariable(name: "ret", scope: !1128, file: !48, line: 312, type: !85)
!1144 = !DILocation(line: 312, column: 9, scope: !1128)
!1145 = !DILocalVariable(name: "S", scope: !1128, file: !48, line: 313, type: !443)
!1146 = !DILocation(line: 313, column: 19, scope: !1128)
!1147 = !DILocalVariable(name: "P", scope: !1128, file: !48, line: 314, type: !51)
!1148 = !DILocation(line: 314, column: 15, scope: !1128)
!1149 = !DILocation(line: 314, column: 19, scope: !1128)
!1150 = !DILocation(line: 314, column: 23, scope: !1128)
!1151 = !DILocalVariable(name: "O", scope: !1128, file: !48, line: 315, type: !59)
!1152 = !DILocation(line: 315, column: 20, scope: !1128)
!1153 = !DILocation(line: 315, column: 24, scope: !1128)
!1154 = !DILocation(line: 315, column: 28, scope: !1128)
!1155 = !DILocalVariable(name: "param_o", scope: !1128, file: !48, line: 317, type: !460)
!1156 = !DILocation(line: 317, column: 15, scope: !1128)
!1157 = !DILocation(line: 317, column: 33, scope: !1128)
!1158 = !DILocation(line: 317, column: 25, scope: !1128)
!1159 = !DILocalVariable(name: "param_v", scope: !1128, file: !48, line: 318, type: !460)
!1160 = !DILocation(line: 318, column: 15, scope: !1128)
!1161 = !DILocation(line: 318, column: 33, scope: !1128)
!1162 = !DILocation(line: 318, column: 25, scope: !1128)
!1163 = !DILocalVariable(name: "param_O_bytes", scope: !1128, file: !48, line: 319, type: !460)
!1164 = !DILocation(line: 319, column: 15, scope: !1128)
!1165 = !DILocation(line: 319, column: 45, scope: !1128)
!1166 = !DILocation(line: 319, column: 31, scope: !1128)
!1167 = !DILocalVariable(name: "param_pk_seed_bytes", scope: !1128, file: !48, line: 320, type: !460)
!1168 = !DILocation(line: 320, column: 15, scope: !1128)
!1169 = !DILocation(line: 320, column: 57, scope: !1128)
!1170 = !DILocation(line: 320, column: 37, scope: !1128)
!1171 = !DILocalVariable(name: "param_sk_seed_bytes", scope: !1128, file: !48, line: 321, type: !460)
!1172 = !DILocation(line: 321, column: 15, scope: !1128)
!1173 = !DILocation(line: 321, column: 57, scope: !1128)
!1174 = !DILocation(line: 321, column: 37, scope: !1128)
!1175 = !DILocalVariable(name: "seed_sk", scope: !1128, file: !48, line: 323, type: !100)
!1176 = !DILocation(line: 323, column: 26, scope: !1128)
!1177 = !DILocation(line: 323, column: 36, scope: !1128)
!1178 = !DILocalVariable(name: "seed_pk", scope: !1128, file: !48, line: 324, type: !59)
!1179 = !DILocation(line: 324, column: 20, scope: !1128)
!1180 = !DILocation(line: 324, column: 30, scope: !1128)
!1181 = !DILocation(line: 326, column: 14, scope: !1128)
!1182 = !DILocation(line: 326, column: 17, scope: !1128)
!1183 = !DILocation(line: 326, column: 39, scope: !1128)
!1184 = !DILocation(line: 326, column: 37, scope: !1128)
!1185 = !DILocation(line: 326, column: 54, scope: !1128)
!1186 = !DILocation(line: 327, column: 14, scope: !1128)
!1187 = !DILocation(line: 326, column: 5, scope: !1128)
!1188 = !DILocation(line: 328, column: 12, scope: !1128)
!1189 = !DILocation(line: 328, column: 16, scope: !1128)
!1190 = !DILocation(line: 328, column: 14, scope: !1128)
!1191 = !DILocation(line: 328, column: 37, scope: !1128)
!1192 = !DILocation(line: 328, column: 40, scope: !1128)
!1193 = !DILocation(line: 328, column: 50, scope: !1128)
!1194 = !DILocation(line: 328, column: 48, scope: !1128)
!1195 = !DILocation(line: 328, column: 5, scope: !1128)
