; ModuleID = '../no_struct/mayo1.ll'
source_filename = "composite"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "arm-unknown-none-eabi"

@pqmayo_MAYO_1_ref_uint32_t_blocker = dso_local local_unnamed_addr global i32 0, align 4, !dbg !0
@pqmayo_MAYO_1_ref_uint64_t_blocker = dso_local local_unnamed_addr global i64 0, align 8, !dbg !27
@pqmayo_MAYO_1_ref_unsigned_char_blocker = dso_local local_unnamed_addr global i8 0, align 1, !dbg !31

; Function Attrs: inlinehint nounwind
define dso_local fastcc void @compute_P3(ptr noundef %p, ptr noundef nonnull %P1, ptr noundef nonnull %P2, ptr noundef nonnull %O, ptr noundef nonnull %P3) unnamed_addr #0 !dbg !91 {
entry:
    #dbg_value(ptr %p, !127, !DIExpression(), !128)
    #dbg_value(ptr %P1, !129, !DIExpression(), !128)
    #dbg_value(ptr %P2, !130, !DIExpression(), !128)
    #dbg_value(ptr %O, !131, !DIExpression(), !128)
    #dbg_value(ptr %P3, !132, !DIExpression(), !128)
    #dbg_value(i32 5, !133, !DIExpression(), !128)
    #dbg_value(i32 78, !135, !DIExpression(), !128)
    #dbg_value(i32 8, !136, !DIExpression(), !128)
    #dbg_value(ptr %p, !137, !DIExpression(), !141)
    #dbg_value(ptr %P1, !143, !DIExpression(), !141)
    #dbg_value(ptr %O, !144, !DIExpression(), !141)
    #dbg_value(ptr %P2, !145, !DIExpression(), !141)
    #dbg_value(i32 5, !146, !DIExpression(), !150)
    #dbg_value(ptr %P1, !152, !DIExpression(), !150)
    #dbg_value(ptr %O, !153, !DIExpression(), !150)

!34 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !16)
!35 = distinct !DICompileUnit(language: DW_LANG_C11, file: !36, producer: "Ubuntu clang version 20.1.2 (0ubuntu1~24.04.2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!36 = !DIFile(filename: "../<stdin>", directory: "/home/siddhesh/Desktop/MAYO-LLVM/llvm-apps/mayo_pass/build")
!37 = distinct !DICompileUnit(language: DW_LANG_C11, file: !3, producer: "Ubuntu clang version 20.1.2 (0ubuntu1~24.04.2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !38, globals: !45, splitDebugInlining: false, nameTableKind: None)
!38 = !{!39, !40, !15, !43, !14, !16}
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 32)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 32)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !6, line: 24, baseType: !42)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !8, line: 43, baseType: !15)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !44, line: 214, baseType: !18)
!44 = !DIFile(filename: "/usr/lib/gcc/arm-none-eabi/13.2.1/include/stddef.h", directory: "")
!45 = !{!46, !52, !60, !62, !64}
!46 = !DIGlobalVariableExpression(var: !47, expr: !DIExpression())
!47 = distinct !DIGlobalVariable(name: "f_tail", scope: !37, file: !48, line: 247, type: !49, isLocal: true, isDefinition: true)
!48 = !DIFile(filename: "../../../include/mayo.h", directory: "/home/siddhesh/Desktop/MAYO-LLVM/llvm-apps/mayo_pass/build")
!49 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 32, elements: !50)
!50 = !{!51}
!51 = !DISubrange(count: 4)
!52 = !DIGlobalVariableExpression(var: !53, expr: !DIExpression())
!53 = distinct !DIGlobalVariable(name: "even_nibbles", scope: !54, file: !55, line: 112, type: !59, isLocal: true, isDefinition: true)
!54 = distinct !DISubprogram(name: "transpose_16x16_nibbles", scope: !55, file: !55, line: 111, type: !56, scopeLine: 111, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !37, retainedNodes: !58)
!55 = !DIFile(filename: "../../../src/mayo.c", directory: "/home/siddhesh/Desktop/MAYO-LLVM/llvm-apps/mayo_pass/build")
!56 = !DISubroutineType(types: !57)
!57 = !{null, !39}
!58 = !{}
!59 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!60 = !DIGlobalVariableExpression(var: !61, expr: !DIExpression())
!61 = distinct !DIGlobalVariable(name: "even_bytes", scope: !54, file: !55, line: 113, type: !59, isLocal: true, isDefinition: true)
!62 = !DIGlobalVariableExpression(var: !63, expr: !DIExpression())
!63 = distinct !DIGlobalVariable(name: "even_2bytes", scope: !54, file: !55, line: 114, type: !59, isLocal: true, isDefinition: true)
!64 = !DIGlobalVariableExpression(var: !65, expr: !DIExpression())
!65 = distinct !DIGlobalVariable(name: "even_half", scope: !54, file: !55, line: 115, type: !59, isLocal: true, isDefinition: true)
!66 = distinct !DICompileUnit(language: DW_LANG_C11, file: !67, producer: "Ubuntu clang version 20.1.2 (0ubuntu1~24.04.2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !68, globals: !70, splitDebugInlining: false, nameTableKind: None)
!67 = !DIFile(filename: "../../../src/common/<stdin>", directory: "/home/siddhesh/Desktop/MAYO-LLVM/llvm-apps/mayo_pass/build")
!68 = !{!69, !16, !5, !43, !41}
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!70 = !{!71}
!71 = !DIGlobalVariableExpression(var: !72, expr: !DIExpression())
!72 = distinct !DIGlobalVariable(name: "KeccakF_RoundConstants", scope: !66, file: !73, line: 214, type: !74, isLocal: true, isDefinition: true)
!73 = !DIFile(filename: "../../../src/common/fips202.c", directory: "/home/siddhesh/Desktop/MAYO-LLVM/llvm-apps/mayo_pass/build")
!74 = !DICompositeType(tag: DW_TAG_array_type, baseType: !59, size: 1536, elements: !75)
!75 = !{!76}
!76 = !DISubrange(count: 24)
!77 = distinct !DICompileUnit(language: DW_LANG_C11, file: !67, producer: "Ubuntu clang version 20.1.2 (0ubuntu1~24.04.2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !78, globals: !79, splitDebugInlining: false, nameTableKind: None)
!78 = !{!69, !10, !5, !16, !15}
!79 = !{!80}
!80 = !DIGlobalVariableExpression(var: !81, expr: !DIExpression())
!81 = distinct !DIGlobalVariable(name: "Rcon", scope: !77, file: !82, line: 388, type: !83, isLocal: true, isDefinition: true)
!82 = !DIFile(filename: "../../../src/common/aes_c.c", directory: "/home/siddhesh/Desktop/MAYO-LLVM/llvm-apps/mayo_pass/build")
!83 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 80, elements: !84)
!84 = !{!85}
!85 = !DISubrange(count: 10)
!86 = !{!"Ubuntu clang version 20.1.2 (0ubuntu1~24.04.2)"}
!87 = !{i32 2, !"Debug Info Version", i32 3}
!88 = !{i32 1, !"wchar_size", i32 4}
!89 = !{i32 1, !"min_enum_size", i32 4}
!90 = !{i32 1, !"Code Model", i32 1}
!91 = distinct !DISubprogram(name: "compute_P3", scope: !92, file: !92, line: 260, type: !93, scopeLine: 260, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !37, retainedNodes: !58)
!92 = !DIFile(filename: "../../../src/generic/generic_arithmetic.h", directory: "/home/siddhesh/Desktop/MAYO-LLVM/llvm-apps/mayo_pass/build")
!93 = !DISubroutineType(types: !94)
!94 = !{null, !95, !126, !39, !19, !39}
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 32)
!96 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !97)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "mayo_params_t", file: !48, line: 289, baseType: !98)
!98 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !48, line: 265, size: 736, elements: !99)
!99 = !{!100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !98, file: !48, line: 266, baseType: !10, size: 32)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !98, file: !48, line: 267, baseType: !10, size: 32, offset: 32)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "o", scope: !98, file: !48, line: 268, baseType: !10, size: 32, offset: 64)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "k", scope: !98, file: !48, line: 269, baseType: !10, size: 32, offset: 96)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !98, file: !48, line: 270, baseType: !10, size: 32, offset: 128)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "f_tail", scope: !98, file: !48, line: 271, baseType: !19, size: 32, offset: 160)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "m_bytes", scope: !98, file: !48, line: 272, baseType: !10, size: 32, offset: 192)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "O_bytes", scope: !98, file: !48, line: 273, baseType: !10, size: 32, offset: 224)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "v_bytes", scope: !98, file: !48, line: 274, baseType: !10, size: 32, offset: 256)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "r_bytes", scope: !98, file: !48, line: 275, baseType: !10, size: 32, offset: 288)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "R_bytes", scope: !98, file: !48, line: 276, baseType: !10, size: 32, offset: 320)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "P1_bytes", scope: !98, file: !48, line: 277, baseType: !10, size: 32, offset: 352)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "P2_bytes", scope: !98, file: !48, line: 278, baseType: !10, size: 32, offset: 384)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "P3_bytes", scope: !98, file: !48, line: 279, baseType: !10, size: 32, offset: 416)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "csk_bytes", scope: !98, file: !48, line: 280, baseType: !10, size: 32, offset: 448)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "cpk_bytes", scope: !98, file: !48, line: 281, baseType: !10, size: 32, offset: 480)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "sig_bytes", scope: !98, file: !48, line: 282, baseType: !10, size: 32, offset: 512)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "salt_bytes", scope: !98, file: !48, line: 283, baseType: !10, size: 32, offset: 544)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "sk_seed_bytes", scope: !98, file: !48, line: 284, baseType: !10, size: 32, offset: 576)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "digest_bytes", scope: !98, file: !48, line: 285, baseType: !10, size: 32, offset: 608)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "pk_seed_bytes", scope: !98, file: !48, line: 286, baseType: !10, size: 32, offset: 640)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "m_vec_limbs", scope: !98, file: !48, line: 287, baseType: !10, size: 32, offset: 672)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !98, file: !48, line: 288, baseType: !123, size: 32, offset: 704)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 32)
!124 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !125)
!125 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 32)
!127 = !DILocalVariable(name: "p", arg: 1, scope: !91, file: !92, line: 260, type: !95)
!128 = !DILocation(line: 0, scope: !91)
!129 = !DILocalVariable(name: "P1", arg: 2, scope: !91, file: !92, line: 260, type: !126)
!130 = !DILocalVariable(name: "P2", arg: 3, scope: !91, file: !92, line: 260, type: !39)
!131 = !DILocalVariable(name: "O", arg: 4, scope: !91, file: !92, line: 260, type: !19)
!132 = !DILocalVariable(name: "P3", arg: 5, scope: !91, file: !92, line: 260, type: !39)
!133 = !DILocalVariable(name: "m_vec_limbs", scope: !91, file: !92, line: 262, type: !134)
!134 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !10)
!135 = !DILocalVariable(name: "param_v", scope: !91, file: !92, line: 263, type: !134)
!136 = !DILocalVariable(name: "param_o", scope: !91, file: !92, line: 264, type: !134)
!137 = !DILocalVariable(name: "p", arg: 1, scope: !138, file: !92, line: 74, type: !95)
!138 = distinct !DISubprogram(name: "P1_times_O", scope: !92, file: !92, line: 74, type: !139, scopeLine: 74, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !37, retainedNodes: !58)
!139 = !DISubroutineType(types: !140)
!140 = !{null, !95, !126, !19, !39}
!141 = !DILocation(line: 0, scope: !138, inlinedAt: !142)
!142 = distinct !DILocation(line: 267, column: 5, scope: !91)
!143 = !DILocalVariable(name: "P1", arg: 2, scope: !138, file: !92, line: 74, type: !126)
!144 = !DILocalVariable(name: "O", arg: 3, scope: !138, file: !92, line: 74, type: !19)
!145 = !DILocalVariable(name: "acc", arg: 4, scope: !138, file: !92, line: 74, type: !39)
!146 = !DILocalVariable(name: "m_vec_limbs", arg: 1, scope: !147, file: !92, line: 16, type: !134)
!147 = distinct !DISubprogram(name: "mul_add_m_upper_triangular_mat_x_mat", scope: !92, file: !92, line: 16, type: !148, scopeLine: 17, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !37, retainedNodes: !58)
!148 = !DISubroutineType(types: !149)
!149 = !{null, !134, !126, !19, !39, !134, !134, !134, !134}
!150 = !DILocation(line: 0, scope: !147, inlinedAt: !151)
!151 = distinct !DILocation(line: 78, column: 5, scope: !138, inlinedAt: !142)
!152 = !DILocalVariable(name: "bs_mat", arg: 2, scope: !147, file: !92, line: 16, type: !126)
!153 = !DILocalVariable(name: "mat", arg: 3, scope: !147, file: !92, line: 16, type: !19)
!154 = !DILocalVariable(name: "acc", arg: 4, scope: !147, file: !92, line: 16, type: !39)
!155 = !DILocalVariable(name: "bs_mat_rows", arg: 5, scope: !147, file: !92, line: 17, type: !134)
!156 = !DILocalVariable(name: "bs_mat_cols", arg: 6, scope: !147, file: !92, line: 17, type: !134)
!157 = !DILocalVariable(name: "mat_cols", arg: 7, scope: !147, file: !92, line: 17, type: !134)
!158 = !DILocalVariable(name: "triangular", arg: 8, scope: !147, file: !92, line: 17, type: !134)
!159 = !DILocalVariable(name: "bs_mat_entries_used", scope: !147, file: !92, line: 19, type: !10)
!160 = !DILocalVariable(name: "r", scope: !161, file: !92, line: 20, type: !10)
!161 = distinct !DILexicalBlock(scope: !147, file: !92, line: 20, column: 5)
!162 = !DILocation(line: 0, scope: !161, inlinedAt: !151)
!163 = !DILocation(line: 20, column: 5, scope: !161, inlinedAt: !151)
!164 = !DILocation(line: 21, column: 9, scope: !165, inlinedAt: !151)
!165 = distinct !DILexicalBlock(scope: !166, file: !92, line: 21, column: 9)
!166 = distinct !DILexicalBlock(scope: !167, file: !92, line: 20, column: 43)
!167 = distinct !DILexicalBlock(scope: !161, file: !92, line: 20, column: 5)
!168 = !DILocalVariable(name: "c", scope: !165, file: !92, line: 21, type: !10)
