; ModuleID = 'composite'
source_filename = "composite"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "arm-unknown-none-eabi"

%struct.sk_t = type { [48762 x i64], [1080 x i8] }

@__const.example_mayo.msg = private unnamed_addr constant <{ i8, [31 x i8] }> <{ i8 14, [31 x i8] zeroinitializer }>, align 1
@.str = private unnamed_addr constant [17 x i8] c"Example with %s\0A\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [7 x i8] c"MAYO_3\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [17 x i8] c"mayo_keypair -> \00", align 1, !dbg !12
@.str.3 = private unnamed_addr constant [6 x i8] c"FAIL\0A\00", align 1, !dbg !14
@.str.4 = private unnamed_addr constant [4 x i8] c"OK\0A\00", align 1, !dbg !19
@.str.5 = private unnamed_addr constant [19 x i8] c"mayo_expand_sk -> \00", align 1, !dbg !24
@.str.6 = private unnamed_addr constant [19 x i8] c"mayo_expand_pk -> \00", align 1, !dbg !29
@.str.7 = private unnamed_addr constant [14 x i8] c"mayo_sign -> \00", align 1, !dbg !31
@.str.8 = private unnamed_addr constant [39 x i8] c"mayo_open (with correct signature) -> \00", align 1, !dbg !36
@.str.9 = private unnamed_addr constant [41 x i8] c"mayo_verify (with correct signature) -> \00", align 1, !dbg !41
@f_tail = internal unnamed_addr constant [4 x i8] c"\08\00\01\07", align 1, !dbg !46
@pqmayo_MAYO_3_ref_uint32_t_blocker = dso_local local_unnamed_addr global i32 0, align 4, !dbg !82

!60 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 32)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !54, line: 48, baseType: !63)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !56, line: 79, baseType: !60)
!64 = !{!46, !65, !73, !75, !77}
!65 = !DIGlobalVariableExpression(var: !66, expr: !DIExpression())
!66 = distinct !DIGlobalVariable(name: "even_nibbles", scope: !67, file: !68, line: 112, type: !72, isLocal: true, isDefinition: true)
!67 = distinct !DISubprogram(name: "transpose_16x16_nibbles", scope: !68, file: !68, line: 111, type: !69, scopeLine: 111, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !48, retainedNodes: !71)
!68 = !DIFile(filename: "../../../src/mayo.c", directory: "/home/siddhesh/Desktop/MAYO-LLVM/llvm-apps/mayo_pass/build")
!69 = !DISubroutineType(types: !70)
!70 = !{null, !52}
!71 = !{}
!72 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !53)
!73 = !DIGlobalVariableExpression(var: !74, expr: !DIExpression())
!74 = distinct !DIGlobalVariable(name: "even_bytes", scope: !67, file: !68, line: 113, type: !72, isLocal: true, isDefinition: true)
!75 = !DIGlobalVariableExpression(var: !76, expr: !DIExpression())
!76 = distinct !DIGlobalVariable(name: "even_2bytes", scope: !67, file: !68, line: 114, type: !72, isLocal: true, isDefinition: true)
!77 = !DIGlobalVariableExpression(var: !78, expr: !DIExpression())
!78 = distinct !DIGlobalVariable(name: "even_half", scope: !67, file: !68, line: 115, type: !72, isLocal: true, isDefinition: true)
!79 = !DIFile(filename: "../../../include/mayo.h", directory: "/home/siddhesh/Desktop/MAYO-LLVM/llvm-apps/mayo_pass/build")
!80 = !DICompositeType(tag: DW_TAG_array_type, baseType: !81, size: 32, elements: !22)
!81 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !51)
!82 = !DIGlobalVariableExpression(var: !83, expr: !DIExpression())
!83 = distinct !DIGlobalVariable(name: "pqmayo_MAYO_3_ref_uint32_t_blocker", scope: !84, file: !99, line: 126, type: !104, isLocal: false, isDefinition: true)
!84 = distinct !DICompileUnit(language: DW_LANG_C11, file: !49, producer: "Ubuntu clang version 20.1.2 (0ubuntu1~24.04.2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !85, globals: !96, splitDebugInlining: false, nameTableKind: None)
!85 = !{!53, !86, !87, !61, !62, !90, !91, !94}
!86 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !54, line: 56, baseType: !88)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !56, line: 103, baseType: !89)
!89 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 32)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !54, line: 20, baseType: !92)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !56, line: 41, baseType: !93)
!93 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !54, line: 44, baseType: !95)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !56, line: 77, baseType: !86)
!96 = !{!82, !97, !101}
!97 = !DIGlobalVariableExpression(var: !98, expr: !DIExpression())
!98 = distinct !DIGlobalVariable(name: "pqmayo_MAYO_3_ref_uint64_t_blocker", scope: !84, file: !99, line: 127, type: !100, isLocal: false, isDefinition: true)
!99 = !DIFile(filename: "../../../src/arithmetic.c", directory: "/home/siddhesh/Desktop/MAYO-LLVM/llvm-apps/mayo_pass/build")
!100 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !53)
!101 = !DIGlobalVariableExpression(var: !102, expr: !DIExpression())
!102 = distinct !DIGlobalVariable(name: "pqmayo_MAYO_3_ref_unsigned_char_blocker", scope: !84, file: !99, line: 128, type: !103, isLocal: false, isDefinition: true)
!103 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !51)
!104 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !62)
!105 = distinct !DICompileUnit(language: DW_LANG_C11, file: !106, producer: "Ubuntu clang version 20.1.2 (0ubuntu1~24.04.2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, globals: !107, splitDebugInlining: false, nameTableKind: None)
!106 = !DIFile(filename: "../<stdin>", directory: "/home/siddhesh/Desktop/MAYO-LLVM/llvm-apps/mayo_pass/build")
!107 = !{!0, !7, !12, !14, !19, !24, !29, !31, !36, !41}
!108 = !{!"Ubuntu clang version 20.1.2 (0ubuntu1~24.04.2)"}
!109 = !{i32 2, !"Debug Info Version", i32 3}
!110 = !{i32 1, !"wchar_size", i32 4}
!111 = !{i32 1, !"min_enum_size", i32 4}
!112 = !{i32 1, !"Code Model", i32 1}
!113 = distinct !DISubprogram(name: "main", scope: !2, file: !2, line: 138, type: !114, scopeLine: 138, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !105)
!114 = !DISubroutineType(types: !115)
!115 = !{!86}
!116 = !DILocalVariable(name: "p", arg: 1, scope: !117, file: !2, line: 25, type: !120)
!117 = distinct !DISubprogram(name: "example_mayo", scope: !2, file: !2, line: 25, type: !118, scopeLine: 25, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !105, retainedNodes: !71)
!118 = !DISubroutineType(types: !119)
!119 = !{!86, !120}
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 32)
!121 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !122)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "mayo_params_t", file: !79, line: 289, baseType: !123)
!123 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !79, line: 265, size: 736, elements: !124)
!124 = !{!125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !123, file: !79, line: 266, baseType: !86, size: 32)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !123, file: !79, line: 267, baseType: !86, size: 32, offset: 32)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "o", scope: !123, file: !79, line: 268, baseType: !86, size: 32, offset: 64)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "k", scope: !123, file: !79, line: 269, baseType: !86, size: 32, offset: 96)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !123, file: !79, line: 270, baseType: !86, size: 32, offset: 128)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "f_tail", scope: !123, file: !79, line: 271, baseType: !90, size: 32, offset: 160)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "m_bytes", scope: !123, file: !79, line: 272, baseType: !86, size: 32, offset: 192)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "O_bytes", scope: !123, file: !79, line: 273, baseType: !86, size: 32, offset: 224)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "v_bytes", scope: !123, file: !79, line: 274, baseType: !86, size: 32, offset: 256)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "r_bytes", scope: !123, file: !79, line: 275, baseType: !86, size: 32, offset: 288)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "R_bytes", scope: !123, file: !79, line: 276, baseType: !86, size: 32, offset: 320)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "P1_bytes", scope: !123, file: !79, line: 277, baseType: !86, size: 32, offset: 352)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "P2_bytes", scope: !123, file: !79, line: 278, baseType: !86, size: 32, offset: 384)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "P3_bytes", scope: !123, file: !79, line: 279, baseType: !86, size: 32, offset: 416)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "csk_bytes", scope: !123, file: !79, line: 280, baseType: !86, size: 32, offset: 448)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "cpk_bytes", scope: !123, file: !79, line: 281, baseType: !86, size: 32, offset: 480)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "sig_bytes", scope: !123, file: !79, line: 282, baseType: !86, size: 32, offset: 512)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "salt_bytes", scope: !123, file: !79, line: 283, baseType: !86, size: 32, offset: 544)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "sk_seed_bytes", scope: !123, file: !79, line: 284, baseType: !86, size: 32, offset: 576)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "digest_bytes", scope: !123, file: !79, line: 285, baseType: !86, size: 32, offset: 608)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "pk_seed_bytes", scope: !123, file: !79, line: 286, baseType: !86, size: 32, offset: 640)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "m_vec_limbs", scope: !123, file: !79, line: 287, baseType: !86, size: 32, offset: 672)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !123, file: !79, line: 288, baseType: !148, size: 32, offset: 704)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 32)
!149 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!150 = !DILocation(line: 0, scope: !117, inlinedAt: !151)
!151 = distinct !DILocation(line: 148, column: 12, scope: !113)
!152 = !DILocalVariable(name: "msglen", scope: !117, file: !2, line: 27, type: !58)
!153 = !DILocalVariable(name: "smlen", scope: !117, file: !2, line: 28, type: !58)
!154 = !DILocation(line: 30, column: 26, scope: !117, inlinedAt: !151)
!155 = !DILocalVariable(name: "pk", scope: !117, file: !2, line: 30, type: !61)
!156 = !DILocation(line: 31, column: 26, scope: !117, inlinedAt: !151)
!157 = !DILocalVariable(name: "sk", scope: !117, file: !2, line: 31, type: !61)
!158 = !DILocation(line: 33, column: 21, scope: !117, inlinedAt: !151)
!159 = !DILocalVariable(name: "epk", scope: !117, file: !2, line: 33, type: !52)
!160 = !DILocation(line: 34, column: 17, scope: !117, inlinedAt: !151)
!161 = !DILocalVariable(name: "esk", scope: !117, file: !2, line: 34, type: !162)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 32)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "sk_t", file: !79, line: 294, baseType: !164)
!164 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sk_t", file: !79, line: 291, size: 3129408, elements: !165)
!165 = !{!166, !170}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !164, file: !79, line: 292, baseType: !167, size: 3120768)
!167 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 3120768, elements: !168)
!168 = !{!169}
!169 = !DISubrange(count: 48762)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "O", scope: !164, file: !79, line: 293, baseType: !171, size: 8640, offset: 3120768)
!171 = !DICompositeType(tag: DW_TAG_array_type, baseType: !172, size: 8640, elements: !174)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !54, line: 24, baseType: !173)
!173 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !56, line: 43, baseType: !51)
!174 = !{!175}
!175 = !DISubrange(count: 1080)
!176 = !DILocation(line: 36, column: 26, scope: !117, inlinedAt: !151)
!177 = !DILocalVariable(name: "sig", scope: !117, file: !2, line: 36, type: !61)
!178 = !DILocalVariable(name: "msg", scope: !117, file: !2, line: 38, type: !179)
!179 = !DICompositeType(tag: DW_TAG_array_type, baseType: !51, size: 256, elements: !180)
!180 = !{!181}
!181 = !DISubrange(count: 32)
!182 = !DILocation(line: 38, column: 19, scope: !117, inlinedAt: !151)
!183 = !DILocalVariable(name: "msg2", scope: !117, file: !2, line: 39, type: !179)
!184 = !DILocation(line: 39, column: 19, scope: !117, inlinedAt: !151)
!185 = !DILocation(line: 41, column: 5, scope: !117, inlinedAt: !151)
!186 = !DILocation(line: 43, column: 5, scope: !117, inlinedAt: !151)
!187 = !DILocalVariable(name: "p", arg: 1, scope: !188, file: !68, line: 298, type: !191)
!188 = distinct !DISubprogram(name: "pqmayo_MAYO_3_ref_mayo_keypair", scope: !68, file: !68, line: 298, type: !189, scopeLine: 298, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !48, retainedNodes: !71)
!189 = !DISubroutineType(types: !190)
!190 = !{!86, !191, !61, !61}
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 32)
!192 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !193)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "mayo_params_t", file: !79, line: 289, baseType: !194)
!194 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !79, line: 265, size: 736, elements: !195)
!195 = !{!196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !194, file: !79, line: 266, baseType: !86, size: 32)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !194, file: !79, line: 267, baseType: !86, size: 32, offset: 32)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "o", scope: !194, file: !79, line: 268, baseType: !86, size: 32, offset: 64)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "k", scope: !194, file: !79, line: 269, baseType: !86, size: 32, offset: 96)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !194, file: !79, line: 270, baseType: !86, size: 32, offset: 128)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "f_tail", scope: !194, file: !79, line: 271, baseType: !90, size: 32, offset: 160)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "m_bytes", scope: !194, file: !79, line: 272, baseType: !86, size: 32, offset: 192)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "O_bytes", scope: !194, file: !79, line: 273, baseType: !86, size: 32, offset: 224)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "v_bytes", scope: !194, file: !79, line: 274, baseType: !86, size: 32, offset: 256)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "r_bytes", scope: !194, file: !79, line: 275, baseType: !86, size: 32, offset: 288)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "R_bytes", scope: !194, file: !79, line: 276, baseType: !86, size: 32, offset: 320)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "P1_bytes", scope: !194, file: !79, line: 277, baseType: !86, size: 32, offset: 352)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "P2_bytes", scope: !194, file: !79, line: 278, baseType: !86, size: 32, offset: 384)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "P3_bytes", scope: !194, file: !79, line: 279, baseType: !86, size: 32, offset: 416)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "csk_bytes", scope: !194, file: !79, line: 280, baseType: !86, size: 32, offset: 448)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "cpk_bytes", scope: !194, file: !79, line: 281, baseType: !86, size: 32, offset: 480)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "sig_bytes", scope: !194, file: !79, line: 282, baseType: !86, size: 32, offset: 512)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "salt_bytes", scope: !194, file: !79, line: 283, baseType: !86, size: 32, offset: 544)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "sk_seed_bytes", scope: !194, file: !79, line: 284, baseType: !86, size: 32, offset: 576)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "digest_bytes", scope: !194, file: !79, line: 285, baseType: !86, size: 32, offset: 608)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "pk_seed_bytes", scope: !194, file: !79, line: 286, baseType: !86, size: 32, offset: 640)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "m_vec_limbs", scope: !194, file: !79, line: 287, baseType: !86, size: 32, offset: 672)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !194, file: !79, line: 288, baseType: !148, size: 32, offset: 704)
!219 = !DILocation(line: 0, scope: !188, inlinedAt: !220)
!220 = distinct !DILocation(line: 44, column: 15, scope: !117, inlinedAt: !151)
!221 = !DILocalVariable(name: "pk", arg: 2, scope: !188, file: !68, line: 298, type: !61)
!222 = !DILocalVariable(name: "sk", arg: 3, scope: !188, file: !68, line: 298, type: !61)
!223 = !DILocalVariable(name: "ret", scope: !188, file: !68, line: 299, type: !86)
!224 = !DILocalVariable(name: "p", arg: 1, scope: !225, file: !68, line: 538, type: !191)
!225 = distinct !DISubprogram(name: "pqmayo_MAYO_3_ref_mayo_keypair_compact", scope: !68, file: !68, line: 538, type: !189, scopeLine: 539, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !48, retainedNodes: !71)
!226 = !DILocation(line: 0, scope: !225, inlinedAt: !227)
!227 = distinct !DILocation(line: 301, column: 11, scope: !188, inlinedAt: !220)
!228 = !DILocalVariable(name: "cpk", arg: 2, scope: !225, file: !68, line: 538, type: !61)
!229 = !DILocalVariable(name: "csk", arg: 3, scope: !225, file: !68, line: 539, type: !61)
!230 = !DILocalVariable(name: "ret", scope: !225, file: !68, line: 540, type: !86)
!231 = !DILocalVariable(name: "seed_sk", scope: !225, file: !68, line: 541, type: !61)
!232 = !DILocalVariable(name: "S", scope: !225, file: !68, line: 542, type: !233)
!233 = !DICompositeType(tag: DW_TAG_array_type, baseType: !51, size: 4448, elements: !234)
!234 = !{!235}
!235 = !DISubrange(count: 556)
!236 = !DILocation(line: 542, column: 19, scope: !225, inlinedAt: !227)
!237 = !DILocalVariable(name: "P", scope: !225, file: !68, line: 543, type: !167)
!238 = !DILocation(line: 543, column: 14, scope: !225, inlinedAt: !227)
!239 = !DILocalVariable(name: "P3", scope: !225, file: !68, line: 544, type: !240)
!240 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 44800, elements: !241)
!241 = !{!242}
!242 = !DISubrange(count: 700)
!243 = !DILocation(line: 544, column: 14, scope: !225, inlinedAt: !227)
!244 = !DILocalVariable(name: "O", scope: !225, file: !68, line: 547, type: !245)
!245 = !DICompositeType(tag: DW_TAG_array_type, baseType: !51, size: 8640, elements: !174)
!246 = !DILocation(line: 547, column: 19, scope: !225, inlinedAt: !227)
!247 = !DILocalVariable(name: "m_vec_limbs", scope: !225, file: !68, line: 549, type: !248)
!248 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !86)
!249 = !DILocalVariable(name: "param_m", scope: !225, file: !68, line: 550, type: !248)
!250 = !DILocalVariable(name: "param_v", scope: !225, file: !68, line: 551, type: !248)
!251 = !DILocalVariable(name: "param_o", scope: !225, file: !68, line: 552, type: !248)
!252 = !DILocalVariable(name: "param_O_bytes", scope: !225, file: !68, line: 553, type: !248)
!253 = !DILocalVariable(name: "param_P1_limbs", scope: !225, file: !68, line: 554, type: !248)
!254 = !DILocalVariable(name: "param_P3_limbs", scope: !225, file: !68, line: 555, type: !248)
!255 = !DILocalVariable(name: "param_pk_seed_bytes", scope: !225, file: !68, line: 556, type: !248)
!256 = !DILocalVariable(name: "param_sk_seed_bytes", scope: !225, file: !68, line: 557, type: !248)
!257 = !DILocalVariable(name: "P1", scope: !225, file: !68, line: 559, type: !52)
!258 = !DILocation(line: 560, column: 22, scope: !225, inlinedAt: !227)
!259 = !DILocalVariable(name: "P2", scope: !225, file: !68, line: 560, type: !52)
!260 = !DILocation(line: 566, column: 9, scope: !261, inlinedAt: !227)
!261 = distinct !DILexicalBlock(scope: !225, file: !68, line: 566, column: 9)
!262 = !DILocation(line: 566, column: 51, scope: !261, inlinedAt: !227)
!263 = !DILocation(line: 573, column: 5, scope: !225, inlinedAt: !227)
!264 = !DILocalVariable(name: "seed_pk", scope: !225, file: !68, line: 546, type: !61)
!265 = !DILocation(line: 579, column: 14, scope: !225, inlinedAt: !227)
!266 = !DILocalVariable(name: "m", arg: 1, scope: !267, file: !68, line: 20, type: !90)
!267 = distinct !DISubprogram(name: "decode", scope: !68, file: !68, line: 20, type: !268, scopeLine: 20, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !48, retainedNodes: !71)
!268 = !DISubroutineType(types: !269)
!269 = !{null, !90, !61, !86}
!270 = !DILocation(line: 0, scope: !267, inlinedAt: !271)
!271 = distinct !DILocation(line: 579, column: 5, scope: !225, inlinedAt: !227)
!272 = !DILocalVariable(name: "mdec", arg: 2, scope: !267, file: !68, line: 20, type: !61)
!273 = !DILocalVariable(name: "mdeclen", arg: 3, scope: !267, file: !68, line: 20, type: !86)
!274 = !DILocalVariable(name: "i", scope: !267, file: !68, line: 21, type: !86)
!275 = !DILocation(line: 22, column: 10, scope: !276, inlinedAt: !271)
!276 = distinct !DILexicalBlock(scope: !267, file: !68, line: 22, column: 5)
!277 = !DILocation(line: 22, scope: !276, inlinedAt: !271)
!278 = !DILocation(line: 23, column: 19, scope: !279, inlinedAt: !271)
!279 = distinct !DILexicalBlock(scope: !280, file: !68, line: 22, column: 39)
!280 = distinct !DILexicalBlock(scope: !276, file: !68, line: 22, column: 5)
!281 = !DILocation(line: 23, column: 24, scope: !279, inlinedAt: !271)
!282 = !DILocation(line: 23, column: 14, scope: !279, inlinedAt: !271)
!283 = !DILocation(line: 23, column: 17, scope: !279, inlinedAt: !271)
!284 = !DILocation(line: 24, column: 24, scope: !279, inlinedAt: !271)
!285 = !DILocation(line: 24, column: 17, scope: !279, inlinedAt: !271)
!286 = !DILocation(line: 22, column: 34, scope: !280, inlinedAt: !271)
!287 = !DILocation(line: 24, column: 14, scope: !279, inlinedAt: !271)
!288 = !DILocation(line: 22, column: 19, scope: !280, inlinedAt: !271)
!289 = !DILocation(line: 22, column: 5, scope: !276, inlinedAt: !271)
!290 = !DILocation(line: 22, column: 5, scope: !280, inlinedAt: !271)
!291 = distinct !{!291, !289, !292, !293}
!292 = !DILocation(line: 25, column: 5, scope: !276, inlinedAt: !271)
!293 = !{!"llvm.loop.mustprogress"}
!294 = !DILocalVariable(name: "p", arg: 1, scope: !295, file: !68, line: 280, type: !191)
!295 = distinct !DISubprogram(name: "expand_P1_P2", scope: !68, file: !68, line: 280, type: !296, scopeLine: 280, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !48, retainedNodes: !71)
!296 = !DISubroutineType(types: !297)
!297 = !{null, !191, !52, !90}
!298 = !DILocation(line: 0, scope: !295, inlinedAt: !299)
!299 = distinct !DILocation(line: 585, column: 5, scope: !225, inlinedAt: !227)
!300 = !DILocalVariable(name: "P", arg: 2, scope: !295, file: !68, line: 280, type: !52)
!301 = !DILocalVariable(name: "seed_pk", arg: 3, scope: !295, file: !68, line: 280, type: !90)
!302 = !DILocation(line: 284, column: 5, scope: !295, inlinedAt: !299)
!303 = !DILocalVariable(name: "in", arg: 1, scope: !304, file: !68, line: 262, type: !90)
!304 = distinct !DISubprogram(name: "unpack_m_vecs", scope: !68, file: !68, line: 262, type: !305, scopeLine: 262, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !48, retainedNodes: !71)
!305 = !DISubroutineType(types: !306)
!306 = !{null, !90, !52, !86, !86}
!307 = !DILocation(line: 0, scope: !304, inlinedAt: !308)
!308 = distinct !DILocation(line: 285, column: 5, scope: !295, inlinedAt: !299)
!309 = !DILocalVariable(name: "out", arg: 2, scope: !304, file: !68, line: 262, type: !52)
!310 = !DILocalVariable(name: "vecs", arg: 3, scope: !304, file: !68, line: 262, type: !86)
!311 = !DILocalVariable(name: "m", arg: 4, scope: !304, file: !68, line: 262, type: !86)
!312 = !DILocalVariable(name: "m_vec_limbs", scope: !304, file: !68, line: 263, type: !248)
!313 = !DILocalVariable(name: "_out", scope: !304, file: !68, line: 264, type: !61)
!314 = !DILocalVariable(name: "tmp", scope: !304, file: !68, line: 265, type: !315)
!315 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 448, elements: !10)
!316 = !DILocation(line: 265, column: 14, scope: !304, inlinedAt: !308)
!317 = !DILocalVariable(name: "i", scope: !318, file: !68, line: 266, type: !86)
!318 = distinct !DILexicalBlock(scope: !304, file: !68, line: 266, column: 5)
!319 = !DILocation(line: 0, scope: !318, inlinedAt: !308)
!320 = !DILocation(line: 266, column: 10, scope: !318, inlinedAt: !308)
!321 = !DILocation(line: 266, scope: !318, inlinedAt: !308)
!322 = !DILocation(line: 268, column: 29, scope: !323, inlinedAt: !308)
!323 = distinct !DILexicalBlock(scope: !324, file: !68, line: 267, column: 5)
!324 = distinct !DILexicalBlock(scope: !318, file: !68, line: 266, column: 5)
!325 = !DILocation(line: 268, column: 24, scope: !323, inlinedAt: !308)
!326 = !DILocation(line: 268, column: 9, scope: !323, inlinedAt: !308)
!327 = !DILocation(line: 269, column: 36, scope: !323, inlinedAt: !308)
!328 = !DILocation(line: 269, column: 21, scope: !323, inlinedAt: !308)
!329 = !DILocation(line: 269, column: 9, scope: !323, inlinedAt: !308)
!330 = !DILocation(line: 266, column: 35, scope: !324, inlinedAt: !308)
!331 = !DILocation(line: 266, column: 28, scope: !324, inlinedAt: !308)
!332 = !DILocation(line: 266, column: 5, scope: !318, inlinedAt: !308)
!333 = !DILocation(line: 266, column: 5, scope: !324, inlinedAt: !308)
!334 = distinct !{!334, !332, !335, !293}
!335 = !DILocation(line: 270, column: 5, scope: !318, inlinedAt: !308)
!336 = !DILocation(line: 271, column: 1, scope: !304, inlinedAt: !308)
!337 = !DILocalVariable(name: "p", arg: 1, scope: !338, file: !339, line: 260, type: !191)
!338 = distinct !DISubprogram(name: "compute_P3", scope: !339, file: !339, line: 260, type: !340, scopeLine: 260, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !48, retainedNodes: !71)
!339 = !DIFile(filename: "../../../src/generic/generic_arithmetic.h", directory: "/home/siddhesh/Desktop/MAYO-LLVM/llvm-apps/mayo_pass/build")
!340 = !DISubroutineType(types: !341)
!341 = !{null, !191, !342, !52, !90, !52}
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 32)
!343 = !DILocation(line: 0, scope: !338, inlinedAt: !344)
!344 = distinct !DILocation(line: 588, column: 5, scope: !225, inlinedAt: !227)
!345 = !DILocalVariable(name: "P1", arg: 2, scope: !338, file: !339, line: 260, type: !342)
!346 = !DILocalVariable(name: "P2", arg: 3, scope: !338, file: !339, line: 260, type: !52)
!347 = !DILocalVariable(name: "O", arg: 4, scope: !338, file: !339, line: 260, type: !90)
!348 = !DILocalVariable(name: "P3", arg: 5, scope: !338, file: !339, line: 260, type: !52)
!349 = !DILocalVariable(name: "m_vec_limbs", scope: !338, file: !339, line: 262, type: !248)
!350 = !DILocalVariable(name: "param_v", scope: !338, file: !339, line: 263, type: !248)
!351 = !DILocalVariable(name: "param_o", scope: !338, file: !339, line: 264, type: !248)
!352 = !DILocalVariable(name: "p", arg: 1, scope: !353, file: !339, line: 74, type: !191)
!353 = distinct !DISubprogram(name: "P1_times_O", scope: !339, file: !339, line: 74, type: !354, scopeLine: 74, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !48, retainedNodes: !71)
!354 = !DISubroutineType(types: !355)
!355 = !{null, !191, !342, !90, !52}
!356 = !DILocation(line: 0, scope: !353, inlinedAt: !357)
!357 = distinct !DILocation(line: 267, column: 5, scope: !338, inlinedAt: !344)
!358 = !DILocalVariable(name: "P1", arg: 2, scope: !353, file: !339, line: 74, type: !342)
!359 = !DILocalVariable(name: "O", arg: 3, scope: !353, file: !339, line: 74, type: !90)
!360 = !DILocalVariable(name: "acc", arg: 4, scope: !353, file: !339, line: 74, type: !52)
!361 = !DILocalVariable(name: "m_vec_limbs", arg: 1, scope: !362, file: !339, line: 16, type: !248)
!362 = distinct !DISubprogram(name: "mul_add_m_upper_triangular_mat_x_mat", scope: !339, file: !339, line: 16, type: !363, scopeLine: 17, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !48, retainedNodes: !71)
!363 = !DISubroutineType(types: !364)
!364 = !{null, !248, !342, !90, !52, !248, !248, !248, !248}
!365 = !DILocation(line: 0, scope: !362, inlinedAt: !366)
!366 = distinct !DILocation(line: 78, column: 5, scope: !353, inlinedAt: !357)
!367 = !DILocalVariable(name: "bs_mat", arg: 2, scope: !362, file: !339, line: 16, type: !342)
!368 = !DILocalVariable(name: "mat", arg: 3, scope: !362, file: !339, line: 16, type: !90)
!369 = !DILocalVariable(name: "acc", arg: 4, scope: !362, file: !339, line: 16, type: !52)
!370 = !DILocalVariable(name: "bs_mat_rows", arg: 5, scope: !362, file: !339, line: 17, type: !248)
!371 = !DILocalVariable(name: "bs_mat_cols", arg: 6, scope: !362, file: !339, line: 17, type: !248)
!372 = !DILocalVariable(name: "mat_cols", arg: 7, scope: !362, file: !339, line: 17, type: !248)
!373 = !DILocalVariable(name: "triangular", arg: 8, scope: !362, file: !339, line: 17, type: !248)
!374 = !DILocalVariable(name: "bs_mat_entries_used", scope: !362, file: !339, line: 19, type: !86)
!375 = !DILocalVariable(name: "r", scope: !376, file: !339, line: 20, type: !86)
!376 = distinct !DILexicalBlock(scope: !362, file: !339, line: 20, column: 5)
!377 = !DILocation(line: 0, scope: !376, inlinedAt: !366)
!378 = !DILocation(line: 20, column: 10, scope: !376, inlinedAt: !366)
!379 = !DILocation(line: 19, column: 9, scope: !362, inlinedAt: !366)
!380 = !DILocation(line: 20, scope: !376, inlinedAt: !366)
!381 = !DILocation(line: 20, column: 23, scope: !382, inlinedAt: !366)
!382 = distinct !DILexicalBlock(scope: !376, file: !339, line: 20, column: 5)
!383 = !DILocation(line: 20, column: 5, scope: !376, inlinedAt: !366)
!384 = !DILocation(line: 21, column: 9, scope: !385, inlinedAt: !366)
!385 = distinct !DILexicalBlock(scope: !386, file: !339, line: 21, column: 9)
!386 = distinct !DILexicalBlock(scope: !382, file: !339, line: 20, column: 43)
!387 = !DILocation(line: 21, scope: !385, inlinedAt: !366)
!388 = !DILocalVariable(name: "c", scope: !385, file: !339, line: 21, type: !86)
!389 = !DILocation(line: 0, scope: !385, inlinedAt: !366)
!390 = !DILocation(line: 21, column: 40, scope: !391, inlinedAt: !366)
!391 = distinct !DILexicalBlock(scope: !385, file: !339, line: 21, column: 9)
!392 = !DILocation(line: 22, scope: !393, inlinedAt: !366)
!393 = distinct !DILexicalBlock(scope: !394, file: !339, line: 22, column: 13)
!394 = distinct !DILexicalBlock(scope: !391, file: !339, line: 21, column: 60)
!395 = !DILocalVariable(name: "k", scope: !393, file: !339, line: 22, type: !86)
!396 = !DILocation(line: 0, scope: !393, inlinedAt: !366)
!397 = !DILocation(line: 22, column: 31, scope: !398, inlinedAt: !366)
!398 = distinct !DILexicalBlock(scope: !393, file: !339, line: 22, column: 13)
!399 = !DILocation(line: 22, column: 13, scope: !393, inlinedAt: !366)
!400 = !DILocation(line: 23, column: 51, scope: !401, inlinedAt: !366)
!401 = distinct !DILexicalBlock(scope: !398, file: !339, line: 22, column: 51)
!402 = !DILocation(line: 23, column: 94, scope: !401, inlinedAt: !366)
!403 = !DILocation(line: 23, column: 88, scope: !401, inlinedAt: !366)
!404 = !DILocation(line: 23, column: 134, scope: !401, inlinedAt: !366)
!405 = !DILocation(line: 23, column: 145, scope: !401, inlinedAt: !366)
!406 = !DILocation(line: 23, column: 115, scope: !401, inlinedAt: !366)
!407 = !DILocalVariable(name: "m_vec_limbs", arg: 1, scope: !408, file: !409, line: 31, type: !86)
!408 = distinct !DISubprogram(name: "m_vec_mul_add", scope: !409, file: !409, line: 31, type: !410, scopeLine: 31, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !48, retainedNodes: !71)
!409 = !DIFile(filename: "../../../src/generic/arithmetic_fixed.h", directory: "/home/siddhesh/Desktop/MAYO-LLVM/llvm-apps/mayo_pass/build")
!410 = !DISubroutineType(types: !411)
!411 = !{null, !86, !342, !51, !52}
!412 = !DILocation(line: 0, scope: !408, inlinedAt: !413)
!413 = distinct !DILocation(line: 23, column: 17, scope: !401, inlinedAt: !366)
!414 = !DILocalVariable(name: "in", arg: 2, scope: !408, file: !409, line: 31, type: !342)
!415 = !DILocalVariable(name: "a", arg: 3, scope: !408, file: !409, line: 31, type: !51)
!416 = !DILocalVariable(name: "acc", arg: 4, scope: !408, file: !409, line: 31, type: !52)
!417 = !DILocalVariable(name: "b", arg: 1, scope: !418, file: !419, line: 128, type: !172)
!418 = distinct !DISubprogram(name: "mul_table", scope: !419, file: !419, line: 128, type: !420, scopeLine: 128, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !48, retainedNodes: !71)
!419 = !DIFile(filename: "../../../src/simple_arithmetic.h", directory: "/home/siddhesh/Desktop/MAYO-LLVM/llvm-apps/mayo_pass/build")
!420 = !DISubroutineType(types: !421)
!421 = !{!62, !172}
!422 = !DILocation(line: 0, scope: !418, inlinedAt: !423)
!423 = distinct !DILocation(line: 33, column: 20, scope: !408, inlinedAt: !413)
!424 = !DILocation(line: 129, column: 19, scope: !418, inlinedAt: !423)
!425 = !DILocation(line: 129, column: 33, scope: !418, inlinedAt: !423)
!426 = !DILocalVariable(name: "x", scope: !418, file: !419, line: 129, type: !62)
!427 = !DILocalVariable(name: "high_nibble_mask", scope: !418, file: !419, line: 131, type: !62)
!428 = !DILocation(line: 133, column: 28, scope: !418, inlinedAt: !423)
!429 = !DILocalVariable(name: "high_half", scope: !418, file: !419, line: 133, type: !62)
!430 = !DILocation(line: 134, column: 28, scope: !418, inlinedAt: !423)
!431 = !DILocation(line: 134, column: 47, scope: !418, inlinedAt: !423)
!432 = !DILocation(line: 134, column: 34, scope: !418, inlinedAt: !423)
!433 = !DILocalVariable(name: "tab", scope: !408, file: !409, line: 33, type: !62)
!434 = !DILocalVariable(name: "lsb_ask", scope: !408, file: !409, line: 35, type: !53)
!435 = !DILocalVariable(name: "i", scope: !436, file: !409, line: 37, type: !86)
!436 = distinct !DILexicalBlock(scope: !408, file: !409, line: 37, column: 5)
!437 = !DILocation(line: 0, scope: !436, inlinedAt: !413)
!438 = !DILocation(line: 38, column: 21, scope: !439, inlinedAt: !413)
!439 = distinct !DILexicalBlock(scope: !440, file: !409, line: 37, column: 43)
!440 = distinct !DILexicalBlock(scope: !436, file: !409, line: 37, column: 5)
!441 = !DILocation(line: 38, column: 33, scope: !439, inlinedAt: !413)
!442 = !DILocation(line: 38, column: 51, scope: !439, inlinedAt: !413)
!443 = !DILocation(line: 38, column: 46, scope: !439, inlinedAt: !413)
!444 = !DILocation(line: 38, column: 44, scope: !439, inlinedAt: !413)
!445 = !DILocation(line: 39, column: 27, scope: !439, inlinedAt: !413)
!446 = !DILocation(line: 39, column: 33, scope: !439, inlinedAt: !413)
!447 = !DILocation(line: 39, column: 52, scope: !439, inlinedAt: !413)
!448 = !DILocation(line: 39, column: 59, scope: !439, inlinedAt: !413)
!449 = !DILocation(line: 39, column: 46, scope: !439, inlinedAt: !413)
!450 = !DILocation(line: 39, column: 44, scope: !439, inlinedAt: !413)
!451 = !DILocation(line: 39, column: 17, scope: !439, inlinedAt: !413)
!452 = !DILocation(line: 40, column: 21, scope: !439, inlinedAt: !413)
!453 = !DILocation(line: 40, column: 27, scope: !439, inlinedAt: !413)
!454 = !DILocation(line: 40, column: 33, scope: !439, inlinedAt: !413)
!455 = !DILocation(line: 40, column: 52, scope: !439, inlinedAt: !413)
!456 = !DILocation(line: 40, column: 59, scope: !439, inlinedAt: !413)
!457 = !DILocation(line: 40, column: 46, scope: !439, inlinedAt: !413)
!458 = !DILocation(line: 40, column: 44, scope: !439, inlinedAt: !413)
!459 = !DILocation(line: 40, column: 17, scope: !439, inlinedAt: !413)
!460 = !DILocation(line: 41, column: 21, scope: !439, inlinedAt: !413)
!461 = !DILocation(line: 41, column: 27, scope: !439, inlinedAt: !413)
!462 = !DILocation(line: 41, column: 33, scope: !439, inlinedAt: !413)
!463 = !DILocation(line: 41, column: 52, scope: !439, inlinedAt: !413)
!464 = !DILocation(line: 41, column: 59, scope: !439, inlinedAt: !413)
!465 = !DILocation(line: 41, column: 46, scope: !439, inlinedAt: !413)
!466 = !DILocation(line: 41, column: 44, scope: !439, inlinedAt: !413)
!467 = !DILocation(line: 41, column: 17, scope: !439, inlinedAt: !413)
!468 = !DILocation(line: 38, column: 16, scope: !439, inlinedAt: !413)
!469 = !DILocation(line: 38, column: 9, scope: !439, inlinedAt: !413)
!470 = !DILocation(line: 22, column: 45, scope: !398, inlinedAt: !366)
!471 = !DILocation(line: 22, column: 13, scope: !398, inlinedAt: !366)
!472 = distinct !{!472, !399, !473, !293}
!473 = !DILocation(line: 24, column: 13, scope: !393, inlinedAt: !366)
!474 = !DILocation(line: 25, column: 33, scope: !394, inlinedAt: !366)
!475 = !DILocation(line: 21, column: 56, scope: !391, inlinedAt: !366)
!476 = !DILocation(line: 21, column: 9, scope: !391, inlinedAt: !366)
!477 = distinct !{!477, !384, !478, !293}
!478 = !DILocation(line: 26, column: 9, scope: !385, inlinedAt: !366)
!479 = !DILocation(line: 20, column: 39, scope: !382, inlinedAt: !366)
!480 = !DILocation(line: 20, column: 5, scope: !382, inlinedAt: !366)
!481 = distinct !{!481, !383, !482, !293}
!482 = !DILocation(line: 27, column: 5, scope: !376, inlinedAt: !366)
!483 = !DILocation(line: 50, scope: !484, inlinedAt: !488)
!484 = distinct !DILexicalBlock(scope: !485, file: !339, line: 50, column: 5)
!485 = distinct !DISubprogram(name: "mul_add_mat_trans_x_m_mat", scope: !339, file: !339, line: 47, type: !486, scopeLine: 48, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !48, retainedNodes: !71)
!486 = !DISubroutineType(types: !487)
!487 = !{null, !248, !90, !342, !52, !248, !248, !248}
!488 = distinct !DILocation(line: 270, column: 5, scope: !338, inlinedAt: !344)
!489 = !DILocalVariable(name: "r", scope: !484, file: !339, line: 50, type: !86)
!490 = !DILocation(line: 0, scope: !484, inlinedAt: !488)
!491 = !DILocation(line: 50, column: 23, scope: !492, inlinedAt: !488)
!492 = distinct !DILexicalBlock(scope: !484, file: !339, line: 50, column: 5)
!493 = !DILocation(line: 50, column: 5, scope: !484, inlinedAt: !488)
!494 = !DILocation(line: 51, scope: !495, inlinedAt: !488)
!495 = distinct !DILexicalBlock(scope: !496, file: !339, line: 51, column: 9)
!496 = distinct !DILexicalBlock(scope: !492, file: !339, line: 50, column: 40)
!497 = !DILocalVariable(name: "c", scope: !495, file: !339, line: 51, type: !86)
!498 = !DILocation(line: 0, scope: !495, inlinedAt: !488)
!499 = !DILocation(line: 51, column: 27, scope: !500, inlinedAt: !488)
!500 = distinct !DILexicalBlock(scope: !495, file: !339, line: 51, column: 9)
!501 = !DILocation(line: 51, column: 9, scope: !495, inlinedAt: !488)
!502 = !DILocation(line: 52, scope: !503, inlinedAt: !488)
!503 = distinct !DILexicalBlock(scope: !504, file: !339, line: 52, column: 13)
!504 = distinct !DILexicalBlock(scope: !500, file: !339, line: 51, column: 44)
!505 = !DILocalVariable(name: "k", scope: !503, file: !339, line: 52, type: !86)
!506 = !DILocation(line: 0, scope: !503, inlinedAt: !488)
!507 = !DILocation(line: 52, column: 31, scope: !508, inlinedAt: !488)
!508 = distinct !DILexicalBlock(scope: !503, file: !339, line: 52, column: 13)
!509 = !DILocation(line: 52, column: 13, scope: !503, inlinedAt: !488)
!510 = !DILocation(line: 53, column: 70, scope: !511, inlinedAt: !488)
!511 = distinct !DILexicalBlock(scope: !508, file: !339, line: 52, column: 54)
!512 = !DILocation(line: 53, column: 84, scope: !511, inlinedAt: !488)
!513 = !DILocation(line: 53, column: 51, scope: !511, inlinedAt: !488)
!514 = !DILocation(line: 53, column: 96, scope: !511, inlinedAt: !488)
!515 = !DILocation(line: 53, column: 90, scope: !511, inlinedAt: !488)
!516 = !DILocation(line: 53, column: 136, scope: !511, inlinedAt: !488)
!517 = !DILocation(line: 53, column: 150, scope: !511, inlinedAt: !488)
!518 = !DILocation(line: 53, column: 117, scope: !511, inlinedAt: !488)
!519 = !DILocation(line: 0, scope: !408, inlinedAt: !520)
!520 = distinct !DILocation(line: 53, column: 17, scope: !511, inlinedAt: !488)
!521 = !DILocation(line: 0, scope: !418, inlinedAt: !522)
!522 = distinct !DILocation(line: 33, column: 20, scope: !408, inlinedAt: !520)
!523 = !DILocation(line: 129, column: 19, scope: !418, inlinedAt: !522)
!524 = !DILocation(line: 129, column: 33, scope: !418, inlinedAt: !522)
!525 = !DILocation(line: 133, column: 28, scope: !418, inlinedAt: !522)
!526 = !DILocation(line: 134, column: 28, scope: !418, inlinedAt: !522)
!527 = !DILocation(line: 134, column: 47, scope: !418, inlinedAt: !522)
!528 = !DILocation(line: 134, column: 34, scope: !418, inlinedAt: !522)
!529 = !DILocation(line: 0, scope: !436, inlinedAt: !520)
!530 = !DILocation(line: 38, column: 21, scope: !439, inlinedAt: !520)
!531 = !DILocation(line: 38, column: 33, scope: !439, inlinedAt: !520)
!532 = !DILocation(line: 38, column: 51, scope: !439, inlinedAt: !520)
!533 = !DILocation(line: 38, column: 46, scope: !439, inlinedAt: !520)
!534 = !DILocation(line: 38, column: 44, scope: !439, inlinedAt: !520)
!535 = !DILocation(line: 39, column: 27, scope: !439, inlinedAt: !520)
!536 = !DILocation(line: 39, column: 33, scope: !439, inlinedAt: !520)
!537 = !DILocation(line: 39, column: 52, scope: !439, inlinedAt: !520)
!538 = !DILocation(line: 39, column: 59, scope: !439, inlinedAt: !520)
!539 = !DILocation(line: 39, column: 46, scope: !439, inlinedAt: !520)
!540 = !DILocation(line: 39, column: 44, scope: !439, inlinedAt: !520)
!541 = !DILocation(line: 39, column: 17, scope: !439, inlinedAt: !520)
!542 = !DILocation(line: 40, column: 21, scope: !439, inlinedAt: !520)
!543 = !DILocation(line: 40, column: 27, scope: !439, inlinedAt: !520)
!544 = !DILocation(line: 40, column: 33, scope: !439, inlinedAt: !520)
!545 = !DILocation(line: 40, column: 52, scope: !439, inlinedAt: !520)
!546 = !DILocation(line: 40, column: 59, scope: !439, inlinedAt: !520)
!547 = !DILocation(line: 40, column: 46, scope: !439, inlinedAt: !520)
!548 = !DILocation(line: 40, column: 44, scope: !439, inlinedAt: !520)
!549 = !DILocation(line: 40, column: 17, scope: !439, inlinedAt: !520)
!550 = !DILocation(line: 41, column: 21, scope: !439, inlinedAt: !520)
!551 = !DILocation(line: 41, column: 27, scope: !439, inlinedAt: !520)
!552 = !DILocation(line: 41, column: 33, scope: !439, inlinedAt: !520)
!553 = !DILocation(line: 41, column: 52, scope: !439, inlinedAt: !520)
!554 = !DILocation(line: 41, column: 59, scope: !439, inlinedAt: !520)
!555 = !DILocation(line: 41, column: 46, scope: !439, inlinedAt: !520)
!556 = !DILocation(line: 41, column: 44, scope: !439, inlinedAt: !520)
!557 = !DILocation(line: 41, column: 17, scope: !439, inlinedAt: !520)
!558 = !DILocation(line: 38, column: 16, scope: !439, inlinedAt: !520)
!559 = !DILocation(line: 38, column: 9, scope: !439, inlinedAt: !520)
!560 = !DILocation(line: 52, column: 48, scope: !508, inlinedAt: !488)
!561 = !DILocation(line: 52, column: 13, scope: !508, inlinedAt: !488)
!562 = distinct !{!562, !509, !563, !293}
!563 = !DILocation(line: 54, column: 13, scope: !503, inlinedAt: !488)
!564 = !DILocation(line: 51, column: 40, scope: !500, inlinedAt: !488)
!565 = !DILocation(line: 51, column: 9, scope: !500, inlinedAt: !488)
!566 = distinct !{!566, !501, !567, !293}
!567 = !DILocation(line: 55, column: 9, scope: !495, inlinedAt: !488)
!568 = !DILocation(line: 50, column: 36, scope: !492, inlinedAt: !488)
!569 = !DILocation(line: 50, column: 5, scope: !492, inlinedAt: !488)
!570 = distinct !{!570, !493, !571, !293}
!571 = !DILocation(line: 56, column: 5, scope: !484, inlinedAt: !488)
!572 = !DILocation(line: 591, column: 5, scope: !225, inlinedAt: !227)
!573 = !DILocalVariable(name: "P3_upper", scope: !225, file: !68, line: 593, type: !574)
!574 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 24640, elements: !575)
!575 = !{!576}
!576 = !DISubrange(count: 385)
!577 = !DILocation(line: 593, column: 14, scope: !225, inlinedAt: !227)
!578 = !DILocalVariable(name: "p", arg: 1, scope: !579, file: !99, line: 14, type: !582)
!579 = distinct !DISubprogram(name: "pqmayo_MAYO_3_ref_m_upper", scope: !99, file: !99, line: 14, type: !580, scopeLine: 14, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !84, retainedNodes: !71)
!580 = !DISubroutineType(types: !581)
!581 = !{null, !582, !342, !52, !86}
!582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !583, size: 32)
!583 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !584)
!584 = !DIDerivedType(tag: DW_TAG_typedef, name: "mayo_params_t", file: !79, line: 289, baseType: !585)
!585 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !79, line: 265, size: 736, elements: !586)
!586 = !{!587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609}
!587 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !585, file: !79, line: 266, baseType: !86, size: 32)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !585, file: !79, line: 267, baseType: !86, size: 32, offset: 32)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "o", scope: !585, file: !79, line: 268, baseType: !86, size: 32, offset: 64)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "k", scope: !585, file: !79, line: 269, baseType: !86, size: 32, offset: 96)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !585, file: !79, line: 270, baseType: !86, size: 32, offset: 128)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "f_tail", scope: !585, file: !79, line: 271, baseType: !90, size: 32, offset: 160)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "m_bytes", scope: !585, file: !79, line: 272, baseType: !86, size: 32, offset: 192)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "O_bytes", scope: !585, file: !79, line: 273, baseType: !86, size: 32, offset: 224)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "v_bytes", scope: !585, file: !79, line: 274, baseType: !86, size: 32, offset: 256)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "r_bytes", scope: !585, file: !79, line: 275, baseType: !86, size: 32, offset: 288)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "R_bytes", scope: !585, file: !79, line: 276, baseType: !86, size: 32, offset: 320)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "P1_bytes", scope: !585, file: !79, line: 277, baseType: !86, size: 32, offset: 352)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "P2_bytes", scope: !585, file: !79, line: 278, baseType: !86, size: 32, offset: 384)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "P3_bytes", scope: !585, file: !79, line: 279, baseType: !86, size: 32, offset: 416)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "csk_bytes", scope: !585, file: !79, line: 280, baseType: !86, size: 32, offset: 448)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "cpk_bytes", scope: !585, file: !79, line: 281, baseType: !86, size: 32, offset: 480)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "sig_bytes", scope: !585, file: !79, line: 282, baseType: !86, size: 32, offset: 512)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "salt_bytes", scope: !585, file: !79, line: 283, baseType: !86, size: 32, offset: 544)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "sk_seed_bytes", scope: !585, file: !79, line: 284, baseType: !86, size: 32, offset: 576)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "digest_bytes", scope: !585, file: !79, line: 285, baseType: !86, size: 32, offset: 608)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "pk_seed_bytes", scope: !585, file: !79, line: 286, baseType: !86, size: 32, offset: 640)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "m_vec_limbs", scope: !585, file: !79, line: 287, baseType: !86, size: 32, offset: 672)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !585, file: !79, line: 288, baseType: !148, size: 32, offset: 704)
!610 = !DILocation(line: 0, scope: !579, inlinedAt: !611)
!611 = distinct !DILocation(line: 596, column: 5, scope: !225, inlinedAt: !227)
!612 = !DILocalVariable(name: "in", arg: 2, scope: !579, file: !99, line: 14, type: !342)
!613 = !DILocalVariable(name: "out", arg: 3, scope: !579, file: !99, line: 14, type: !52)
!614 = !DILocalVariable(name: "size", arg: 4, scope: !579, file: !99, line: 14, type: !86)
!615 = !DILocalVariable(name: "m_vec_limbs", scope: !579, file: !99, line: 19, type: !248)
!616 = !DILocalVariable(name: "m_vecs_stored", scope: !579, file: !99, line: 20, type: !86)
!617 = !DILocalVariable(name: "r", scope: !618, file: !99, line: 21, type: !86)
!618 = distinct !DILexicalBlock(scope: !579, file: !99, line: 21, column: 5)
!619 = !DILocation(line: 0, scope: !618, inlinedAt: !611)
!620 = !DILocation(line: 21, column: 10, scope: !618, inlinedAt: !611)
!621 = !DILocation(line: 21, scope: !618, inlinedAt: !611)
!622 = !DILocation(line: 20, column: 9, scope: !579, inlinedAt: !611)
!623 = !DILocation(line: 21, column: 23, scope: !624, inlinedAt: !611)
!624 = distinct !DILexicalBlock(scope: !618, file: !99, line: 21, column: 5)
!625 = !DILocation(line: 21, column: 5, scope: !618, inlinedAt: !611)
!626 = !DILocation(line: 22, scope: !627, inlinedAt: !611)
!627 = distinct !DILexicalBlock(scope: !628, file: !99, line: 22, column: 9)
!628 = distinct !DILexicalBlock(scope: !624, file: !99, line: 21, column: 36)
!629 = !DILocalVariable(name: "c", scope: !627, file: !99, line: 22, type: !86)
!630 = !DILocation(line: 0, scope: !627, inlinedAt: !611)
!631 = !DILocation(line: 22, column: 27, scope: !632, inlinedAt: !611)
!632 = distinct !DILexicalBlock(scope: !627, file: !99, line: 22, column: 9)
!633 = !DILocation(line: 22, column: 9, scope: !627, inlinedAt: !611)
!634 = !DILocation(line: 23, column: 59, scope: !635, inlinedAt: !611)
!635 = distinct !DILexicalBlock(scope: !632, file: !99, line: 22, column: 40)
!636 = !DILocation(line: 23, column: 66, scope: !635, inlinedAt: !611)
!637 = !DILocation(line: 23, column: 40, scope: !635, inlinedAt: !611)
!638 = !DILocation(line: 23, column: 76, scope: !635, inlinedAt: !611)
!639 = !DILocalVariable(name: "m_vec_limbs", arg: 1, scope: !640, file: !409, line: 13, type: !86)
!640 = distinct !DISubprogram(name: "m_vec_copy", scope: !409, file: !409, line: 13, type: !641, scopeLine: 13, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !84, retainedNodes: !71)
!641 = !DISubroutineType(types: !642)
!642 = !{null, !86, !342, !52}
!643 = !DILocation(line: 0, scope: !640, inlinedAt: !644)
!644 = distinct !DILocation(line: 23, column: 13, scope: !635, inlinedAt: !611)
!645 = !DILocalVariable(name: "in", arg: 2, scope: !640, file: !409, line: 13, type: !342)
!646 = !DILocalVariable(name: "out", arg: 3, scope: !640, file: !409, line: 13, type: !52)
!647 = !DILocalVariable(name: "i", scope: !648, file: !409, line: 15, type: !58)
!648 = distinct !DILexicalBlock(scope: !640, file: !409, line: 15, column: 5)
!649 = !DILocation(line: 0, scope: !648, inlinedAt: !644)
!650 = !DILocation(line: 17, column: 18, scope: !651, inlinedAt: !644)
!651 = distinct !DILexicalBlock(scope: !652, file: !409, line: 16, column: 5)
!652 = distinct !DILexicalBlock(scope: !648, file: !409, line: 15, column: 5)
!653 = !DILocation(line: 17, column: 16, scope: !651, inlinedAt: !644)
!654 = !DILocation(line: 17, column: 9, scope: !651, inlinedAt: !644)
!655 = !DILocation(line: 24, column: 19, scope: !656, inlinedAt: !611)
!656 = distinct !DILexicalBlock(scope: !635, file: !99, line: 24, column: 17)
!657 = !DILocation(line: 25, column: 62, scope: !658, inlinedAt: !611)
!658 = distinct !DILexicalBlock(scope: !656, file: !99, line: 24, column: 25)
!659 = !DILocation(line: 25, column: 69, scope: !658, inlinedAt: !611)
!660 = !DILocation(line: 25, column: 43, scope: !658, inlinedAt: !611)
!661 = !DILocation(line: 25, column: 79, scope: !658, inlinedAt: !611)
!662 = !DILocalVariable(name: "m_vec_limbs", arg: 1, scope: !663, file: !409, line: 22, type: !86)
!663 = distinct !DISubprogram(name: "m_vec_add", scope: !409, file: !409, line: 22, type: !641, scopeLine: 22, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !84, retainedNodes: !71)
!664 = !DILocation(line: 0, scope: !663, inlinedAt: !665)
!665 = distinct !DILocation(line: 25, column: 17, scope: !658, inlinedAt: !611)
!666 = !DILocalVariable(name: "in", arg: 2, scope: !663, file: !409, line: 22, type: !342)
!667 = !DILocalVariable(name: "acc", arg: 3, scope: !663, file: !409, line: 22, type: !52)
!668 = !DILocalVariable(name: "i", scope: !669, file: !409, line: 24, type: !58)
!669 = distinct !DILexicalBlock(scope: !663, file: !409, line: 24, column: 5)
!670 = !DILocation(line: 0, scope: !669, inlinedAt: !665)
!671 = !DILocation(line: 26, column: 19, scope: !672, inlinedAt: !665)
!672 = distinct !DILexicalBlock(scope: !673, file: !409, line: 25, column: 5)
!673 = distinct !DILexicalBlock(scope: !669, file: !409, line: 24, column: 5)
!674 = !DILocation(line: 26, column: 16, scope: !672, inlinedAt: !665)
!675 = !DILocation(line: 26, column: 9, scope: !672, inlinedAt: !665)
!676 = !DILocation(line: 27, column: 27, scope: !635, inlinedAt: !611)
!677 = !DILocation(line: 22, column: 36, scope: !632, inlinedAt: !611)
!678 = !DILocation(line: 22, column: 9, scope: !632, inlinedAt: !611)
!679 = distinct !{!679, !633, !680, !293}
!680 = !DILocation(line: 28, column: 9, scope: !627, inlinedAt: !611)
!681 = !DILocation(line: 21, column: 32, scope: !624, inlinedAt: !611)
!682 = !DILocation(line: 21, column: 5, scope: !624, inlinedAt: !611)
!683 = distinct !{!683, !625, !684, !293}
!684 = !DILocation(line: 29, column: 5, scope: !618, inlinedAt: !611)
!685 = !DILocation(line: 597, column: 31, scope: !225, inlinedAt: !227)
!686 = !DILocalVariable(name: "in", arg: 1, scope: !687, file: !68, line: 272, type: !342)
!687 = distinct !DISubprogram(name: "pack_m_vecs", scope: !68, file: !68, line: 272, type: !688, scopeLine: 272, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !48, retainedNodes: !71)
!688 = !DISubroutineType(types: !689)
!689 = !{null, !342, !61, !86, !86}
!690 = !DILocation(line: 0, scope: !687, inlinedAt: !691)
!691 = distinct !DILocation(line: 597, column: 5, scope: !225, inlinedAt: !227)
!692 = !DILocalVariable(name: "out", arg: 2, scope: !687, file: !68, line: 272, type: !61)
!693 = !DILocalVariable(name: "vecs", arg: 3, scope: !687, file: !68, line: 272, type: !86)
!694 = !DILocalVariable(name: "m", arg: 4, scope: !687, file: !68, line: 272, type: !86)
!695 = !DILocalVariable(name: "m_vec_limbs", scope: !687, file: !68, line: 273, type: !248)
!696 = !DILocalVariable(name: "_in", scope: !687, file: !68, line: 274, type: !61)
!697 = !DILocalVariable(name: "i", scope: !698, file: !68, line: 275, type: !86)
!698 = distinct !DILexicalBlock(scope: !687, file: !68, line: 275, column: 5)
!699 = !DILocation(line: 0, scope: !698, inlinedAt: !691)
!700 = !DILocation(line: 275, column: 10, scope: !698, inlinedAt: !691)
!701 = !DILocation(line: 275, scope: !698, inlinedAt: !691)
!702 = !DILocation(line: 277, column: 27, scope: !703, inlinedAt: !691)
!703 = distinct !DILexicalBlock(scope: !704, file: !68, line: 276, column: 5)
!704 = distinct !DILexicalBlock(scope: !698, file: !68, line: 275, column: 5)
!705 = !DILocation(line: 277, column: 21, scope: !703, inlinedAt: !691)
!706 = !DILocation(line: 277, column: 51, scope: !703, inlinedAt: !691)
!707 = !DILocation(line: 277, column: 36, scope: !703, inlinedAt: !691)
!708 = !DILocation(line: 277, column: 9, scope: !703, inlinedAt: !691)
!709 = !DILocation(line: 275, column: 32, scope: !704, inlinedAt: !691)
!710 = !DILocation(line: 275, column: 23, scope: !704, inlinedAt: !691)
!711 = !DILocation(line: 275, column: 5, scope: !698, inlinedAt: !691)
!712 = !DILocation(line: 275, column: 5, scope: !704, inlinedAt: !691)
!713 = distinct !{!713, !711, !714, !293}
!714 = !DILocation(line: 278, column: 5, scope: !698, inlinedAt: !691)
!715 = !DILabel(scope: !225, name: "err", file: !68, line: 600)
!716 = !DILocation(line: 600, column: 5, scope: !225, inlinedAt: !227)
!717 = !DILocation(line: 602, column: 5, scope: !225, inlinedAt: !227)
!718 = !DILocation(line: 603, column: 5, scope: !225, inlinedAt: !227)
!719 = !DILocation(line: 604, column: 5, scope: !225, inlinedAt: !227)
!720 = !DILocation(line: 605, column: 5, scope: !225, inlinedAt: !227)
!721 = !DILabel(scope: !188, name: "err", file: !68, line: 306)
!722 = !DILocation(line: 306, column: 1, scope: !188, inlinedAt: !220)
!723 = !DILocalVariable(name: "res", scope: !117, file: !2, line: 44, type: !86)
!724 = !DILocation(line: 50, column: 9, scope: !725, inlinedAt: !151)
!725 = distinct !DILexicalBlock(scope: !726, file: !2, line: 49, column: 12)
!726 = distinct !DILexicalBlock(scope: !117, file: !2, line: 45, column: 9)
!727 = !DILocation(line: 53, column: 5, scope: !117, inlinedAt: !151)
!728 = !DILocalVariable(name: "p", arg: 1, scope: !729, file: !68, line: 310, type: !191)
!729 = distinct !DISubprogram(name: "pqmayo_MAYO_3_ref_mayo_expand_sk", scope: !68, file: !68, line: 310, type: !730, scopeLine: 311, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !48, retainedNodes: !71)
!730 = !DISubroutineType(types: !731)
!731 = !{!86, !191, !90, !732}
!732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !733, size: 32)
!733 = !DIDerivedType(tag: DW_TAG_typedef, name: "sk_t", file: !79, line: 294, baseType: !734)
!734 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sk_t", file: !79, line: 291, size: 3129408, elements: !735)
!735 = !{!736, !737}
!736 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !734, file: !79, line: 292, baseType: !167, size: 3120768)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "O", scope: !734, file: !79, line: 293, baseType: !171, size: 8640, offset: 3120768)
!738 = !DILocation(line: 0, scope: !729, inlinedAt: !739)
!739 = distinct !DILocation(line: 54, column: 11, scope: !117, inlinedAt: !151)
!740 = !DILocalVariable(name: "csk", arg: 2, scope: !729, file: !68, line: 310, type: !90)
!741 = !DILocalVariable(name: "sk", arg: 3, scope: !729, file: !68, line: 311, type: !732)
!742 = !DILocalVariable(name: "ret", scope: !729, file: !68, line: 312, type: !86)
!743 = !DILocalVariable(name: "S", scope: !729, file: !68, line: 313, type: !233)
!744 = !DILocation(line: 313, column: 19, scope: !729, inlinedAt: !739)
!745 = !DILocalVariable(name: "P", scope: !729, file: !68, line: 314, type: !52)
!746 = !DILocation(line: 315, column: 28, scope: !729, inlinedAt: !739)
!747 = !DILocalVariable(name: "O", scope: !729, file: !68, line: 315, type: !61)
!748 = !DILocalVariable(name: "param_o", scope: !729, file: !68, line: 317, type: !248)
!749 = !DILocalVariable(name: "param_v", scope: !729, file: !68, line: 318, type: !248)
!750 = !DILocalVariable(name: "param_O_bytes", scope: !729, file: !68, line: 319, type: !248)
!751 = !DILocalVariable(name: "param_pk_seed_bytes", scope: !729, file: !68, line: 320, type: !248)
!752 = !DILocalVariable(name: "param_sk_seed_bytes", scope: !729, file: !68, line: 321, type: !248)
!753 = !DILocalVariable(name: "seed_sk", scope: !729, file: !68, line: 323, type: !90)
!754 = !DILocalVariable(name: "seed_pk", scope: !729, file: !68, line: 324, type: !61)
!755 = !DILocation(line: 326, column: 5, scope: !729, inlinedAt: !739)
!756 = !DILocation(line: 328, column: 14, scope: !729, inlinedAt: !739)
!757 = !DILocation(line: 0, scope: !267, inlinedAt: !758)
!758 = distinct !DILocation(line: 328, column: 5, scope: !729, inlinedAt: !739)
!759 = !DILocation(line: 22, column: 10, scope: !276, inlinedAt: !758)
!760 = !DILocation(line: 46, column: 9, scope: !761, inlinedAt: !151)
!761 = distinct !DILexicalBlock(scope: !726, file: !2, line: 45, column: 25)
!762 = !DILocation(line: 48, column: 9, scope: !761, inlinedAt: !151)
!763 = !DILocation(line: 22, scope: !276, inlinedAt: !758)
!764 = !DILocation(line: 23, column: 19, scope: !279, inlinedAt: !758)
!765 = !DILocation(line: 23, column: 24, scope: !279, inlinedAt: !758)
!766 = !DILocation(line: 23, column: 14, scope: !279, inlinedAt: !758)
!767 = !DILocation(line: 23, column: 17, scope: !279, inlinedAt: !758)
!768 = !DILocation(line: 24, column: 24, scope: !279, inlinedAt: !758)
!769 = !DILocation(line: 24, column: 17, scope: !279, inlinedAt: !758)
!770 = !DILocation(line: 22, column: 34, scope: !280, inlinedAt: !758)
!771 = !DILocation(line: 24, column: 14, scope: !279, inlinedAt: !758)
!772 = !DILocation(line: 22, column: 19, scope: !280, inlinedAt: !758)
!773 = !DILocation(line: 22, column: 5, scope: !276, inlinedAt: !758)
!774 = !DILocation(line: 22, column: 5, scope: !280, inlinedAt: !758)
!775 = distinct !{!775, !773, !776, !293}
!776 = !DILocation(line: 25, column: 5, scope: !276, inlinedAt: !758)
!777 = !DILocation(line: 0, scope: !295, inlinedAt: !778)
!778 = distinct !DILocation(line: 334, column: 5, scope: !729, inlinedAt: !739)
!779 = !DILocation(line: 284, column: 5, scope: !295, inlinedAt: !778)
!780 = !DILocation(line: 0, scope: !304, inlinedAt: !781)
!781 = distinct !DILocation(line: 285, column: 5, scope: !295, inlinedAt: !778)
!782 = !DILocation(line: 265, column: 14, scope: !304, inlinedAt: !781)
!783 = !DILocation(line: 0, scope: !318, inlinedAt: !781)
!784 = !DILocation(line: 266, column: 10, scope: !318, inlinedAt: !781)
!785 = !DILocation(line: 266, scope: !318, inlinedAt: !781)
!786 = !DILocation(line: 268, column: 29, scope: !323, inlinedAt: !781)
!787 = !DILocation(line: 268, column: 24, scope: !323, inlinedAt: !781)
!788 = !DILocation(line: 268, column: 9, scope: !323, inlinedAt: !781)
!789 = !DILocation(line: 269, column: 36, scope: !323, inlinedAt: !781)
