; ModuleID = 'composite'
source_filename = "composite"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "arm-unknown-none-eabi"

%struct.mayo_params_t = type { i32, i32, i32, i32, i32, ptr, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, ptr }
%struct.sk_t = type { [113103 x i64], [2414 x i8] }

@MAYO_1 = external dso_local constant %struct.mayo_params_t, align 4
@MAYO_2 = external dso_local constant %struct.mayo_params_t, align 4
@MAYO_3 = external dso_local constant %struct.mayo_params_t, align 4
@MAYO_5 = external dso_local constant %struct.mayo_params_t, align 4
@__const.main.params = private unnamed_addr constant [4 x ptr] [ptr @MAYO_1, ptr @MAYO_2, ptr @MAYO_3, ptr @MAYO_5], align 4
@__const.example_mayo.msg = private unnamed_addr constant <{ i8, [31 x i8] }> <{ i8 14, [31 x i8] zeroinitializer }>, align 1
@.str = private unnamed_addr constant [17 x i8] c"Example with %s\0A\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [17 x i8] c"mayo_keypair -> \00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [6 x i8] c"FAIL\0A\00", align 1, !dbg !9
@.str.3 = private unnamed_addr constant [4 x i8] c"OK\0A\00", align 1, !dbg !14
@.str.4 = private unnamed_addr constant [19 x i8] c"mayo_expand_sk -> \00", align 1, !dbg !19
@.str.5 = private unnamed_addr constant [19 x i8] c"mayo_expand_pk -> \00", align 1, !dbg !24

!18 = !DISubrange(count: 4)
!19 = !DIGlobalVariableExpression(var: !20, expr: !DIExpression())
!20 = distinct !DIGlobalVariable(scope: null, file: !2, line: 53, type: !21, isLocal: true, isDefinition: true)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 152, elements: !22)
!22 = !{!23}
!23 = !DISubrange(count: 19)
!24 = !DIGlobalVariableExpression(var: !25, expr: !DIExpression())
!25 = distinct !DIGlobalVariable(scope: null, file: !2, line: 63, type: !21, isLocal: true, isDefinition: true)
!26 = !DIGlobalVariableExpression(var: !27, expr: !DIExpression())
!27 = distinct !DIGlobalVariable(scope: null, file: !2, line: 73, type: !28, isLocal: true, isDefinition: true)
!28 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 112, elements: !29)
!29 = !{!30}
!30 = !DISubrange(count: 14)
!31 = !DIGlobalVariableExpression(var: !32, expr: !DIExpression())
!32 = distinct !DIGlobalVariable(scope: null, file: !2, line: 83, type: !33, isLocal: true, isDefinition: true)
!33 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 312, elements: !34)
!34 = !{!35}
!35 = !DISubrange(count: 39)
!36 = !DIGlobalVariableExpression(var: !37, expr: !DIExpression())
!37 = distinct !DIGlobalVariable(scope: null, file: !2, line: 94, type: !38, isLocal: true, isDefinition: true)
!38 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 328, elements: !39)
!39 = !{!40}
!40 = !DISubrange(count: 41)
!41 = distinct !DICompileUnit(language: DW_LANG_C11, file: !42, producer: "clang version 23.0.0git (https://github.com/llvm/llvm-project.git a07347f60997b971314563c7427aff5153677d95)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, globals: !43, splitDebugInlining: false, nameTableKind: None)
!42 = !DIFile(filename: "../<stdin>", directory: "")
!43 = !{!0, !7, !9, !14, !19, !24, !26, !31, !36}
!44 = distinct !DICompileUnit(language: DW_LANG_C11, file: !45, producer: "clang version 23.0.0git (https://github.com/llvm/llvm-project.git a07347f60997b971314563c7427aff5153677d95)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !46, globals: !58, splitDebugInlining: false, nameTableKind: None)
!45 = !DIFile(filename: "../../../src/<stdin>", directory: "")
!46 = !{!47, !48, !54, !57}
!47 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 32)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !50, line: 60, baseType: !51)
!50 = !DIFile(filename: "/usr/lib/arm-none-eabi/include/sys/_stdint.h", directory: "")
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !52, line: 105, baseType: !53)
!52 = !DIFile(filename: "/usr/lib/arm-none-eabi/include/machine/_default_types.h", directory: "")
!53 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !55, line: 214, baseType: !56)
!55 = !DIFile(filename: "/usr/lib/gcc/arm-none-eabi/13.2.1/include/stddef.h", directory: "")
!56 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 32)
!58 = !{!59, !67, !69, !71}
!59 = !DIGlobalVariableExpression(var: !60, expr: !DIExpression())
!60 = distinct !DIGlobalVariable(name: "even_nibbles", scope: !61, file: !62, line: 112, type: !66, isLocal: true, isDefinition: true)
!61 = distinct !DISubprogram(name: "transpose_16x16_nibbles", scope: !62, file: !62, line: 111, type: !63, scopeLine: 111, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !44, retainedNodes: !65)
!62 = !DIFile(filename: "../../../src/mayo.c", directory: "")
!63 = !DISubroutineType(types: !64)
!64 = !{null, !48}
!65 = !{}
!66 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !49)
!67 = !DIGlobalVariableExpression(var: !68, expr: !DIExpression())
!68 = distinct !DIGlobalVariable(name: "even_bytes", scope: !61, file: !62, line: 113, type: !66, isLocal: true, isDefinition: true)
!69 = !DIGlobalVariableExpression(var: !70, expr: !DIExpression())
!70 = distinct !DIGlobalVariable(name: "even_2bytes", scope: !61, file: !62, line: 114, type: !66, isLocal: true, isDefinition: true)
!71 = !DIGlobalVariableExpression(var: !72, expr: !DIExpression())
!72 = distinct !DIGlobalVariable(name: "even_half", scope: !61, file: !62, line: 115, type: !66, isLocal: true, isDefinition: true)
!73 = !{!"clang version 23.0.0git (https://github.com/llvm/llvm-project.git a07347f60997b971314563c7427aff5153677d95)"}
!74 = !{i32 2, !"Debug Info Version", i32 3}
!75 = !{i32 1, !"wchar_size", i32 4}
!76 = !{i32 1, !"min_enum_size", i32 4}
!77 = !{i32 4, !"arm-eabi-fp-denormal", i32 1}
!78 = !{i32 8, !"arm-eabi-fp-number-model", i32 3}
!79 = !{i32 1, !"Code Model", i32 1}
!80 = distinct !DISubprogram(name: "main", scope: !2, file: !2, line: 138, type: !81, scopeLine: 138, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !41, retainedNodes: !65)
!81 = !DISubroutineType(types: !82)
!82 = !{!83}
!83 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!84 = !DILocalVariable(name: "params", scope: !80, file: !2, line: 140, type: !85)
!85 = !DICompositeType(tag: DW_TAG_array_type, baseType: !86, size: 128, elements: !17)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 32)
!87 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !88)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "mayo_params_t", file: !89, line: 289, baseType: !90)
!89 = !DIFile(filename: "../../../include/mayo.h", directory: "")
!90 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !89, line: 265, size: 736, elements: !91)
!91 = !{!92, !93, !94, !95, !96, !97, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116}
!92 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !90, file: !89, line: 266, baseType: !83, size: 32)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !90, file: !89, line: 267, baseType: !83, size: 32, offset: 32)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "o", scope: !90, file: !89, line: 268, baseType: !83, size: 32, offset: 64)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "k", scope: !90, file: !89, line: 269, baseType: !83, size: 32, offset: 96)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !90, file: !89, line: 270, baseType: !83, size: 32, offset: 128)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "f_tail", scope: !90, file: !89, line: 271, baseType: !98, size: 32, offset: 160)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 32)
!99 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !47)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "m_bytes", scope: !90, file: !89, line: 272, baseType: !83, size: 32, offset: 192)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "O_bytes", scope: !90, file: !89, line: 273, baseType: !83, size: 32, offset: 224)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "v_bytes", scope: !90, file: !89, line: 274, baseType: !83, size: 32, offset: 256)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "r_bytes", scope: !90, file: !89, line: 275, baseType: !83, size: 32, offset: 288)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "R_bytes", scope: !90, file: !89, line: 276, baseType: !83, size: 32, offset: 320)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "P1_bytes", scope: !90, file: !89, line: 277, baseType: !83, size: 32, offset: 352)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "P2_bytes", scope: !90, file: !89, line: 278, baseType: !83, size: 32, offset: 384)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "P3_bytes", scope: !90, file: !89, line: 279, baseType: !83, size: 32, offset: 416)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "csk_bytes", scope: !90, file: !89, line: 280, baseType: !83, size: 32, offset: 448)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "cpk_bytes", scope: !90, file: !89, line: 281, baseType: !83, size: 32, offset: 480)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "sig_bytes", scope: !90, file: !89, line: 282, baseType: !83, size: 32, offset: 512)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "salt_bytes", scope: !90, file: !89, line: 283, baseType: !83, size: 32, offset: 544)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "sk_seed_bytes", scope: !90, file: !89, line: 284, baseType: !83, size: 32, offset: 576)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "digest_bytes", scope: !90, file: !89, line: 285, baseType: !83, size: 32, offset: 608)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "pk_seed_bytes", scope: !90, file: !89, line: 286, baseType: !83, size: 32, offset: 640)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "m_vec_limbs", scope: !90, file: !89, line: 287, baseType: !83, size: 32, offset: 672)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !90, file: !89, line: 288, baseType: !117, size: 32, offset: 704)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 32)
!118 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!119 = !DILocation(line: 140, column: 26, scope: !80)
!120 = !DILocalVariable(name: "paramslen", scope: !80, file: !2, line: 141, type: !83)
!121 = !DILocation(line: 141, column: 9, scope: !80)
!122 = !DILocalVariable(name: "i", scope: !123, file: !2, line: 142, type: !83)
!123 = distinct !DILexicalBlock(scope: !80, file: !2, line: 142, column: 5)
!124 = !DILocation(line: 142, column: 14, scope: !123)
!125 = !DILocation(line: 142, column: 10, scope: !123)
!126 = !DILocation(line: 142, column: 21, scope: !127)
!127 = distinct !DILexicalBlock(scope: !123, file: !2, line: 142, column: 5)
!128 = !DILocation(line: 142, column: 25, scope: !127)
!129 = !DILocation(line: 142, column: 23, scope: !127)
!130 = !DILocation(line: 142, column: 5, scope: !123)
!131 = !DILocation(line: 143, column: 33, scope: !132)
!132 = distinct !DILexicalBlock(scope: !133, file: !2, line: 143, column: 13)
!133 = distinct !DILexicalBlock(scope: !127, file: !2, line: 142, column: 41)
!134 = !DILocation(line: 143, column: 26, scope: !132)
!135 = !DILocation(line: 143, column: 13, scope: !132)
!136 = !DILocation(line: 143, column: 37, scope: !132)
!137 = !DILocation(line: 144, column: 13, scope: !138)
!138 = distinct !DILexicalBlock(scope: !132, file: !2, line: 143, column: 49)
!139 = !DILocation(line: 146, column: 5, scope: !133)
!140 = !DILocation(line: 142, column: 36, scope: !127)
!141 = !DILocation(line: 142, column: 5, scope: !127)
!142 = distinct !{!142, !130, !143, !144}
!143 = !DILocation(line: 146, column: 5, scope: !123)
!144 = !{!"llvm.loop.mustprogress"}
!145 = !DILocation(line: 150, column: 1, scope: !80)
!146 = distinct !DISubprogram(name: "example_mayo", scope: !2, file: !2, line: 25, type: !147, scopeLine: 25, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !41, retainedNodes: !65)
!147 = !DISubroutineType(types: !148)
!148 = !{!83, !86}
!149 = !DILocalVariable(name: "p", arg: 1, scope: !146, file: !2, line: 25, type: !86)
!150 = !DILocation(line: 25, column: 46, scope: !146)
!151 = !DILocalVariable(name: "msglen", scope: !146, file: !2, line: 27, type: !54)
!152 = !DILocation(line: 27, column: 12, scope: !146)
!153 = !DILocalVariable(name: "smlen", scope: !146, file: !2, line: 28, type: !54)
!154 = !DILocation(line: 28, column: 12, scope: !146)
!155 = !DILocation(line: 28, column: 36, scope: !146)
!156 = !DILocation(line: 28, column: 20, scope: !146)
!157 = !DILocation(line: 28, column: 41, scope: !146)
!158 = !DILocation(line: 28, column: 39, scope: !146)
!159 = !DILocalVariable(name: "pk", scope: !146, file: !2, line: 30, type: !57)
!160 = !DILocation(line: 30, column: 20, scope: !146)
!161 = !DILocation(line: 30, column: 49, scope: !146)
!162 = !DILocation(line: 30, column: 33, scope: !146)
!163 = !DILocation(line: 30, column: 26, scope: !146)
!164 = !DILocalVariable(name: "sk", scope: !146, file: !2, line: 31, type: !57)
!165 = !DILocation(line: 31, column: 20, scope: !146)
!166 = !DILocation(line: 31, column: 49, scope: !146)
!167 = !DILocation(line: 31, column: 33, scope: !146)
!168 = !DILocation(line: 31, column: 26, scope: !146)
!169 = !DILocalVariable(name: "epk", scope: !146, file: !2, line: 33, type: !48)
!170 = !DILocation(line: 33, column: 15, scope: !146)
!171 = !DILocation(line: 33, column: 21, scope: !146)
!172 = !DILocalVariable(name: "esk", scope: !146, file: !2, line: 34, type: !173)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 32)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "sk_t", file: !89, line: 294, baseType: !175)
!175 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sk_t", file: !89, line: 291, size: 7257920, elements: !176)
!176 = !{!177, !181}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !175, file: !89, line: 292, baseType: !178, size: 7238592)
!178 = !DICompositeType(tag: DW_TAG_array_type, baseType: !49, size: 7238592, elements: !179)
!179 = !{!180}
!180 = !DISubrange(count: 113103)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "O", scope: !175, file: !89, line: 293, baseType: !182, size: 19312, offset: 7238592)
!182 = !DICompositeType(tag: DW_TAG_array_type, baseType: !183, size: 19312, elements: !185)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !50, line: 24, baseType: !184)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !52, line: 43, baseType: !47)
!185 = !{!186}
!186 = !DISubrange(count: 2414)
!187 = !DILocation(line: 34, column: 11, scope: !146)
!188 = !DILocation(line: 34, column: 17, scope: !146)
!189 = !DILocalVariable(name: "sig", scope: !146, file: !2, line: 36, type: !57)
!190 = !DILocation(line: 36, column: 20, scope: !146)
!191 = !DILocation(line: 36, column: 49, scope: !146)
!192 = !DILocation(line: 36, column: 33, scope: !146)
!193 = !DILocation(line: 36, column: 54, scope: !146)
!194 = !DILocation(line: 36, column: 52, scope: !146)
!195 = !DILocation(line: 36, column: 26, scope: !146)
!196 = !DILocalVariable(name: "msg", scope: !146, file: !2, line: 38, type: !197)
!197 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 256, elements: !198)
!198 = !{!199}
!199 = !DISubrange(count: 32)
!200 = !DILocation(line: 38, column: 19, scope: !146)
!201 = !DILocalVariable(name: "msg2", scope: !146, file: !2, line: 39, type: !197)
!202 = !DILocation(line: 39, column: 19, scope: !146)
!203 = !DILocation(line: 41, column: 44, scope: !146)
!204 = !DILocation(line: 41, column: 33, scope: !146)
!205 = !DILocation(line: 41, column: 5, scope: !146)
!206 = !DILocation(line: 43, column: 5, scope: !146)
!207 = !DILocalVariable(name: "res", scope: !146, file: !2, line: 44, type: !83)
!208 = !DILocation(line: 44, column: 9, scope: !146)
!209 = !DILocation(line: 44, column: 28, scope: !146)
!210 = !DILocation(line: 44, column: 31, scope: !146)
!211 = !DILocation(line: 44, column: 35, scope: !146)
!212 = !DILocation(line: 44, column: 15, scope: !146)
!213 = !DILocation(line: 45, column: 9, scope: !214)
!214 = distinct !DILexicalBlock(scope: !146, file: !2, line: 45, column: 9)
!215 = !DILocation(line: 45, column: 13, scope: !214)
!216 = !DILocation(line: 46, column: 9, scope: !217)
!217 = distinct !DILexicalBlock(scope: !214, file: !2, line: 45, column: 25)
!218 = !DILocation(line: 47, column: 13, scope: !217)
!219 = !DILocation(line: 48, column: 9, scope: !217)
!220 = !DILocation(line: 50, column: 9, scope: !221)
!221 = distinct !DILexicalBlock(scope: !214, file: !2, line: 49, column: 12)
!222 = !DILocation(line: 53, column: 5, scope: !146)
!223 = !DILocation(line: 54, column: 26, scope: !146)
!224 = !DILocation(line: 54, column: 29, scope: !146)
!225 = !DILocation(line: 54, column: 33, scope: !146)
!226 = !DILocation(line: 54, column: 11, scope: !146)
!227 = !DILocation(line: 54, column: 9, scope: !146)
!228 = !DILocation(line: 55, column: 9, scope: !229)
!229 = distinct !DILexicalBlock(scope: !146, file: !2, line: 55, column: 9)
!230 = !DILocation(line: 55, column: 13, scope: !229)
!231 = !DILocation(line: 56, column: 9, scope: !232)
!232 = distinct !DILexicalBlock(scope: !229, file: !2, line: 55, column: 25)
!233 = !DILocation(line: 57, column: 13, scope: !232)
!234 = !DILocation(line: 58, column: 9, scope: !232)
!235 = !DILocation(line: 60, column: 9, scope: !236)
!236 = distinct !DILexicalBlock(scope: !229, file: !2, line: 59, column: 12)
!237 = !DILocation(line: 63, column: 5, scope: !146)
!238 = !DILocation(line: 64, column: 26, scope: !146)
!239 = !DILocation(line: 64, column: 29, scope: !146)
!240 = !DILocation(line: 64, column: 33, scope: !146)
!241 = !DILocation(line: 64, column: 11, scope: !146)
!242 = !DILocation(line: 64, column: 9, scope: !146)
!243 = !DILocation(line: 65, column: 9, scope: !244)
!244 = distinct !DILexicalBlock(scope: !146, file: !2, line: 65, column: 9)
!245 = !DILocation(line: 65, column: 13, scope: !244)
!246 = !DILocation(line: 66, column: 9, scope: !247)
!247 = distinct !DILexicalBlock(scope: !244, file: !2, line: 65, column: 25)
!248 = !DILocation(line: 67, column: 13, scope: !247)
!249 = !DILocation(line: 68, column: 9, scope: !247)
!250 = !DILocation(line: 70, column: 9, scope: !251)
!251 = distinct !DILexicalBlock(scope: !244, file: !2, line: 69, column: 12)
!252 = !DILocation(line: 73, column: 5, scope: !146)
!253 = !DILocation(line: 74, column: 21, scope: !146)
!254 = !DILocation(line: 74, column: 24, scope: !146)
!255 = !DILocation(line: 74, column: 37, scope: !146)
!256 = !DILocation(line: 74, column: 42, scope: !146)
!257 = !DILocation(line: 74, column: 50, scope: !146)
!258 = !DILocation(line: 74, column: 11, scope: !146)
!259 = !DILocation(line: 74, column: 9, scope: !146)
!260 = !DILocation(line: 75, column: 9, scope: !261)
!261 = distinct !DILexicalBlock(scope: !146, file: !2, line: 75, column: 9)
!262 = !DILocation(line: 75, column: 13, scope: !261)
!263 = !DILocation(line: 76, column: 9, scope: !264)
!264 = distinct !DILexicalBlock(scope: !261, file: !2, line: 75, column: 25)
!265 = !DILocation(line: 77, column: 13, scope: !264)
!266 = !DILocation(line: 78, column: 9, scope: !264)
!267 = !DILocation(line: 80, column: 9, scope: !268)
!268 = distinct !DILexicalBlock(scope: !261, file: !2, line: 79, column: 12)
!269 = !DILocation(line: 83, column: 5, scope: !146)
!270 = !DILocation(line: 84, column: 21, scope: !146)
!271 = !DILocation(line: 84, column: 24, scope: !146)
!272 = !DILocation(line: 84, column: 39, scope: !146)
!273 = !DILocation(line: 84, column: 44, scope: !146)
!274 = !DILocation(line: 84, column: 51, scope: !146)
!275 = !DILocation(line: 84, column: 11, scope: !146)
!276 = !DILocation(line: 84, column: 9, scope: !146)
!277 = !DILocation(line: 85, column: 9, scope: !278)
!278 = distinct !DILexicalBlock(scope: !146, file: !2, line: 85, column: 9)
!279 = !DILocation(line: 85, column: 13, scope: !278)
!280 = !DILocation(line: 85, column: 24, scope: !278)
!281 = !DILocation(line: 85, column: 34, scope: !278)
!282 = !DILocation(line: 85, column: 39, scope: !278)
!283 = !DILocation(line: 85, column: 45, scope: !278)
!284 = !DILocation(line: 85, column: 27, scope: !278)
!285 = !DILocation(line: 86, column: 9, scope: !286)
!286 = distinct !DILexicalBlock(scope: !278, file: !2, line: 85, column: 54)
!287 = !DILocation(line: 87, column: 13, scope: !286)
!288 = !DILocation(line: 88, column: 9, scope: !286)
!289 = !DILocation(line: 90, column: 13, scope: !290)
!290 = distinct !DILexicalBlock(scope: !278, file: !2, line: 89, column: 12)
!291 = !DILocation(line: 91, column: 9, scope: !290)
!292 = !DILocation(line: 94, column: 5, scope: !146)
!293 = !DILocation(line: 95, column: 23, scope: !146)
!294 = !DILocation(line: 95, column: 26, scope: !146)
!295 = !DILocation(line: 95, column: 31, scope: !146)
!296 = !DILocation(line: 95, column: 39, scope: !146)
!297 = !DILocation(line: 95, column: 44, scope: !146)
!298 = !DILocation(line: 95, column: 11, scope: !146)
!299 = !DILocation(line: 95, column: 9, scope: !146)
!300 = !DILocation(line: 96, column: 9, scope: !301)
!301 = distinct !DILexicalBlock(scope: !146, file: !2, line: 96, column: 9)
!302 = !DILocation(line: 96, column: 13, scope: !301)
!303 = !DILocation(line: 97, column: 9, scope: !304)
!304 = distinct !DILexicalBlock(scope: !301, file: !2, line: 96, column: 25)
!305 = !DILocation(line: 98, column: 13, scope: !304)
!306 = !DILocation(line: 99, column: 9, scope: !304)
!307 = !DILocation(line: 101, column: 13, scope: !308)
!308 = distinct !DILexicalBlock(scope: !301, file: !2, line: 100, column: 12)
!309 = !DILocation(line: 102, column: 9, scope: !308)
!310 = !DILocation(line: 96, column: 16, scope: !301)
!311 = !DILabel(scope: !146, name: "err", file: !2, line: 129, column: 1)
!312 = !DILocation(line: 129, column: 1, scope: !146)
!313 = !DILocation(line: 130, column: 10, scope: !146)
!314 = !DILocation(line: 130, column: 5, scope: !146)
!315 = !DILocation(line: 131, column: 10, scope: !146)
!316 = !DILocation(line: 131, column: 5, scope: !146)
!317 = !DILocation(line: 132, column: 22, scope: !146)
!318 = !DILocation(line: 132, column: 42, scope: !146)
!319 = !DILocation(line: 132, column: 26, scope: !146)
!320 = !DILocation(line: 132, column: 5, scope: !146)
!321 = !DILocation(line: 133, column: 22, scope: !146)
!322 = !DILocation(line: 133, column: 5, scope: !146)
!323 = !DILocation(line: 134, column: 10, scope: !146)
!324 = !DILocation(line: 134, column: 5, scope: !146)
!325 = !DILocation(line: 135, column: 12, scope: !146)
!326 = !DILocation(line: 135, column: 5, scope: !146)
!327 = distinct !DISubprogram(name: "mayo_keypair", scope: !62, file: !62, line: 298, type: !328, scopeLine: 298, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !65)
!328 = !DISubroutineType(types: !329)
!329 = !{!83, !330, !57, !57}
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 32)
!331 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !332)
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "mayo_params_t", file: !89, line: 289, baseType: !333)
!333 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !89, line: 265, size: 736, elements: !334)
!334 = !{!335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !333, file: !89, line: 266, baseType: !83, size: 32)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !333, file: !89, line: 267, baseType: !83, size: 32, offset: 32)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "o", scope: !333, file: !89, line: 268, baseType: !83, size: 32, offset: 64)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "k", scope: !333, file: !89, line: 269, baseType: !83, size: 32, offset: 96)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !333, file: !89, line: 270, baseType: !83, size: 32, offset: 128)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "f_tail", scope: !333, file: !89, line: 271, baseType: !98, size: 32, offset: 160)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "m_bytes", scope: !333, file: !89, line: 272, baseType: !83, size: 32, offset: 192)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "O_bytes", scope: !333, file: !89, line: 273, baseType: !83, size: 32, offset: 224)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "v_bytes", scope: !333, file: !89, line: 274, baseType: !83, size: 32, offset: 256)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "r_bytes", scope: !333, file: !89, line: 275, baseType: !83, size: 32, offset: 288)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "R_bytes", scope: !333, file: !89, line: 276, baseType: !83, size: 32, offset: 320)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "P1_bytes", scope: !333, file: !89, line: 277, baseType: !83, size: 32, offset: 352)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "P2_bytes", scope: !333, file: !89, line: 278, baseType: !83, size: 32, offset: 384)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "P3_bytes", scope: !333, file: !89, line: 279, baseType: !83, size: 32, offset: 416)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "csk_bytes", scope: !333, file: !89, line: 280, baseType: !83, size: 32, offset: 448)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "cpk_bytes", scope: !333, file: !89, line: 281, baseType: !83, size: 32, offset: 480)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "sig_bytes", scope: !333, file: !89, line: 282, baseType: !83, size: 32, offset: 512)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "salt_bytes", scope: !333, file: !89, line: 283, baseType: !83, size: 32, offset: 544)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "sk_seed_bytes", scope: !333, file: !89, line: 284, baseType: !83, size: 32, offset: 576)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "digest_bytes", scope: !333, file: !89, line: 285, baseType: !83, size: 32, offset: 608)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "pk_seed_bytes", scope: !333, file: !89, line: 286, baseType: !83, size: 32, offset: 640)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "m_vec_limbs", scope: !333, file: !89, line: 287, baseType: !83, size: 32, offset: 672)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !333, file: !89, line: 288, baseType: !117, size: 32, offset: 704)
!358 = !DILocalVariable(name: "p", arg: 1, scope: !327, file: !62, line: 298, type: !330)
!359 = !DILocation(line: 298, column: 39, scope: !327)
!360 = !DILocalVariable(name: "pk", arg: 2, scope: !327, file: !62, line: 298, type: !57)
!361 = !DILocation(line: 298, column: 57, scope: !327)
!362 = !DILocalVariable(name: "sk", arg: 3, scope: !327, file: !62, line: 298, type: !57)
!363 = !DILocation(line: 298, column: 76, scope: !327)
!364 = !DILocalVariable(name: "ret", scope: !327, file: !62, line: 299, type: !83)
!365 = !DILocation(line: 299, column: 9, scope: !327)
!366 = !DILocation(line: 301, column: 32, scope: !327)
!367 = !DILocation(line: 301, column: 35, scope: !327)
!368 = !DILocation(line: 301, column: 39, scope: !327)
!369 = !DILocation(line: 301, column: 11, scope: !327)
!370 = !DILocation(line: 301, column: 9, scope: !327)
!371 = !DILocation(line: 302, column: 9, scope: !372)
!372 = distinct !DILexicalBlock(scope: !327, file: !62, line: 302, column: 9)
!373 = !DILocation(line: 302, column: 13, scope: !372)
!374 = !DILocation(line: 303, column: 9, scope: !375)
!375 = distinct !DILexicalBlock(scope: !372, file: !62, line: 302, column: 25)
!376 = !DILocation(line: 302, column: 16, scope: !372)
!377 = !DILabel(scope: !327, name: "err", file: !62, line: 306, column: 1)
!378 = !DILocation(line: 306, column: 1, scope: !327)
!379 = !DILocation(line: 307, column: 12, scope: !327)
!380 = !DILocation(line: 307, column: 5, scope: !327)
!381 = distinct !DISubprogram(name: "mayo_keypair_compact", scope: !62, file: !62, line: 538, type: !328, scopeLine: 539, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !65)
!382 = !DILocalVariable(name: "p", arg: 1, scope: !381, file: !62, line: 538, type: !330)
!383 = !DILocation(line: 538, column: 47, scope: !381)
!384 = !DILocalVariable(name: "cpk", arg: 2, scope: !381, file: !62, line: 538, type: !57)
!385 = !DILocation(line: 538, column: 65, scope: !381)
!386 = !DILocalVariable(name: "csk", arg: 3, scope: !381, file: !62, line: 539, type: !57)
!387 = !DILocation(line: 539, column: 41, scope: !381)
!388 = !DILocalVariable(name: "ret", scope: !381, file: !62, line: 540, type: !83)
!389 = !DILocation(line: 540, column: 9, scope: !381)
!390 = !DILocalVariable(name: "seed_sk", scope: !381, file: !62, line: 541, type: !57)
!391 = !DILocation(line: 541, column: 20, scope: !381)
!392 = !DILocation(line: 541, column: 30, scope: !381)
!393 = !DILocalVariable(name: "S", scope: !381, file: !62, line: 542, type: !394)
!394 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 6944, elements: !395)
!395 = !{!396}
!396 = !DISubrange(count: 868)
!397 = !DILocation(line: 542, column: 19, scope: !381)
!398 = !DILocalVariable(name: "P", scope: !381, file: !62, line: 543, type: !178)
!399 = !DILocation(line: 543, column: 14, scope: !381)
!400 = !DILocalVariable(name: "P3", scope: !381, file: !62, line: 544, type: !401)
!401 = !DICompositeType(tag: DW_TAG_array_type, baseType: !49, size: 166464, elements: !402)
!402 = !{!403}
!403 = !DISubrange(count: 2601)
!404 = !DILocation(line: 544, column: 14, scope: !381)
!405 = !DILocalVariable(name: "seed_pk", scope: !381, file: !62, line: 546, type: !57)
!406 = !DILocation(line: 546, column: 20, scope: !381)
!407 = !DILocalVariable(name: "O", scope: !381, file: !62, line: 547, type: !408)
!408 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 19312, elements: !185)
!409 = !DILocation(line: 547, column: 19, scope: !381)
!410 = !DILocalVariable(name: "m_vec_limbs", scope: !381, file: !62, line: 549, type: !411)
!411 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !83)
!412 = !DILocation(line: 549, column: 15, scope: !381)
!413 = !DILocation(line: 549, column: 47, scope: !381)
!414 = !DILocation(line: 549, column: 29, scope: !381)
!415 = !DILocalVariable(name: "param_m", scope: !381, file: !62, line: 550, type: !411)
!416 = !DILocation(line: 550, column: 15, scope: !381)
!417 = !DILocation(line: 550, column: 33, scope: !381)
!418 = !DILocation(line: 550, column: 25, scope: !381)
!419 = !DILocalVariable(name: "param_v", scope: !381, file: !62, line: 551, type: !411)
!420 = !DILocation(line: 551, column: 15, scope: !381)
!421 = !DILocation(line: 551, column: 33, scope: !381)
!422 = !DILocation(line: 551, column: 25, scope: !381)
!423 = !DILocalVariable(name: "param_o", scope: !381, file: !62, line: 552, type: !411)
!424 = !DILocation(line: 552, column: 15, scope: !381)
!425 = !DILocation(line: 552, column: 33, scope: !381)
!426 = !DILocation(line: 552, column: 25, scope: !381)
!427 = !DILocalVariable(name: "param_O_bytes", scope: !381, file: !62, line: 553, type: !411)
!428 = !DILocation(line: 553, column: 15, scope: !381)
!429 = !DILocation(line: 553, column: 45, scope: !381)
!430 = !DILocation(line: 553, column: 31, scope: !381)
!431 = !DILocalVariable(name: "param_P1_limbs", scope: !381, file: !62, line: 554, type: !411)
!432 = !DILocation(line: 554, column: 15, scope: !381)
!433 = !DILocation(line: 554, column: 47, scope: !381)
!434 = !DILocation(line: 554, column: 32, scope: !381)
!435 = !DILocalVariable(name: "param_P3_limbs", scope: !381, file: !62, line: 555, type: !411)
!436 = !DILocation(line: 555, column: 15, scope: !381)
!437 = !DILocation(line: 555, column: 47, scope: !381)
!438 = !DILocation(line: 555, column: 32, scope: !381)
!439 = !DILocalVariable(name: "param_pk_seed_bytes", scope: !381, file: !62, line: 556, type: !411)
!440 = !DILocation(line: 556, column: 15, scope: !381)
!441 = !DILocation(line: 556, column: 57, scope: !381)
!442 = !DILocation(line: 556, column: 37, scope: !381)
!443 = !DILocalVariable(name: "param_sk_seed_bytes", scope: !381, file: !62, line: 557, type: !411)
!444 = !DILocation(line: 557, column: 15, scope: !381)
!445 = !DILocation(line: 557, column: 57, scope: !381)
!446 = !DILocation(line: 557, column: 37, scope: !381)
!447 = !DILocalVariable(name: "P1", scope: !381, file: !62, line: 559, type: !48)
!448 = !DILocation(line: 559, column: 15, scope: !381)
!449 = !DILocation(line: 559, column: 20, scope: !381)
!450 = !DILocalVariable(name: "P2", scope: !381, file: !62, line: 560, type: !48)
!451 = !DILocation(line: 560, column: 15, scope: !381)
!452 = !DILocation(line: 560, column: 20, scope: !381)
!453 = !DILocation(line: 560, column: 24, scope: !381)
!454 = !DILocation(line: 560, column: 22, scope: !381)
!455 = !DILocation(line: 566, column: 21, scope: !456)
!456 = distinct !DILexicalBlock(scope: !381, file: !62, line: 566, column: 9)
!457 = !DILocation(line: 566, column: 30, scope: !456)
!458 = !DILocation(line: 566, column: 9, scope: !456)
!459 = !DILocation(line: 566, column: 51, scope: !456)
!460 = !DILocation(line: 567, column: 13, scope: !461)
!461 = distinct !DILexicalBlock(scope: !456, file: !62, line: 566, column: 63)
!462 = !DILocation(line: 568, column: 9, scope: !461)
!463 = !DILocation(line: 573, column: 14, scope: !381)
!464 = !DILocation(line: 573, column: 17, scope: !381)
!465 = !DILocation(line: 573, column: 39, scope: !381)
!466 = !DILocation(line: 573, column: 37, scope: !381)
!467 = !DILocation(line: 573, column: 54, scope: !381)
!468 = !DILocation(line: 574, column: 14, scope: !381)
!469 = !DILocation(line: 573, column: 5, scope: !381)
!470 = !DILocation(line: 576, column: 15, scope: !381)
!471 = !DILocation(line: 576, column: 13, scope: !381)
!472 = !DILocation(line: 579, column: 12, scope: !381)
!473 = !DILocation(line: 579, column: 16, scope: !381)
!474 = !DILocation(line: 579, column: 14, scope: !381)
!475 = !DILocation(line: 579, column: 37, scope: !381)
!476 = !DILocation(line: 579, column: 40, scope: !381)
!477 = !DILocation(line: 579, column: 50, scope: !381)
!478 = !DILocation(line: 579, column: 48, scope: !381)
!479 = !DILocation(line: 579, column: 5, scope: !381)
!480 = !DILocation(line: 585, column: 18, scope: !381)
!481 = !DILocation(line: 585, column: 21, scope: !381)
!482 = !DILocation(line: 585, column: 24, scope: !381)
!483 = !DILocation(line: 585, column: 5, scope: !381)
!484 = !DILocation(line: 588, column: 16, scope: !381)
!485 = !DILocation(line: 588, column: 19, scope: !381)
!486 = !DILocation(line: 588, column: 23, scope: !381)
!487 = !DILocation(line: 588, column: 27, scope: !381)
!488 = !DILocation(line: 588, column: 30, scope: !381)
!489 = !DILocation(line: 588, column: 5, scope: !381)
!490 = !DILocation(line: 591, column: 12, scope: !381)
!491 = !DILocation(line: 591, column: 17, scope: !381)
!492 = !DILocation(line: 591, column: 26, scope: !381)
!493 = !DILocation(line: 591, column: 5, scope: !381)
!494 = !DILocalVariable(name: "P3_upper", scope: !381, file: !62, line: 593, type: !495)
!495 = !DICompositeType(tag: DW_TAG_array_type, baseType: !49, size: 88128, elements: !496)
!496 = !{!497}
!497 = !DISubrange(count: 1377)
!498 = !DILocation(line: 593, column: 14, scope: !381)
!499 = !DILocation(line: 596, column: 13, scope: !381)
!500 = !DILocation(line: 596, column: 16, scope: !381)
!501 = !DILocation(line: 596, column: 20, scope: !381)
!502 = !DILocation(line: 596, column: 30, scope: !381)
!503 = !DILocation(line: 596, column: 5, scope: !381)
!504 = !DILocation(line: 597, column: 17, scope: !381)
!505 = !DILocation(line: 597, column: 27, scope: !381)
!506 = !DILocation(line: 597, column: 33, scope: !381)
!507 = !DILocation(line: 597, column: 31, scope: !381)
!508 = !DILocation(line: 597, column: 54, scope: !381)
!509 = !DILocation(line: 597, column: 69, scope: !381)
!510 = !DILocation(line: 597, column: 68, scope: !381)
!511 = !DILocation(line: 597, column: 82, scope: !381)
!512 = !DILocation(line: 597, column: 5, scope: !381)
!513 = !DILabel(scope: !381, name: "err", file: !62, line: 600, column: 5)
!514 = !DILocation(line: 600, column: 5, scope: !381)
!515 = !DILocation(line: 602, column: 23, scope: !381)
!516 = !DILocation(line: 602, column: 5, scope: !381)
!517 = !DILocation(line: 603, column: 23, scope: !381)
!518 = !DILocation(line: 603, column: 42, scope: !381)
!519 = !DILocation(line: 603, column: 27, scope: !381)
!520 = !DILocation(line: 603, column: 44, scope: !381)
!521 = !DILocation(line: 603, column: 5, scope: !381)
!522 = !DILocation(line: 604, column: 23, scope: !381)
!523 = !DILocation(line: 604, column: 5, scope: !381)
!524 = !DILocation(line: 605, column: 12, scope: !381)
!525 = !DILocation(line: 605, column: 5, scope: !381)
!526 = distinct !DISubprogram(name: "decode", scope: !62, file: !62, line: 20, type: !527, scopeLine: 20, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !44, retainedNodes: !65)
!527 = !DISubroutineType(types: !528)
!528 = !{null, !98, !57, !83}
!529 = !DILocalVariable(name: "m", arg: 1, scope: !526, file: !62, line: 20, type: !98)
!530 = !DILocation(line: 20, column: 41, scope: !526)
!531 = !DILocalVariable(name: "mdec", arg: 2, scope: !526, file: !62, line: 20, type: !57)
!532 = !DILocation(line: 20, column: 59, scope: !526)
!533 = !DILocalVariable(name: "mdeclen", arg: 3, scope: !526, file: !62, line: 20, type: !83)
!534 = !DILocation(line: 20, column: 69, scope: !526)
!535 = !DILocalVariable(name: "i", scope: !526, file: !62, line: 21, type: !83)
!536 = !DILocation(line: 21, column: 9, scope: !526)
!537 = !DILocation(line: 22, column: 12, scope: !538)
!538 = distinct !DILexicalBlock(scope: !526, file: !62, line: 22, column: 5)
!539 = !DILocation(line: 22, column: 10, scope: !538)
!540 = !DILocation(line: 22, column: 17, scope: !541)
!541 = distinct !DILexicalBlock(scope: !538, file: !62, line: 22, column: 5)
!542 = !DILocation(line: 22, column: 21, scope: !541)
!543 = !DILocation(line: 22, column: 29, scope: !541)
!544 = !DILocation(line: 22, column: 19, scope: !541)
!545 = !DILocation(line: 22, column: 5, scope: !538)
!546 = !DILocation(line: 23, column: 19, scope: !547)
!547 = distinct !DILexicalBlock(scope: !541, file: !62, line: 22, column: 39)
!548 = !DILocation(line: 23, column: 21, scope: !547)
!549 = !DILocation(line: 23, column: 24, scope: !547)
!550 = !DILocation(line: 23, column: 14, scope: !547)
!551 = !DILocation(line: 23, column: 17, scope: !547)
!552 = !DILocation(line: 24, column: 19, scope: !547)
!553 = !DILocation(line: 24, column: 21, scope: !547)
!554 = !DILocation(line: 24, column: 24, scope: !547)
!555 = !DILocation(line: 24, column: 14, scope: !547)
!556 = !DILocation(line: 24, column: 17, scope: !547)
!557 = !DILocation(line: 25, column: 5, scope: !547)
!558 = !DILocation(line: 22, column: 34, scope: !541)
!559 = !DILocation(line: 22, column: 5, scope: !541)
!560 = distinct !{!560, !545, !561, !144}
!561 = !DILocation(line: 25, column: 5, scope: !538)
!562 = !DILocation(line: 27, column: 9, scope: !563)
!563 = distinct !DILexicalBlock(scope: !526, file: !62, line: 27, column: 9)
!564 = !DILocation(line: 27, column: 17, scope: !563)
!565 = !DILocation(line: 27, column: 21, scope: !563)
!566 = !DILocation(line: 28, column: 19, scope: !567)
!567 = distinct !DILexicalBlock(scope: !563, file: !62, line: 27, column: 27)
!568 = !DILocation(line: 28, column: 21, scope: !567)
!569 = !DILocation(line: 28, column: 24, scope: !567)
!570 = !DILocation(line: 28, column: 14, scope: !567)
!571 = !DILocation(line: 28, column: 17, scope: !567)
!572 = !DILocation(line: 29, column: 5, scope: !567)
!573 = !DILocation(line: 30, column: 1, scope: !526)
!574 = distinct !DISubprogram(name: "expand_P1_P2", scope: !62, file: !62, line: 280, type: !575, scopeLine: 280, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !44, retainedNodes: !65)
!575 = !DISubroutineType(types: !576)
!576 = !{null, !330, !48, !98}
!577 = !DILocalVariable(name: "p", arg: 1, scope: !574, file: !62, line: 280, type: !330)
!578 = !DILocation(line: 280, column: 47, scope: !574)
!579 = !DILocalVariable(name: "P", arg: 2, scope: !574, file: !62, line: 280, type: !48)
!580 = !DILocation(line: 280, column: 60, scope: !574)
!581 = !DILocalVariable(name: "seed_pk", arg: 3, scope: !574, file: !62, line: 280, type: !98)
!582 = !DILocation(line: 280, column: 84, scope: !574)
!583 = !DILocation(line: 284, column: 29, scope: !574)
!584 = !DILocation(line: 284, column: 47, scope: !574)
!585 = !DILocation(line: 284, column: 32, scope: !574)
!586 = !DILocation(line: 284, column: 67, scope: !574)
!587 = !DILocation(line: 284, column: 52, scope: !574)
!588 = !DILocation(line: 284, column: 50, scope: !574)
!589 = !DILocation(line: 284, column: 71, scope: !574)
!590 = !DILocation(line: 284, column: 100, scope: !574)
!591 = !DILocation(line: 284, column: 80, scope: !574)
!592 = !DILocation(line: 284, column: 5, scope: !574)
!593 = !DILocation(line: 285, column: 36, scope: !574)
!594 = !DILocation(line: 285, column: 39, scope: !574)
!595 = !DILocation(line: 285, column: 58, scope: !574)
!596 = !DILocation(line: 285, column: 43, scope: !574)
!597 = !DILocation(line: 285, column: 78, scope: !574)
!598 = !DILocation(line: 285, column: 63, scope: !574)
!599 = !DILocation(line: 285, column: 61, scope: !574)
!600 = !DILocation(line: 285, column: 100, scope: !574)
!601 = !DILocation(line: 285, column: 82, scope: !574)
!602 = !DILocation(line: 285, column: 81, scope: !574)
!603 = !DILocation(line: 285, column: 112, scope: !574)
!604 = !DILocation(line: 285, column: 104, scope: !574)
!605 = !DILocation(line: 285, column: 5, scope: !574)
!606 = !DILocation(line: 286, column: 1, scope: !574)
!607 = distinct !DISubprogram(name: "compute_P3", scope: !608, file: !608, line: 260, type: !609, scopeLine: 260, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !44, retainedNodes: !65)
!608 = !DIFile(filename: "../../../src/generic/generic_arithmetic.h", directory: "")
!609 = !DISubroutineType(types: !610)
!610 = !{null, !330, !611, !48, !98, !48}
!611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 32)
!612 = !DILocalVariable(name: "p", arg: 1, scope: !607, file: !608, line: 260, type: !330)
!613 = !DILocation(line: 260, column: 38, scope: !607)
!614 = !DILocalVariable(name: "P1", arg: 2, scope: !607, file: !608, line: 260, type: !611)
!615 = !DILocation(line: 260, column: 57, scope: !607)
!616 = !DILocalVariable(name: "P2", arg: 3, scope: !607, file: !608, line: 260, type: !48)
!617 = !DILocation(line: 260, column: 71, scope: !607)
!618 = !DILocalVariable(name: "O", arg: 4, scope: !607, file: !608, line: 260, type: !98)
!619 = !DILocation(line: 260, column: 96, scope: !607)
!620 = !DILocalVariable(name: "P3", arg: 5, scope: !607, file: !608, line: 260, type: !48)
!621 = !DILocation(line: 260, column: 109, scope: !607)
!622 = !DILocalVariable(name: "m_vec_limbs", scope: !607, file: !608, line: 262, type: !411)
!623 = !DILocation(line: 262, column: 15, scope: !607)
!624 = !DILocation(line: 262, column: 47, scope: !607)
!625 = !DILocation(line: 262, column: 29, scope: !607)
!626 = !DILocalVariable(name: "param_v", scope: !607, file: !608, line: 263, type: !411)
!627 = !DILocation(line: 263, column: 15, scope: !607)
!628 = !DILocation(line: 263, column: 33, scope: !607)
!629 = !DILocation(line: 263, column: 25, scope: !607)
!630 = !DILocalVariable(name: "param_o", scope: !607, file: !608, line: 264, type: !411)
!631 = !DILocation(line: 264, column: 15, scope: !607)
!632 = !DILocation(line: 264, column: 33, scope: !607)
!633 = !DILocation(line: 264, column: 25, scope: !607)
!634 = !DILocation(line: 267, column: 16, scope: !607)
!635 = !DILocation(line: 267, column: 19, scope: !607)
!636 = !DILocation(line: 267, column: 23, scope: !607)
!637 = !DILocation(line: 267, column: 26, scope: !607)
!638 = !DILocation(line: 267, column: 5, scope: !607)
!639 = !DILocation(line: 270, column: 31, scope: !607)
!640 = !DILocation(line: 270, column: 44, scope: !607)
!641 = !DILocation(line: 270, column: 47, scope: !607)
!642 = !DILocation(line: 270, column: 51, scope: !607)
!643 = !DILocation(line: 270, column: 55, scope: !607)
!644 = !DILocation(line: 270, column: 64, scope: !607)
!645 = !DILocation(line: 270, column: 73, scope: !607)
!646 = !DILocation(line: 270, column: 5, scope: !607)
!647 = !DILocation(line: 271, column: 1, scope: !607)
!648 = distinct !DISubprogram(name: "pack_m_vecs", scope: !62, file: !62, line: 272, type: !649, scopeLine: 272, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !44, retainedNodes: !65)
!649 = !DISubroutineType(types: !650)
!650 = !{null, !611, !57, !83, !83}
!651 = !DILocalVariable(name: "in", arg: 1, scope: !648, file: !62, line: 272, type: !611)
!652 = !DILocation(line: 272, column: 41, scope: !648)
!653 = !DILocalVariable(name: "out", arg: 2, scope: !648, file: !62, line: 272, type: !57)
!654 = !DILocation(line: 272, column: 60, scope: !648)
!655 = !DILocalVariable(name: "vecs", arg: 3, scope: !648, file: !62, line: 272, type: !83)
!656 = !DILocation(line: 272, column: 69, scope: !648)
!657 = !DILocalVariable(name: "m", arg: 4, scope: !648, file: !62, line: 272, type: !83)
!658 = !DILocation(line: 272, column: 79, scope: !648)
!659 = !DILocalVariable(name: "m_vec_limbs", scope: !648, file: !62, line: 273, type: !411)
!660 = !DILocation(line: 273, column: 15, scope: !648)
!661 = !DILocation(line: 273, column: 30, scope: !648)
!662 = !DILocation(line: 273, column: 32, scope: !648)
!663 = !DILocation(line: 273, column: 38, scope: !648)
!664 = !DILocalVariable(name: "_in", scope: !648, file: !62, line: 274, type: !57)
!665 = !DILocation(line: 274, column: 20, scope: !648)
!666 = !DILocation(line: 274, column: 44, scope: !648)
!667 = !DILocalVariable(name: "i", scope: !668, file: !62, line: 275, type: !83)
!668 = distinct !DILexicalBlock(scope: !648, file: !62, line: 275, column: 5)
!669 = !DILocation(line: 275, column: 14, scope: !668)
!670 = !DILocation(line: 275, column: 10, scope: !668)
!671 = !DILocation(line: 275, column: 21, scope: !672)
!672 = distinct !DILexicalBlock(scope: !668, file: !62, line: 275, column: 5)
!673 = !DILocation(line: 275, column: 25, scope: !672)
!674 = !DILocation(line: 275, column: 23, scope: !672)
!675 = !DILocation(line: 275, column: 5, scope: !668)
!676 = !DILocation(line: 277, column: 17, scope: !677)
!677 = distinct !DILexicalBlock(scope: !672, file: !62, line: 276, column: 5)
!678 = !DILocation(line: 277, column: 24, scope: !677)
!679 = !DILocation(line: 277, column: 26, scope: !677)
!680 = !DILocation(line: 277, column: 25, scope: !677)
!681 = !DILocation(line: 277, column: 27, scope: !677)
!682 = !DILocation(line: 277, column: 21, scope: !677)
!683 = !DILocation(line: 277, column: 32, scope: !677)
!684 = !DILocation(line: 277, column: 38, scope: !677)
!685 = !DILocation(line: 277, column: 40, scope: !677)
!686 = !DILocation(line: 277, column: 39, scope: !677)
!687 = !DILocation(line: 277, column: 51, scope: !677)
!688 = !DILocation(line: 277, column: 36, scope: !677)
!689 = !DILocation(line: 277, column: 70, scope: !677)
!690 = !DILocation(line: 277, column: 71, scope: !677)
!691 = !DILocation(line: 277, column: 9, scope: !677)
!692 = !DILocation(line: 278, column: 5, scope: !677)
!693 = !DILocation(line: 275, column: 32, scope: !672)
!694 = !DILocation(line: 275, column: 5, scope: !672)
!695 = distinct !{!695, !675, !696, !144}
!696 = !DILocation(line: 278, column: 5, scope: !668)
!697 = !DILocation(line: 279, column: 1, scope: !648)
!698 = distinct !DISubprogram(name: "P1_times_O", scope: !608, file: !608, line: 74, type: !699, scopeLine: 74, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !44, retainedNodes: !65)
!699 = !DISubroutineType(types: !700)
!700 = !{null, !330, !611, !98, !48}
!701 = !DILocalVariable(name: "p", arg: 1, scope: !698, file: !608, line: 74, type: !330)
!702 = !DILocation(line: 74, column: 38, scope: !698)
!703 = !DILocalVariable(name: "P1", arg: 2, scope: !698, file: !608, line: 74, type: !611)
!704 = !DILocation(line: 74, column: 57, scope: !698)
!705 = !DILocalVariable(name: "O", arg: 3, scope: !698, file: !608, line: 74, type: !98)
!706 = !DILocation(line: 74, column: 82, scope: !698)
!707 = !DILocalVariable(name: "acc", arg: 4, scope: !698, file: !608, line: 74, type: !48)
!708 = !DILocation(line: 74, column: 95, scope: !698)
!709 = !DILocation(line: 78, column: 60, scope: !698)
!710 = !DILocation(line: 78, column: 42, scope: !698)
!711 = !DILocation(line: 78, column: 64, scope: !698)
!712 = !DILocation(line: 78, column: 68, scope: !698)
!713 = !DILocation(line: 78, column: 71, scope: !698)
!714 = !DILocation(line: 78, column: 84, scope: !698)
!715 = !DILocation(line: 78, column: 76, scope: !698)
!716 = !DILocation(line: 78, column: 96, scope: !698)
!717 = !DILocation(line: 78, column: 88, scope: !698)
!718 = !DILocation(line: 78, column: 108, scope: !698)
!719 = !DILocation(line: 78, column: 100, scope: !698)
!720 = !DILocation(line: 78, column: 5, scope: !698)
!721 = !DILocation(line: 79, column: 1, scope: !698)
!722 = distinct !DISubprogram(name: "mul_add_mat_trans_x_m_mat", scope: !608, file: !608, line: 47, type: !723, scopeLine: 48, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !44, retainedNodes: !65)
!723 = !DISubroutineType(types: !724)
!724 = !{null, !411, !98, !611, !48, !411, !411, !411}
!725 = !DILocalVariable(name: "m_vec_limbs", arg: 1, scope: !722, file: !608, line: 47, type: !411)
!726 = !DILocation(line: 47, column: 42, scope: !722)
!727 = !DILocalVariable(name: "mat", arg: 2, scope: !722, file: !608, line: 47, type: !98)
!728 = !DILocation(line: 47, column: 76, scope: !722)
!729 = !DILocalVariable(name: "bs_mat", arg: 3, scope: !722, file: !608, line: 47, type: !611)
!730 = !DILocation(line: 47, column: 97, scope: !722)
!731 = !DILocalVariable(name: "acc", arg: 4, scope: !722, file: !608, line: 47, type: !48)
!732 = !DILocation(line: 47, column: 115, scope: !722)
!733 = !DILocalVariable(name: "mat_rows", arg: 5, scope: !722, file: !608, line: 48, type: !411)
!734 = !DILocation(line: 48, column: 42, scope: !722)
!735 = !DILocalVariable(name: "mat_cols", arg: 6, scope: !722, file: !608, line: 48, type: !411)
!736 = !DILocation(line: 48, column: 62, scope: !722)
!737 = !DILocalVariable(name: "bs_mat_cols", arg: 7, scope: !722, file: !608, line: 48, type: !411)
!738 = !DILocation(line: 48, column: 82, scope: !722)
!739 = !DILocalVariable(name: "r", scope: !740, file: !608, line: 50, type: !83)
!740 = distinct !DILexicalBlock(scope: !722, file: !608, line: 50, column: 5)
!741 = !DILocation(line: 50, column: 14, scope: !740)
!742 = !DILocation(line: 50, column: 10, scope: !740)
!743 = !DILocation(line: 50, column: 21, scope: !744)
!744 = distinct !DILexicalBlock(scope: !740, file: !608, line: 50, column: 5)
!745 = !DILocation(line: 50, column: 25, scope: !744)
!746 = !DILocation(line: 50, column: 23, scope: !744)
!747 = !DILocation(line: 50, column: 5, scope: !740)
!748 = !DILocalVariable(name: "c", scope: !749, file: !608, line: 51, type: !83)
!749 = distinct !DILexicalBlock(scope: !750, file: !608, line: 51, column: 9)
!750 = distinct !DILexicalBlock(scope: !744, file: !608, line: 50, column: 40)
!751 = !DILocation(line: 51, column: 18, scope: !749)
!752 = !DILocation(line: 51, column: 14, scope: !749)
!753 = !DILocation(line: 51, column: 25, scope: !754)
!754 = distinct !DILexicalBlock(scope: !749, file: !608, line: 51, column: 9)
!755 = !DILocation(line: 51, column: 29, scope: !754)
!756 = !DILocation(line: 51, column: 27, scope: !754)
!757 = !DILocation(line: 51, column: 9, scope: !749)
!758 = !DILocalVariable(name: "k", scope: !759, file: !608, line: 52, type: !83)
!759 = distinct !DILexicalBlock(scope: !760, file: !608, line: 52, column: 13)
!760 = distinct !DILexicalBlock(scope: !754, file: !608, line: 51, column: 44)
!761 = !DILocation(line: 52, column: 22, scope: !759)
!762 = !DILocation(line: 52, column: 18, scope: !759)
!763 = !DILocation(line: 52, column: 29, scope: !764)
!764 = distinct !DILexicalBlock(scope: !759, file: !608, line: 52, column: 13)
!765 = !DILocation(line: 52, column: 33, scope: !764)
!766 = !DILocation(line: 52, column: 31, scope: !764)
!767 = !DILocation(line: 52, column: 13, scope: !759)
!768 = !DILocation(line: 53, column: 31, scope: !769)
!769 = distinct !DILexicalBlock(scope: !764, file: !608, line: 52, column: 54)
!770 = !DILocation(line: 53, column: 44, scope: !769)
!771 = !DILocation(line: 53, column: 53, scope: !769)
!772 = !DILocation(line: 53, column: 68, scope: !769)
!773 = !DILocation(line: 53, column: 72, scope: !769)
!774 = !DILocation(line: 53, column: 70, scope: !769)
!775 = !DILocation(line: 53, column: 86, scope: !769)
!776 = !DILocation(line: 53, column: 84, scope: !769)
!777 = !DILocation(line: 53, column: 65, scope: !769)
!778 = !DILocation(line: 53, column: 51, scope: !769)
!779 = !DILocation(line: 53, column: 90, scope: !769)
!780 = !DILocation(line: 53, column: 94, scope: !769)
!781 = !DILocation(line: 53, column: 98, scope: !769)
!782 = !DILocation(line: 53, column: 96, scope: !769)
!783 = !DILocation(line: 53, column: 109, scope: !769)
!784 = !DILocation(line: 53, column: 107, scope: !769)
!785 = !DILocation(line: 53, column: 113, scope: !769)
!786 = !DILocation(line: 53, column: 119, scope: !769)
!787 = !DILocation(line: 53, column: 134, scope: !769)
!788 = !DILocation(line: 53, column: 138, scope: !769)
!789 = !DILocation(line: 53, column: 136, scope: !769)
!790 = !DILocation(line: 53, column: 152, scope: !769)
!791 = !DILocation(line: 53, column: 150, scope: !769)
!792 = !DILocation(line: 53, column: 131, scope: !769)
!793 = !DILocation(line: 53, column: 117, scope: !769)
!794 = !DILocation(line: 53, column: 17, scope: !769)
!795 = !DILocation(line: 54, column: 13, scope: !769)
!796 = !DILocation(line: 52, column: 48, scope: !764)
!797 = !DILocation(line: 52, column: 13, scope: !764)
!798 = distinct !{!798, !767, !799, !144}
!799 = !DILocation(line: 54, column: 13, scope: !759)
!800 = !DILocation(line: 55, column: 9, scope: !760)
!801 = !DILocation(line: 51, column: 40, scope: !754)
!802 = !DILocation(line: 51, column: 9, scope: !754)
!803 = distinct !{!803, !757, !804, !144}
!804 = !DILocation(line: 55, column: 9, scope: !749)
!805 = !DILocation(line: 56, column: 5, scope: !750)
!806 = !DILocation(line: 50, column: 36, scope: !744)
!807 = !DILocation(line: 50, column: 5, scope: !744)
!808 = distinct !{!808, !747, !809, !144}
!809 = !DILocation(line: 56, column: 5, scope: !740)
!810 = !DILocation(line: 57, column: 1, scope: !722)
!811 = distinct !DISubprogram(name: "m_vec_mul_add", scope: !812, file: !812, line: 24, type: !813, scopeLine: 24, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !44, retainedNodes: !65)
!812 = !DIFile(filename: "../../../src/generic/arithmetic_dynamic.h", directory: "")
!813 = !DISubroutineType(types: !814)
!814 = !{null, !83, !611, !47, !48}
!815 = !DILocalVariable(name: "m_vec_limbs", arg: 1, scope: !811, file: !812, line: 24, type: !83)
!816 = !DILocation(line: 24, column: 24, scope: !811)
!817 = !DILocalVariable(name: "in", arg: 2, scope: !811, file: !812, line: 24, type: !611)
!818 = !DILocation(line: 24, column: 53, scope: !811)
!819 = !DILocalVariable(name: "a", arg: 3, scope: !811, file: !812, line: 24, type: !47)
!820 = !DILocation(line: 24, column: 71, scope: !811)
!821 = !DILocalVariable(name: "acc", arg: 4, scope: !811, file: !812, line: 24, type: !48)
!822 = !DILocation(line: 24, column: 84, scope: !811)
!823 = !DILocalVariable(name: "i", scope: !824, file: !812, line: 25, type: !83)
!824 = distinct !DILexicalBlock(scope: !811, file: !812, line: 25, column: 5)
!825 = !DILocation(line: 25, column: 13, scope: !824)
!826 = !DILocation(line: 25, column: 9, scope: !824)
!827 = !DILocation(line: 25, column: 18, scope: !828)
!828 = distinct !DILexicalBlock(scope: !824, file: !812, line: 25, column: 5)
!829 = !DILocation(line: 25, column: 22, scope: !828)
!830 = !DILocation(line: 25, column: 20, scope: !828)
!831 = !DILocation(line: 25, column: 5, scope: !824)
!832 = !DILocation(line: 26, column: 33, scope: !833)
!833 = distinct !DILexicalBlock(scope: !828, file: !812, line: 25, column: 39)
!834 = !DILocation(line: 26, column: 36, scope: !833)
!835 = !DILocation(line: 26, column: 40, scope: !833)
!836 = !DILocation(line: 26, column: 19, scope: !833)
!837 = !DILocation(line: 26, column: 9, scope: !833)
!838 = !DILocation(line: 26, column: 13, scope: !833)
!839 = !DILocation(line: 26, column: 16, scope: !833)
!840 = !DILocation(line: 27, column: 5, scope: !833)
!841 = !DILocation(line: 25, column: 36, scope: !828)
!842 = !DILocation(line: 25, column: 5, scope: !828)
!843 = distinct !{!843, !831, !844, !144}
!844 = !DILocation(line: 27, column: 5, scope: !824)
!845 = !DILocation(line: 28, column: 1, scope: !811)
!846 = distinct !DISubprogram(name: "gf16v_mul_u64", scope: !847, file: !847, line: 96, type: !848, scopeLine: 96, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !44, retainedNodes: !65)
!847 = !DIFile(filename: "../../../src/simple_arithmetic.h", directory: "")
!848 = !DISubroutineType(types: !849)
!849 = !{!49, !49, !183}
!850 = !DILocalVariable(name: "a", arg: 1, scope: !846, file: !847, line: 96, type: !49)
!851 = !DILocation(line: 96, column: 48, scope: !846)
!852 = !DILocalVariable(name: "b", arg: 2, scope: !846, file: !847, line: 96, type: !183)
!853 = !DILocation(line: 96, column: 59, scope: !846)
!854 = !DILocalVariable(name: "mask_msb", scope: !846, file: !847, line: 97, type: !49)
!855 = !DILocation(line: 97, column: 14, scope: !846)
!856 = !DILocalVariable(name: "a_msb", scope: !846, file: !847, line: 98, type: !49)
!857 = !DILocation(line: 98, column: 14, scope: !846)
!858 = !DILocalVariable(name: "a64", scope: !846, file: !847, line: 99, type: !49)
!859 = !DILocation(line: 99, column: 14, scope: !846)
!860 = !DILocation(line: 99, column: 20, scope: !846)
!861 = !DILocalVariable(name: "b32", scope: !846, file: !847, line: 101, type: !49)
!862 = !DILocation(line: 101, column: 14, scope: !846)
!863 = !DILocation(line: 101, column: 20, scope: !846)
!864 = !DILocation(line: 101, column: 24, scope: !846)
!865 = !DILocation(line: 101, column: 22, scope: !846)
!866 = !DILocalVariable(name: "r64", scope: !846, file: !847, line: 105, type: !49)
!867 = !DILocation(line: 105, column: 14, scope: !846)
!868 = !DILocation(line: 105, column: 20, scope: !846)
!869 = !DILocation(line: 105, column: 27, scope: !846)
!870 = !DILocation(line: 105, column: 31, scope: !846)
!871 = !DILocation(line: 105, column: 24, scope: !846)
!872 = !DILocation(line: 107, column: 13, scope: !846)
!873 = !DILocation(line: 107, column: 19, scope: !846)
!874 = !DILocation(line: 107, column: 17, scope: !846)
!875 = !DILocation(line: 107, column: 11, scope: !846)
!876 = !DILocation(line: 108, column: 12, scope: !846)
!877 = !DILocation(line: 108, column: 9, scope: !846)
!878 = !DILocation(line: 109, column: 12, scope: !846)
!879 = !DILocation(line: 109, column: 16, scope: !846)
!880 = !DILocation(line: 109, column: 26, scope: !846)
!881 = !DILocation(line: 109, column: 32, scope: !846)
!882 = !DILocation(line: 109, column: 38, scope: !846)
!883 = !DILocation(line: 109, column: 22, scope: !846)
!884 = !DILocation(line: 109, column: 9, scope: !846)
!885 = !DILocation(line: 110, column: 13, scope: !846)
!886 = !DILocation(line: 110, column: 22, scope: !846)
!887 = !DILocation(line: 110, column: 26, scope: !846)
!888 = !DILocation(line: 110, column: 32, scope: !846)
!889 = !DILocation(line: 110, column: 18, scope: !846)
!890 = !DILocation(line: 110, column: 9, scope: !846)
!891 = !DILocation(line: 112, column: 13, scope: !846)
!892 = !DILocation(line: 112, column: 19, scope: !846)
!893 = !DILocation(line: 112, column: 17, scope: !846)
!894 = !DILocation(line: 112, column: 11, scope: !846)
!895 = !DILocation(line: 113, column: 12, scope: !846)
!896 = !DILocation(line: 113, column: 9, scope: !846)
!897 = !DILocation(line: 114, column: 12, scope: !846)
!898 = !DILocation(line: 114, column: 16, scope: !846)
!899 = !DILocation(line: 114, column: 26, scope: !846)
!900 = !DILocation(line: 114, column: 32, scope: !846)
!901 = !DILocation(line: 114, column: 38, scope: !846)
!902 = !DILocation(line: 114, column: 22, scope: !846)
!903 = !DILocation(line: 114, column: 9, scope: !846)
!904 = !DILocation(line: 115, column: 13, scope: !846)
!905 = !DILocation(line: 115, column: 22, scope: !846)
!906 = !DILocation(line: 115, column: 26, scope: !846)
!907 = !DILocation(line: 115, column: 32, scope: !846)
!908 = !DILocation(line: 115, column: 18, scope: !846)
!909 = !DILocation(line: 115, column: 9, scope: !846)
!910 = !DILocation(line: 117, column: 13, scope: !846)
!911 = !DILocation(line: 117, column: 19, scope: !846)
!912 = !DILocation(line: 117, column: 17, scope: !846)
!913 = !DILocation(line: 117, column: 11, scope: !846)
!914 = !DILocation(line: 118, column: 12, scope: !846)
!915 = !DILocation(line: 118, column: 9, scope: !846)
!916 = !DILocation(line: 119, column: 12, scope: !846)
!917 = !DILocation(line: 119, column: 16, scope: !846)
!918 = !DILocation(line: 119, column: 26, scope: !846)
!919 = !DILocation(line: 119, column: 32, scope: !846)
!920 = !DILocation(line: 119, column: 38, scope: !846)
!921 = !DILocation(line: 119, column: 22, scope: !846)
!922 = !DILocation(line: 119, column: 9, scope: !846)
!923 = !DILocation(line: 120, column: 13, scope: !846)
!924 = !DILocation(line: 120, column: 22, scope: !846)
!925 = !DILocation(line: 120, column: 26, scope: !846)
!926 = !DILocation(line: 120, column: 32, scope: !846)
!927 = !DILocation(line: 120, column: 18, scope: !846)
!928 = !DILocation(line: 120, column: 9, scope: !846)
!929 = !DILocation(line: 122, column: 12, scope: !846)
!930 = !DILocation(line: 122, column: 5, scope: !846)
!931 = distinct !DISubprogram(name: "mul_add_m_upper_triangular_mat_x_mat", scope: !608, file: !608, line: 16, type: !932, scopeLine: 17, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !44, retainedNodes: !65)
!932 = !DISubroutineType(types: !933)
!933 = !{null, !411, !611, !98, !48, !411, !411, !411, !411}
!934 = !DILocalVariable(name: "m_vec_limbs", arg: 1, scope: !931, file: !608, line: 16, type: !411)
!935 = !DILocation(line: 16, column: 53, scope: !931)
!936 = !DILocalVariable(name: "bs_mat", arg: 2, scope: !931, file: !608, line: 16, type: !611)
!937 = !DILocation(line: 16, column: 82, scope: !931)
!938 = !DILocalVariable(name: "mat", arg: 3, scope: !931, file: !608, line: 16, type: !98)
!939 = !DILocation(line: 16, column: 111, scope: !931)
!940 = !DILocalVariable(name: "acc", arg: 4, scope: !931, file: !608, line: 16, type: !48)
!941 = !DILocation(line: 16, column: 126, scope: !931)
!942 = !DILocalVariable(name: "bs_mat_rows", arg: 5, scope: !931, file: !608, line: 17, type: !411)
!943 = !DILocation(line: 17, column: 53, scope: !931)
!944 = !DILocalVariable(name: "bs_mat_cols", arg: 6, scope: !931, file: !608, line: 17, type: !411)
!945 = !DILocation(line: 17, column: 76, scope: !931)
!946 = !DILocalVariable(name: "mat_cols", arg: 7, scope: !931, file: !608, line: 17, type: !411)
!947 = !DILocation(line: 17, column: 99, scope: !931)
!948 = !DILocalVariable(name: "triangular", arg: 8, scope: !931, file: !608, line: 17, type: !411)
!949 = !DILocation(line: 17, column: 119, scope: !931)
!950 = !DILocalVariable(name: "bs_mat_entries_used", scope: !931, file: !608, line: 19, type: !83)
!951 = !DILocation(line: 19, column: 9, scope: !931)
!952 = !DILocalVariable(name: "r", scope: !953, file: !608, line: 20, type: !83)
!953 = distinct !DILexicalBlock(scope: !931, file: !608, line: 20, column: 5)
!954 = !DILocation(line: 20, column: 14, scope: !953)
!955 = !DILocation(line: 20, column: 10, scope: !953)
!956 = !DILocation(line: 20, column: 21, scope: !957)
!957 = distinct !DILexicalBlock(scope: !953, file: !608, line: 20, column: 5)
!958 = !DILocation(line: 20, column: 25, scope: !957)
!959 = !DILocation(line: 20, column: 23, scope: !957)
!960 = !DILocation(line: 20, column: 5, scope: !953)
!961 = !DILocalVariable(name: "c", scope: !962, file: !608, line: 21, type: !83)
!962 = distinct !DILexicalBlock(scope: !963, file: !608, line: 21, column: 9)
!963 = distinct !DILexicalBlock(scope: !957, file: !608, line: 20, column: 43)
!964 = !DILocation(line: 21, column: 18, scope: !962)
!965 = !DILocation(line: 21, column: 22, scope: !962)
!966 = !DILocation(line: 21, column: 35, scope: !962)
!967 = !DILocation(line: 21, column: 33, scope: !962)
!968 = !DILocation(line: 21, column: 14, scope: !962)
!969 = !DILocation(line: 21, column: 38, scope: !970)
!970 = distinct !DILexicalBlock(scope: !962, file: !608, line: 21, column: 9)
!971 = !DILocation(line: 21, column: 42, scope: !970)
!972 = !DILocation(line: 21, column: 40, scope: !970)
!973 = !DILocation(line: 21, column: 9, scope: !962)
!974 = !DILocalVariable(name: "k", scope: !975, file: !608, line: 22, type: !83)
!975 = distinct !DILexicalBlock(scope: !976, file: !608, line: 22, column: 13)
!976 = distinct !DILexicalBlock(scope: !970, file: !608, line: 21, column: 60)
!977 = !DILocation(line: 22, column: 22, scope: !975)
!978 = !DILocation(line: 22, column: 18, scope: !975)
!979 = !DILocation(line: 22, column: 29, scope: !980)
!980 = distinct !DILexicalBlock(scope: !975, file: !608, line: 22, column: 13)
!981 = !DILocation(line: 22, column: 33, scope: !980)
!982 = !DILocation(line: 22, column: 31, scope: !980)
!983 = !DILocation(line: 22, column: 13, scope: !975)
!984 = !DILocation(line: 23, column: 31, scope: !985)
!985 = distinct !DILexicalBlock(scope: !980, file: !608, line: 22, column: 51)
!986 = !DILocation(line: 23, column: 44, scope: !985)
!987 = !DILocation(line: 23, column: 53, scope: !985)
!988 = !DILocation(line: 23, column: 67, scope: !985)
!989 = !DILocation(line: 23, column: 65, scope: !985)
!990 = !DILocation(line: 23, column: 51, scope: !985)
!991 = !DILocation(line: 23, column: 88, scope: !985)
!992 = !DILocation(line: 23, column: 92, scope: !985)
!993 = !DILocation(line: 23, column: 96, scope: !985)
!994 = !DILocation(line: 23, column: 94, scope: !985)
!995 = !DILocation(line: 23, column: 107, scope: !985)
!996 = !DILocation(line: 23, column: 105, scope: !985)
!997 = !DILocation(line: 23, column: 111, scope: !985)
!998 = !DILocation(line: 23, column: 117, scope: !985)
!999 = !DILocation(line: 23, column: 132, scope: !985)
!1000 = !DILocation(line: 23, column: 136, scope: !985)
!1001 = !DILocation(line: 23, column: 134, scope: !985)
!1002 = !DILocation(line: 23, column: 147, scope: !985)
!1003 = !DILocation(line: 23, column: 145, scope: !985)
!1004 = !DILocation(line: 23, column: 129, scope: !985)
!1005 = !DILocation(line: 23, column: 115, scope: !985)
!1006 = !DILocation(line: 23, column: 17, scope: !985)
!1007 = !DILocation(line: 24, column: 13, scope: !985)
!1008 = !DILocation(line: 22, column: 45, scope: !980)
!1009 = !DILocation(line: 22, column: 13, scope: !980)
!1010 = distinct !{!1010, !983, !1011, !144}
!1011 = !DILocation(line: 24, column: 13, scope: !975)
!1012 = !DILocation(line: 25, column: 33, scope: !976)
!1013 = !DILocation(line: 26, column: 9, scope: !976)
!1014 = !DILocation(line: 21, column: 56, scope: !970)
!1015 = !DILocation(line: 21, column: 9, scope: !970)
!1016 = distinct !{!1016, !973, !1017, !144}
!1017 = !DILocation(line: 26, column: 9, scope: !962)
!1018 = !DILocation(line: 27, column: 5, scope: !963)
!1019 = !DILocation(line: 20, column: 39, scope: !957)
!1020 = !DILocation(line: 20, column: 5, scope: !957)
!1021 = distinct !{!1021, !960, !1022, !144}
!1022 = !DILocation(line: 27, column: 5, scope: !953)
!1023 = !DILocation(line: 28, column: 1, scope: !931)
!1024 = distinct !DISubprogram(name: "unpack_m_vecs", scope: !62, file: !62, line: 262, type: !1025, scopeLine: 262, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !44, retainedNodes: !65)
!1025 = !DISubroutineType(types: !1026)
!1026 = !{null, !98, !48, !83, !83}
!1027 = !DILocalVariable(name: "in", arg: 1, scope: !1024, file: !62, line: 262, type: !98)
!1028 = !DILocation(line: 262, column: 48, scope: !1024)
!1029 = !DILocalVariable(name: "out", arg: 2, scope: !1024, file: !62, line: 262, type: !48)
!1030 = !DILocation(line: 262, column: 62, scope: !1024)
!1031 = !DILocalVariable(name: "vecs", arg: 3, scope: !1024, file: !62, line: 262, type: !83)
!1032 = !DILocation(line: 262, column: 71, scope: !1024)
!1033 = !DILocalVariable(name: "m", arg: 4, scope: !1024, file: !62, line: 262, type: !83)
!1034 = !DILocation(line: 262, column: 81, scope: !1024)
!1035 = !DILocalVariable(name: "m_vec_limbs", scope: !1024, file: !62, line: 263, type: !411)
!1036 = !DILocation(line: 263, column: 15, scope: !1024)
!1037 = !DILocation(line: 263, column: 30, scope: !1024)
!1038 = !DILocation(line: 263, column: 32, scope: !1024)
!1039 = !DILocation(line: 263, column: 38, scope: !1024)
!1040 = !DILocalVariable(name: "_out", scope: !1024, file: !62, line: 264, type: !57)
!1041 = !DILocation(line: 264, column: 20, scope: !1024)
!1042 = !DILocation(line: 264, column: 45, scope: !1024)
!1043 = !DILocalVariable(name: "tmp", scope: !1024, file: !62, line: 265, type: !1044)
!1044 = !DICompositeType(tag: DW_TAG_array_type, baseType: !49, size: 576, elements: !1045)
!1045 = !{!1046}
!1046 = !DISubrange(count: 9)
!1047 = !DILocation(line: 265, column: 14, scope: !1024)
!1048 = !DILocalVariable(name: "i", scope: !1049, file: !62, line: 266, type: !83)
!1049 = distinct !DILexicalBlock(scope: !1024, file: !62, line: 266, column: 5)
!1050 = !DILocation(line: 266, column: 14, scope: !1049)
!1051 = !DILocation(line: 266, column: 18, scope: !1049)
!1052 = !DILocation(line: 266, column: 22, scope: !1049)
!1053 = !DILocation(line: 266, column: 10, scope: !1049)
!1054 = !DILocation(line: 266, column: 26, scope: !1055)
!1055 = distinct !DILexicalBlock(scope: !1049, file: !62, line: 266, column: 5)
!1056 = !DILocation(line: 266, column: 28, scope: !1055)
!1057 = !DILocation(line: 266, column: 5, scope: !1049)
!1058 = !DILocation(line: 268, column: 16, scope: !1059)
!1059 = distinct !DILexicalBlock(scope: !1055, file: !62, line: 267, column: 5)
!1060 = !DILocation(line: 268, column: 21, scope: !1059)
!1061 = !DILocation(line: 268, column: 26, scope: !1059)
!1062 = !DILocation(line: 268, column: 28, scope: !1059)
!1063 = !DILocation(line: 268, column: 27, scope: !1059)
!1064 = !DILocation(line: 268, column: 29, scope: !1059)
!1065 = !DILocation(line: 268, column: 24, scope: !1059)
!1066 = !DILocation(line: 268, column: 33, scope: !1059)
!1067 = !DILocation(line: 268, column: 34, scope: !1059)
!1068 = !DILocation(line: 268, column: 9, scope: !1059)
!1069 = !DILocation(line: 269, column: 16, scope: !1059)
!1070 = !DILocation(line: 269, column: 23, scope: !1059)
!1071 = !DILocation(line: 269, column: 25, scope: !1059)
!1072 = !DILocation(line: 269, column: 24, scope: !1059)
!1073 = !DILocation(line: 269, column: 36, scope: !1059)
!1074 = !DILocation(line: 269, column: 21, scope: !1059)
!1075 = !DILocation(line: 269, column: 55, scope: !1059)
!1076 = !DILocation(line: 269, column: 60, scope: !1059)
!1077 = !DILocation(line: 269, column: 71, scope: !1059)
!1078 = !DILocation(line: 269, column: 9, scope: !1059)
!1079 = !DILocation(line: 270, column: 5, scope: !1059)
!1080 = !DILocation(line: 266, column: 35, scope: !1055)
!1081 = !DILocation(line: 266, column: 5, scope: !1055)
!1082 = distinct !{!1082, !1057, !1083, !144}
!1083 = !DILocation(line: 270, column: 5, scope: !1049)
!1084 = !DILocation(line: 271, column: 1, scope: !1024)
!1085 = distinct !DISubprogram(name: "mayo_expand_sk", scope: !62, file: !62, line: 310, type: !1086, scopeLine: 311, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !65)
!1086 = !DISubroutineType(types: !1087)
!1087 = !{!83, !330, !98, !1088}
!1088 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1089, size: 32)
!1089 = !DIDerivedType(tag: DW_TAG_typedef, name: "sk_t", file: !89, line: 294, baseType: !1090)
!1090 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sk_t", file: !89, line: 291, size: 7257920, elements: !1091)
!1091 = !{!1092, !1093}
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !1090, file: !89, line: 292, baseType: !178, size: 7238592)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "O", scope: !1090, file: !89, line: 293, baseType: !182, size: 19312, offset: 7238592)
!1094 = !DILocalVariable(name: "p", arg: 1, scope: !1085, file: !62, line: 310, type: !330)
!1095 = !DILocation(line: 310, column: 41, scope: !1085)
!1096 = !DILocalVariable(name: "csk", arg: 2, scope: !1085, file: !62, line: 310, type: !98)
!1097 = !DILocation(line: 310, column: 65, scope: !1085)
!1098 = !DILocalVariable(name: "sk", arg: 3, scope: !1085, file: !62, line: 311, type: !1088)
!1099 = !DILocation(line: 311, column: 26, scope: !1085)
!1100 = !DILocalVariable(name: "ret", scope: !1085, file: !62, line: 312, type: !83)
!1101 = !DILocation(line: 312, column: 9, scope: !1085)
!1102 = !DILocalVariable(name: "S", scope: !1085, file: !62, line: 313, type: !394)
!1103 = !DILocation(line: 313, column: 19, scope: !1085)
!1104 = !DILocalVariable(name: "P", scope: !1085, file: !62, line: 314, type: !48)
!1105 = !DILocation(line: 314, column: 15, scope: !1085)
!1106 = !DILocation(line: 314, column: 19, scope: !1085)
!1107 = !DILocation(line: 314, column: 23, scope: !1085)
!1108 = !DILocalVariable(name: "O", scope: !1085, file: !62, line: 315, type: !57)
!1109 = !DILocation(line: 315, column: 20, scope: !1085)
!1110 = !DILocation(line: 315, column: 24, scope: !1085)
!1111 = !DILocation(line: 315, column: 28, scope: !1085)
!1112 = !DILocalVariable(name: "param_o", scope: !1085, file: !62, line: 317, type: !411)
!1113 = !DILocation(line: 317, column: 15, scope: !1085)
!1114 = !DILocation(line: 317, column: 33, scope: !1085)
!1115 = !DILocation(line: 317, column: 25, scope: !1085)
!1116 = !DILocalVariable(name: "param_v", scope: !1085, file: !62, line: 318, type: !411)
!1117 = !DILocation(line: 318, column: 15, scope: !1085)
!1118 = !DILocation(line: 318, column: 33, scope: !1085)
!1119 = !DILocation(line: 318, column: 25, scope: !1085)
!1120 = !DILocalVariable(name: "param_O_bytes", scope: !1085, file: !62, line: 319, type: !411)
!1121 = !DILocation(line: 319, column: 15, scope: !1085)
!1122 = !DILocation(line: 319, column: 45, scope: !1085)
!1123 = !DILocation(line: 319, column: 31, scope: !1085)
!1124 = !DILocalVariable(name: "param_pk_seed_bytes", scope: !1085, file: !62, line: 320, type: !411)
!1125 = !DILocation(line: 320, column: 15, scope: !1085)
!1126 = !DILocation(line: 320, column: 57, scope: !1085)
!1127 = !DILocation(line: 320, column: 37, scope: !1085)
!1128 = !DILocalVariable(name: "param_sk_seed_bytes", scope: !1085, file: !62, line: 321, type: !411)
!1129 = !DILocation(line: 321, column: 15, scope: !1085)
!1130 = !DILocation(line: 321, column: 57, scope: !1085)
!1131 = !DILocation(line: 321, column: 37, scope: !1085)
!1132 = !DILocalVariable(name: "seed_sk", scope: !1085, file: !62, line: 323, type: !98)
!1133 = !DILocation(line: 323, column: 26, scope: !1085)
!1134 = !DILocation(line: 323, column: 36, scope: !1085)
!1135 = !DILocalVariable(name: "seed_pk", scope: !1085, file: !62, line: 324, type: !57)
!1136 = !DILocation(line: 324, column: 20, scope: !1085)
!1137 = !DILocation(line: 324, column: 30, scope: !1085)
!1138 = !DILocation(line: 326, column: 14, scope: !1085)
!1139 = !DILocation(line: 326, column: 17, scope: !1085)
!1140 = !DILocation(line: 326, column: 39, scope: !1085)
!1141 = !DILocation(line: 326, column: 37, scope: !1085)
!1142 = !DILocation(line: 326, column: 54, scope: !1085)
!1143 = !DILocation(line: 327, column: 14, scope: !1085)
!1144 = !DILocation(line: 326, column: 5, scope: !1085)
!1145 = !DILocation(line: 328, column: 12, scope: !1085)
!1146 = !DILocation(line: 328, column: 16, scope: !1085)
!1147 = !DILocation(line: 328, column: 14, scope: !1085)
!1148 = !DILocation(line: 328, column: 37, scope: !1085)
!1149 = !DILocation(line: 328, column: 40, scope: !1085)
!1150 = !DILocation(line: 328, column: 50, scope: !1085)
!1151 = !DILocation(line: 328, column: 48, scope: !1085)
!1152 = !DILocation(line: 328, column: 5, scope: !1085)
!1153 = !DILocation(line: 334, column: 18, scope: !1085)
