; ModuleID = 'composite'
source_filename = "composite"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "arm-unknown-none-eabi"

%struct.mayo_params_t = type { i32, i32, i32, i32, i32, ptr, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, ptr }
%struct.sk_t = type { [113103 x i64], [2414 x i8] }

@MAYO_1 = external dso_local constant %struct.mayo_params_t, align 4
@MAYO_2 = external dso_local constant %struct.mayo_params_t, align 4
@MAYO_3 = external dso_local constant %struct.mayo_params_t, align 4
@MAYO_5 = external dso_local constant %struct.mayo_params_t, align 4
@__const.main.params = private unnamed_addr constant [4 x ptr] [ptr @MAYO_1, ptr @MAYO_2, ptr @MAYO_3, ptr @MAYO_5], align 4
@__const.example_mayo.msg = private unnamed_addr constant <{ i8, [31 x i8] }> <{ i8 14, [31 x i8] zeroinitializer }>, align 1
@.str = private unnamed_addr constant [17 x i8] c"Example with %s\0A\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [17 x i8] c"mayo_keypair -> \00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [6 x i8] c"FAIL\0A\00", align 1, !dbg !9
@.str.3 = private unnamed_addr constant [4 x i8] c"OK\0A\00", align 1, !dbg !14
@.str.4 = private unnamed_addr constant [19 x i8] c"mayo_expand_sk -> \00", align 1, !dbg !19
@.str.5 = private unnamed_addr constant [19 x i8] c"mayo_expand_pk -> \00", align 1, !dbg !24

!24 = !DIGlobalVariableExpression(var: !25, expr: !DIExpression())
!25 = distinct !DIGlobalVariable(scope: null, file: !2, line: 63, type: !21, isLocal: true, isDefinition: true)
!26 = !DIGlobalVariableExpression(var: !27, expr: !DIExpression())
!27 = distinct !DIGlobalVariable(scope: null, file: !2, line: 73, type: !28, isLocal: true, isDefinition: true)
!28 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 112, elements: !29)
!29 = !{!30}
!30 = !DISubrange(count: 14)
!31 = !DIGlobalVariableExpression(var: !32, expr: !DIExpression())
!32 = distinct !DIGlobalVariable(scope: null, file: !2, line: 83, type: !33, isLocal: true, isDefinition: true)
!33 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 312, elements: !34)
!34 = !{!35}
!35 = !DISubrange(count: 39)
!36 = !DIGlobalVariableExpression(var: !37, expr: !DIExpression())
!37 = distinct !DIGlobalVariable(scope: null, file: !2, line: 94, type: !38, isLocal: true, isDefinition: true)
!38 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 328, elements: !39)
!39 = !{!40}
!40 = !DISubrange(count: 41)
!41 = !DIGlobalVariableExpression(var: !42, expr: !DIExpression())
!42 = distinct !DIGlobalVariable(scope: null, file: !2, line: 105, type: !33, isLocal: true, isDefinition: true)
!43 = !DIGlobalVariableExpression(var: !44, expr: !DIExpression())
!44 = distinct !DIGlobalVariable(scope: null, file: !2, line: 118, type: !38, isLocal: true, isDefinition: true)
!45 = distinct !DICompileUnit(language: DW_LANG_C11, file: !46, producer: "clang version 23.0.0git (https://github.com/llvm/llvm-project.git a07347f60997b971314563c7427aff5153677d95)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, globals: !47, splitDebugInlining: false, nameTableKind: None)
!46 = !DIFile(filename: "../<stdin>", directory: "")
!47 = !{!0, !7, !9, !14, !19, !24, !26, !31, !36, !41, !43}
!48 = distinct !DICompileUnit(language: DW_LANG_C11, file: !49, producer: "clang version 23.0.0git (https://github.com/llvm/llvm-project.git a07347f60997b971314563c7427aff5153677d95)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !50, globals: !62, splitDebugInlining: false, nameTableKind: None)
!49 = !DIFile(filename: "../../src/<stdin>", directory: "")
!50 = !{!51, !52, !58, !61}
!51 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 32)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !54, line: 60, baseType: !55)
!54 = !DIFile(filename: "/usr/lib/arm-none-eabi/include/sys/_stdint.h", directory: "")
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !56, line: 105, baseType: !57)
!56 = !DIFile(filename: "/usr/lib/arm-none-eabi/include/machine/_default_types.h", directory: "")
!57 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !59, line: 214, baseType: !60)
!59 = !DIFile(filename: "/usr/lib/gcc/arm-none-eabi/13.2.1/include/stddef.h", directory: "")
!60 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 32)
!62 = !{!63, !71, !73, !75}
!63 = !DIGlobalVariableExpression(var: !64, expr: !DIExpression())
!64 = distinct !DIGlobalVariable(name: "even_nibbles", scope: !65, file: !66, line: 112, type: !70, isLocal: true, isDefinition: true)
!65 = distinct !DISubprogram(name: "transpose_16x16_nibbles", scope: !66, file: !66, line: 111, type: !67, scopeLine: 111, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !48, retainedNodes: !69)
!66 = !DIFile(filename: "../../src/mayo.c", directory: "")
!67 = !DISubroutineType(types: !68)
!68 = !{null, !52}
!69 = !{}
!70 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !53)
!71 = !DIGlobalVariableExpression(var: !72, expr: !DIExpression())
!72 = distinct !DIGlobalVariable(name: "even_bytes", scope: !65, file: !66, line: 113, type: !70, isLocal: true, isDefinition: true)
!73 = !DIGlobalVariableExpression(var: !74, expr: !DIExpression())
!74 = distinct !DIGlobalVariable(name: "even_2bytes", scope: !65, file: !66, line: 114, type: !70, isLocal: true, isDefinition: true)
!75 = !DIGlobalVariableExpression(var: !76, expr: !DIExpression())
!76 = distinct !DIGlobalVariable(name: "even_half", scope: !65, file: !66, line: 115, type: !70, isLocal: true, isDefinition: true)
!77 = !{!"clang version 23.0.0git (https://github.com/llvm/llvm-project.git a07347f60997b971314563c7427aff5153677d95)"}
!78 = !{i32 2, !"Debug Info Version", i32 3}
!79 = !{i32 1, !"wchar_size", i32 4}
!80 = !{i32 1, !"min_enum_size", i32 4}
!81 = !{i32 4, !"arm-eabi-fp-denormal", i32 1}
!82 = !{i32 8, !"arm-eabi-fp-number-model", i32 3}
!83 = !{i32 1, !"Code Model", i32 1}
!84 = distinct !DISubprogram(name: "main", scope: !2, file: !2, line: 138, type: !85, scopeLine: 138, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !45, retainedNodes: !69)
!85 = !DISubroutineType(types: !86)
!86 = !{!87}
!87 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!88 = !DILocalVariable(name: "params", scope: !84, file: !2, line: 140, type: !89)
!89 = !DICompositeType(tag: DW_TAG_array_type, baseType: !90, size: 128, elements: !17)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 32)
!91 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !92)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "mayo_params_t", file: !93, line: 289, baseType: !94)
!93 = !DIFile(filename: "../../include/mayo.h", directory: "")
!94 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !93, line: 265, size: 736, elements: !95)
!95 = !{!96, !97, !98, !99, !100, !101, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !94, file: !93, line: 266, baseType: !87, size: 32)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !94, file: !93, line: 267, baseType: !87, size: 32, offset: 32)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "o", scope: !94, file: !93, line: 268, baseType: !87, size: 32, offset: 64)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "k", scope: !94, file: !93, line: 269, baseType: !87, size: 32, offset: 96)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !94, file: !93, line: 270, baseType: !87, size: 32, offset: 128)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "f_tail", scope: !94, file: !93, line: 271, baseType: !102, size: 32, offset: 160)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 32)
!103 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !51)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "m_bytes", scope: !94, file: !93, line: 272, baseType: !87, size: 32, offset: 192)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "O_bytes", scope: !94, file: !93, line: 273, baseType: !87, size: 32, offset: 224)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "v_bytes", scope: !94, file: !93, line: 274, baseType: !87, size: 32, offset: 256)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "r_bytes", scope: !94, file: !93, line: 275, baseType: !87, size: 32, offset: 288)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "R_bytes", scope: !94, file: !93, line: 276, baseType: !87, size: 32, offset: 320)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "P1_bytes", scope: !94, file: !93, line: 277, baseType: !87, size: 32, offset: 352)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "P2_bytes", scope: !94, file: !93, line: 278, baseType: !87, size: 32, offset: 384)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "P3_bytes", scope: !94, file: !93, line: 279, baseType: !87, size: 32, offset: 416)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "csk_bytes", scope: !94, file: !93, line: 280, baseType: !87, size: 32, offset: 448)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "cpk_bytes", scope: !94, file: !93, line: 281, baseType: !87, size: 32, offset: 480)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "sig_bytes", scope: !94, file: !93, line: 282, baseType: !87, size: 32, offset: 512)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "salt_bytes", scope: !94, file: !93, line: 283, baseType: !87, size: 32, offset: 544)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "sk_seed_bytes", scope: !94, file: !93, line: 284, baseType: !87, size: 32, offset: 576)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "digest_bytes", scope: !94, file: !93, line: 285, baseType: !87, size: 32, offset: 608)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "pk_seed_bytes", scope: !94, file: !93, line: 286, baseType: !87, size: 32, offset: 640)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "m_vec_limbs", scope: !94, file: !93, line: 287, baseType: !87, size: 32, offset: 672)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !94, file: !93, line: 288, baseType: !121, size: 32, offset: 704)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 32)
!122 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!123 = !DILocation(line: 140, column: 26, scope: !84)
!124 = !DILocalVariable(name: "paramslen", scope: !84, file: !2, line: 141, type: !87)
!125 = !DILocation(line: 141, column: 9, scope: !84)
!126 = !DILocalVariable(name: "i", scope: !127, file: !2, line: 142, type: !87)
!127 = distinct !DILexicalBlock(scope: !84, file: !2, line: 142, column: 5)
!128 = !DILocation(line: 142, column: 14, scope: !127)
!129 = !DILocation(line: 142, column: 10, scope: !127)
!130 = !DILocation(line: 142, column: 21, scope: !131)
!131 = distinct !DILexicalBlock(scope: !127, file: !2, line: 142, column: 5)
!132 = !DILocation(line: 142, column: 25, scope: !131)
!133 = !DILocation(line: 142, column: 23, scope: !131)
!134 = !DILocation(line: 142, column: 5, scope: !127)
!135 = !DILocation(line: 143, column: 33, scope: !136)
!136 = distinct !DILexicalBlock(scope: !137, file: !2, line: 143, column: 13)
!137 = distinct !DILexicalBlock(scope: !131, file: !2, line: 142, column: 41)
!138 = !DILocation(line: 143, column: 26, scope: !136)
!139 = !DILocation(line: 143, column: 13, scope: !136)
!140 = !DILocation(line: 143, column: 37, scope: !136)
!141 = !DILocation(line: 144, column: 13, scope: !142)
!142 = distinct !DILexicalBlock(scope: !136, file: !2, line: 143, column: 49)
!143 = !DILocation(line: 146, column: 5, scope: !137)
!144 = !DILocation(line: 142, column: 36, scope: !131)
!145 = !DILocation(line: 142, column: 5, scope: !131)
!146 = distinct !{!146, !134, !147, !148}
!147 = !DILocation(line: 146, column: 5, scope: !127)
!148 = !{!"llvm.loop.mustprogress"}
!149 = !DILocation(line: 150, column: 1, scope: !84)
!150 = distinct !DISubprogram(name: "example_mayo", scope: !2, file: !2, line: 25, type: !151, scopeLine: 25, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !45, retainedNodes: !69)
!151 = !DISubroutineType(types: !152)
!152 = !{!87, !90}
!153 = !DILocalVariable(name: "p", arg: 1, scope: !150, file: !2, line: 25, type: !90)
!154 = !DILocation(line: 25, column: 46, scope: !150)
!155 = !DILocalVariable(name: "msglen", scope: !150, file: !2, line: 27, type: !58)
!156 = !DILocation(line: 27, column: 12, scope: !150)
!157 = !DILocalVariable(name: "smlen", scope: !150, file: !2, line: 28, type: !58)
!158 = !DILocation(line: 28, column: 12, scope: !150)
!159 = !DILocation(line: 28, column: 36, scope: !150)
!160 = !DILocation(line: 28, column: 20, scope: !150)
!161 = !DILocation(line: 28, column: 41, scope: !150)
!162 = !DILocation(line: 28, column: 39, scope: !150)
!163 = !DILocalVariable(name: "pk", scope: !150, file: !2, line: 30, type: !61)
!164 = !DILocation(line: 30, column: 20, scope: !150)
!165 = !DILocation(line: 30, column: 49, scope: !150)
!166 = !DILocation(line: 30, column: 33, scope: !150)
!167 = !DILocation(line: 30, column: 26, scope: !150)
!168 = !DILocalVariable(name: "sk", scope: !150, file: !2, line: 31, type: !61)
!169 = !DILocation(line: 31, column: 20, scope: !150)
!170 = !DILocation(line: 31, column: 49, scope: !150)
!171 = !DILocation(line: 31, column: 33, scope: !150)
!172 = !DILocation(line: 31, column: 26, scope: !150)
!173 = !DILocalVariable(name: "epk", scope: !150, file: !2, line: 33, type: !52)
!174 = !DILocation(line: 33, column: 15, scope: !150)
!175 = !DILocation(line: 33, column: 21, scope: !150)
!176 = !DILocalVariable(name: "esk", scope: !150, file: !2, line: 34, type: !177)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 32)
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "sk_t", file: !93, line: 294, baseType: !179)
!179 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sk_t", file: !93, line: 291, size: 7257920, elements: !180)
!180 = !{!181, !185}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !179, file: !93, line: 292, baseType: !182, size: 7238592)
!182 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 7238592, elements: !183)
!183 = !{!184}
!184 = !DISubrange(count: 113103)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "O", scope: !179, file: !93, line: 293, baseType: !186, size: 19312, offset: 7238592)
!186 = !DICompositeType(tag: DW_TAG_array_type, baseType: !187, size: 19312, elements: !189)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !54, line: 24, baseType: !188)
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !56, line: 43, baseType: !51)
!189 = !{!190}
!190 = !DISubrange(count: 2414)
!191 = !DILocation(line: 34, column: 11, scope: !150)
!192 = !DILocation(line: 34, column: 17, scope: !150)
!193 = !DILocalVariable(name: "sig", scope: !150, file: !2, line: 36, type: !61)
!194 = !DILocation(line: 36, column: 20, scope: !150)
!195 = !DILocation(line: 36, column: 49, scope: !150)
!196 = !DILocation(line: 36, column: 33, scope: !150)
!197 = !DILocation(line: 36, column: 54, scope: !150)
!198 = !DILocation(line: 36, column: 52, scope: !150)
!199 = !DILocation(line: 36, column: 26, scope: !150)
!200 = !DILocalVariable(name: "msg", scope: !150, file: !2, line: 38, type: !201)
!201 = !DICompositeType(tag: DW_TAG_array_type, baseType: !51, size: 256, elements: !202)
!202 = !{!203}
!203 = !DISubrange(count: 32)
!204 = !DILocation(line: 38, column: 19, scope: !150)
!205 = !DILocalVariable(name: "msg2", scope: !150, file: !2, line: 39, type: !201)
!206 = !DILocation(line: 39, column: 19, scope: !150)
!207 = !DILocation(line: 41, column: 44, scope: !150)
!208 = !DILocation(line: 41, column: 33, scope: !150)
!209 = !DILocation(line: 41, column: 5, scope: !150)
!210 = !DILocation(line: 43, column: 5, scope: !150)
!211 = !DILocalVariable(name: "res", scope: !150, file: !2, line: 44, type: !87)
!212 = !DILocation(line: 44, column: 9, scope: !150)
!213 = !DILocation(line: 44, column: 28, scope: !150)
!214 = !DILocation(line: 44, column: 31, scope: !150)
!215 = !DILocation(line: 44, column: 35, scope: !150)
!216 = !DILocation(line: 44, column: 15, scope: !150)
!217 = !DILocation(line: 45, column: 9, scope: !218)
!218 = distinct !DILexicalBlock(scope: !150, file: !2, line: 45, column: 9)
!219 = !DILocation(line: 45, column: 13, scope: !218)
!220 = !DILocation(line: 46, column: 9, scope: !221)
!221 = distinct !DILexicalBlock(scope: !218, file: !2, line: 45, column: 25)
!222 = !DILocation(line: 47, column: 13, scope: !221)
!223 = !DILocation(line: 48, column: 9, scope: !221)
!224 = !DILocation(line: 50, column: 9, scope: !225)
!225 = distinct !DILexicalBlock(scope: !218, file: !2, line: 49, column: 12)
!226 = !DILocation(line: 53, column: 5, scope: !150)
!227 = !DILocation(line: 54, column: 26, scope: !150)
!228 = !DILocation(line: 54, column: 29, scope: !150)
!229 = !DILocation(line: 54, column: 33, scope: !150)
!230 = !DILocation(line: 54, column: 11, scope: !150)
!231 = !DILocation(line: 54, column: 9, scope: !150)
!232 = !DILocation(line: 55, column: 9, scope: !233)
!233 = distinct !DILexicalBlock(scope: !150, file: !2, line: 55, column: 9)
!234 = !DILocation(line: 55, column: 13, scope: !233)
!235 = !DILocation(line: 56, column: 9, scope: !236)
!236 = distinct !DILexicalBlock(scope: !233, file: !2, line: 55, column: 25)
!237 = !DILocation(line: 57, column: 13, scope: !236)
!238 = !DILocation(line: 58, column: 9, scope: !236)
!239 = !DILocation(line: 60, column: 9, scope: !240)
!240 = distinct !DILexicalBlock(scope: !233, file: !2, line: 59, column: 12)
!241 = !DILocation(line: 63, column: 5, scope: !150)
!242 = !DILocation(line: 64, column: 26, scope: !150)
!243 = !DILocation(line: 64, column: 29, scope: !150)
!244 = !DILocation(line: 64, column: 33, scope: !150)
!245 = !DILocation(line: 64, column: 11, scope: !150)
!246 = !DILocation(line: 64, column: 9, scope: !150)
!247 = !DILocation(line: 65, column: 9, scope: !248)
!248 = distinct !DILexicalBlock(scope: !150, file: !2, line: 65, column: 9)
!249 = !DILocation(line: 65, column: 13, scope: !248)
!250 = !DILocation(line: 66, column: 9, scope: !251)
!251 = distinct !DILexicalBlock(scope: !248, file: !2, line: 65, column: 25)
!252 = !DILocation(line: 67, column: 13, scope: !251)
!253 = !DILocation(line: 68, column: 9, scope: !251)
!254 = !DILocation(line: 70, column: 9, scope: !255)
!255 = distinct !DILexicalBlock(scope: !248, file: !2, line: 69, column: 12)
!256 = !DILocation(line: 73, column: 5, scope: !150)
!257 = !DILocation(line: 74, column: 21, scope: !150)
!258 = !DILocation(line: 74, column: 24, scope: !150)
!259 = !DILocation(line: 74, column: 37, scope: !150)
!260 = !DILocation(line: 74, column: 42, scope: !150)
!261 = !DILocation(line: 74, column: 50, scope: !150)
!262 = !DILocation(line: 74, column: 11, scope: !150)
!263 = !DILocation(line: 74, column: 9, scope: !150)
!264 = !DILocation(line: 75, column: 9, scope: !265)
!265 = distinct !DILexicalBlock(scope: !150, file: !2, line: 75, column: 9)
!266 = !DILocation(line: 75, column: 13, scope: !265)
!267 = !DILocation(line: 76, column: 9, scope: !268)
!268 = distinct !DILexicalBlock(scope: !265, file: !2, line: 75, column: 25)
!269 = !DILocation(line: 77, column: 13, scope: !268)
!270 = !DILocation(line: 78, column: 9, scope: !268)
!271 = !DILocation(line: 80, column: 9, scope: !272)
!272 = distinct !DILexicalBlock(scope: !265, file: !2, line: 79, column: 12)
!273 = !DILocation(line: 83, column: 5, scope: !150)
!274 = !DILocation(line: 84, column: 21, scope: !150)
!275 = !DILocation(line: 84, column: 24, scope: !150)
!276 = !DILocation(line: 84, column: 39, scope: !150)
!277 = !DILocation(line: 84, column: 44, scope: !150)
!278 = !DILocation(line: 84, column: 51, scope: !150)
!279 = !DILocation(line: 84, column: 11, scope: !150)
!280 = !DILocation(line: 84, column: 9, scope: !150)
!281 = !DILocation(line: 85, column: 9, scope: !282)
!282 = distinct !DILexicalBlock(scope: !150, file: !2, line: 85, column: 9)
!283 = !DILocation(line: 85, column: 13, scope: !282)
!284 = !DILocation(line: 85, column: 24, scope: !282)
!285 = !DILocation(line: 85, column: 34, scope: !282)
!286 = !DILocation(line: 85, column: 39, scope: !282)
!287 = !DILocation(line: 85, column: 45, scope: !282)
!288 = !DILocation(line: 85, column: 27, scope: !282)
!289 = !DILocation(line: 86, column: 9, scope: !290)
!290 = distinct !DILexicalBlock(scope: !282, file: !2, line: 85, column: 54)
!291 = !DILocation(line: 87, column: 13, scope: !290)
!292 = !DILocation(line: 88, column: 9, scope: !290)
!293 = !DILocation(line: 90, column: 13, scope: !294)
!294 = distinct !DILexicalBlock(scope: !282, file: !2, line: 89, column: 12)
!295 = !DILocation(line: 91, column: 9, scope: !294)
!296 = !DILocation(line: 94, column: 5, scope: !150)
!297 = !DILocation(line: 95, column: 23, scope: !150)
!298 = !DILocation(line: 95, column: 26, scope: !150)
!299 = !DILocation(line: 95, column: 31, scope: !150)
!300 = !DILocation(line: 95, column: 39, scope: !150)
!301 = !DILocation(line: 95, column: 44, scope: !150)
!302 = !DILocation(line: 95, column: 11, scope: !150)
!303 = !DILocation(line: 95, column: 9, scope: !150)
!304 = !DILocation(line: 96, column: 9, scope: !305)
!305 = distinct !DILexicalBlock(scope: !150, file: !2, line: 96, column: 9)
!306 = !DILocation(line: 96, column: 13, scope: !305)
!307 = !DILocation(line: 97, column: 9, scope: !308)
!308 = distinct !DILexicalBlock(scope: !305, file: !2, line: 96, column: 25)
!309 = !DILocation(line: 98, column: 13, scope: !308)
!310 = !DILocation(line: 99, column: 9, scope: !308)
!311 = !DILocation(line: 101, column: 13, scope: !312)
!312 = distinct !DILexicalBlock(scope: !305, file: !2, line: 100, column: 12)
!313 = !DILocation(line: 102, column: 9, scope: !312)
!314 = !DILocation(line: 105, column: 5, scope: !150)
!315 = !DILocation(line: 106, column: 15, scope: !150)
!316 = !DILocation(line: 106, column: 14, scope: !150)
!317 = !DILocation(line: 106, column: 5, scope: !150)
!318 = !DILocation(line: 106, column: 12, scope: !150)
!319 = !DILocation(line: 107, column: 12, scope: !150)
!320 = !DILocation(line: 107, column: 21, scope: !150)
!321 = !DILocation(line: 107, column: 5, scope: !150)
!322 = !DILocation(line: 108, column: 21, scope: !150)
!323 = !DILocation(line: 108, column: 24, scope: !150)
!324 = !DILocation(line: 108, column: 39, scope: !150)
!325 = !DILocation(line: 108, column: 44, scope: !150)
!326 = !DILocation(line: 108, column: 51, scope: !150)
!327 = !DILocation(line: 108, column: 11, scope: !150)
!328 = !DILocation(line: 108, column: 9, scope: !150)
!329 = !DILocation(line: 109, column: 9, scope: !330)
!330 = distinct !DILexicalBlock(scope: !150, file: !2, line: 109, column: 9)
!331 = !DILocation(line: 109, column: 13, scope: !330)
!332 = !DILocation(line: 109, column: 25, scope: !330)
!333 = !DILocation(line: 109, column: 36, scope: !330)
!334 = !DILocation(line: 109, column: 41, scope: !330)
!335 = !DILocation(line: 109, column: 47, scope: !330)
!336 = !DILocation(line: 109, column: 29, scope: !330)
!337 = !DILocation(line: 110, column: 9, scope: !338)
!338 = distinct !DILexicalBlock(scope: !330, file: !2, line: 109, column: 56)
!339 = !DILocation(line: 111, column: 13, scope: !338)
!340 = !DILocation(line: 112, column: 9, scope: !338)
!341 = !DILocation(line: 114, column: 13, scope: !342)
!342 = distinct !DILexicalBlock(scope: !330, file: !2, line: 113, column: 12)
!343 = !DILocation(line: 115, column: 9, scope: !342)
!344 = !DILocation(line: 118, column: 5, scope: !150)
!345 = !DILocation(line: 119, column: 23, scope: !150)
!346 = !DILocation(line: 119, column: 26, scope: !150)
!347 = !DILocation(line: 119, column: 31, scope: !150)
!348 = !DILocation(line: 119, column: 39, scope: !150)
!349 = !DILocation(line: 119, column: 44, scope: !150)
!350 = !DILocation(line: 119, column: 11, scope: !150)
!351 = !DILocation(line: 119, column: 9, scope: !150)
!352 = !DILocation(line: 120, column: 9, scope: !353)
!353 = distinct !DILexicalBlock(scope: !150, file: !2, line: 120, column: 9)
!354 = !DILocation(line: 120, column: 13, scope: !353)
!355 = !DILocation(line: 121, column: 9, scope: !356)
!356 = distinct !DILexicalBlock(scope: !353, file: !2, line: 120, column: 25)
!357 = !DILocation(line: 122, column: 13, scope: !356)
!358 = !DILocation(line: 123, column: 9, scope: !356)
!359 = !DILocation(line: 125, column: 13, scope: !360)
!360 = distinct !DILexicalBlock(scope: !353, file: !2, line: 124, column: 12)
!361 = !DILocation(line: 126, column: 9, scope: !360)
!362 = !DILocation(line: 120, column: 16, scope: !353)
!363 = !DILabel(scope: !150, name: "err", file: !2, line: 129, column: 1)
!364 = !DILocation(line: 129, column: 1, scope: !150)
!365 = !DILocation(line: 130, column: 10, scope: !150)
!366 = !DILocation(line: 130, column: 5, scope: !150)
!367 = !DILocation(line: 131, column: 10, scope: !150)
!368 = !DILocation(line: 131, column: 5, scope: !150)
!369 = !DILocation(line: 132, column: 22, scope: !150)
!370 = !DILocation(line: 132, column: 42, scope: !150)
!371 = !DILocation(line: 132, column: 26, scope: !150)
!372 = !DILocation(line: 132, column: 5, scope: !150)
!373 = !DILocation(line: 133, column: 22, scope: !150)
!374 = !DILocation(line: 133, column: 5, scope: !150)
!375 = !DILocation(line: 134, column: 10, scope: !150)
!376 = !DILocation(line: 134, column: 5, scope: !150)
!377 = !DILocation(line: 135, column: 12, scope: !150)
!378 = !DILocation(line: 135, column: 5, scope: !150)
!379 = distinct !DISubprogram(name: "mayo_keypair", scope: !66, file: !66, line: 298, type: !380, scopeLine: 298, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !48, retainedNodes: !69)
!380 = !DISubroutineType(types: !381)
!381 = !{!87, !382, !61, !61}
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 32)
!383 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !384)
!384 = !DIDerivedType(tag: DW_TAG_typedef, name: "mayo_params_t", file: !93, line: 289, baseType: !385)
!385 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !93, line: 265, size: 736, elements: !386)
!386 = !{!387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409}
!387 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !385, file: !93, line: 266, baseType: !87, size: 32)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !385, file: !93, line: 267, baseType: !87, size: 32, offset: 32)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "o", scope: !385, file: !93, line: 268, baseType: !87, size: 32, offset: 64)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "k", scope: !385, file: !93, line: 269, baseType: !87, size: 32, offset: 96)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !385, file: !93, line: 270, baseType: !87, size: 32, offset: 128)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "f_tail", scope: !385, file: !93, line: 271, baseType: !102, size: 32, offset: 160)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "m_bytes", scope: !385, file: !93, line: 272, baseType: !87, size: 32, offset: 192)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "O_bytes", scope: !385, file: !93, line: 273, baseType: !87, size: 32, offset: 224)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "v_bytes", scope: !385, file: !93, line: 274, baseType: !87, size: 32, offset: 256)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "r_bytes", scope: !385, file: !93, line: 275, baseType: !87, size: 32, offset: 288)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "R_bytes", scope: !385, file: !93, line: 276, baseType: !87, size: 32, offset: 320)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "P1_bytes", scope: !385, file: !93, line: 277, baseType: !87, size: 32, offset: 352)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "P2_bytes", scope: !385, file: !93, line: 278, baseType: !87, size: 32, offset: 384)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "P3_bytes", scope: !385, file: !93, line: 279, baseType: !87, size: 32, offset: 416)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "csk_bytes", scope: !385, file: !93, line: 280, baseType: !87, size: 32, offset: 448)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "cpk_bytes", scope: !385, file: !93, line: 281, baseType: !87, size: 32, offset: 480)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "sig_bytes", scope: !385, file: !93, line: 282, baseType: !87, size: 32, offset: 512)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "salt_bytes", scope: !385, file: !93, line: 283, baseType: !87, size: 32, offset: 544)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "sk_seed_bytes", scope: !385, file: !93, line: 284, baseType: !87, size: 32, offset: 576)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "digest_bytes", scope: !385, file: !93, line: 285, baseType: !87, size: 32, offset: 608)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "pk_seed_bytes", scope: !385, file: !93, line: 286, baseType: !87, size: 32, offset: 640)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "m_vec_limbs", scope: !385, file: !93, line: 287, baseType: !87, size: 32, offset: 672)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !385, file: !93, line: 288, baseType: !121, size: 32, offset: 704)
!410 = !DILocalVariable(name: "p", arg: 1, scope: !379, file: !66, line: 298, type: !382)
!411 = !DILocation(line: 298, column: 39, scope: !379)
!412 = !DILocalVariable(name: "pk", arg: 2, scope: !379, file: !66, line: 298, type: !61)
!413 = !DILocation(line: 298, column: 57, scope: !379)
!414 = !DILocalVariable(name: "sk", arg: 3, scope: !379, file: !66, line: 298, type: !61)
!415 = !DILocation(line: 298, column: 76, scope: !379)
!416 = !DILocalVariable(name: "ret", scope: !379, file: !66, line: 299, type: !87)
!417 = !DILocation(line: 299, column: 9, scope: !379)
!418 = !DILocation(line: 301, column: 32, scope: !379)
!419 = !DILocation(line: 301, column: 35, scope: !379)
!420 = !DILocation(line: 301, column: 39, scope: !379)
!421 = !DILocation(line: 301, column: 11, scope: !379)
!422 = !DILocation(line: 301, column: 9, scope: !379)
!423 = !DILocation(line: 302, column: 9, scope: !424)
!424 = distinct !DILexicalBlock(scope: !379, file: !66, line: 302, column: 9)
!425 = !DILocation(line: 302, column: 13, scope: !424)
!426 = !DILocation(line: 303, column: 9, scope: !427)
!427 = distinct !DILexicalBlock(scope: !424, file: !66, line: 302, column: 25)
!428 = !DILocation(line: 302, column: 16, scope: !424)
!429 = !DILabel(scope: !379, name: "err", file: !66, line: 306, column: 1)
!430 = !DILocation(line: 306, column: 1, scope: !379)
!431 = !DILocation(line: 307, column: 12, scope: !379)
!432 = !DILocation(line: 307, column: 5, scope: !379)
!433 = distinct !DISubprogram(name: "mayo_keypair_compact", scope: !66, file: !66, line: 538, type: !380, scopeLine: 539, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !48, retainedNodes: !69)
!434 = !DILocalVariable(name: "p", arg: 1, scope: !433, file: !66, line: 538, type: !382)
!435 = !DILocation(line: 538, column: 47, scope: !433)
!436 = !DILocalVariable(name: "cpk", arg: 2, scope: !433, file: !66, line: 538, type: !61)
!437 = !DILocation(line: 538, column: 65, scope: !433)
!438 = !DILocalVariable(name: "csk", arg: 3, scope: !433, file: !66, line: 539, type: !61)
!439 = !DILocation(line: 539, column: 41, scope: !433)
!440 = !DILocalVariable(name: "ret", scope: !433, file: !66, line: 540, type: !87)
!441 = !DILocation(line: 540, column: 9, scope: !433)
!442 = !DILocalVariable(name: "seed_sk", scope: !433, file: !66, line: 541, type: !61)
!443 = !DILocation(line: 541, column: 20, scope: !433)
!444 = !DILocation(line: 541, column: 30, scope: !433)
!445 = !DILocalVariable(name: "S", scope: !433, file: !66, line: 542, type: !446)
!446 = !DICompositeType(tag: DW_TAG_array_type, baseType: !51, size: 6944, elements: !447)
!447 = !{!448}
!448 = !DISubrange(count: 868)
!449 = !DILocation(line: 542, column: 19, scope: !433)
!450 = !DILocalVariable(name: "P", scope: !433, file: !66, line: 543, type: !182)
!451 = !DILocation(line: 543, column: 14, scope: !433)
!452 = !DILocalVariable(name: "P3", scope: !433, file: !66, line: 544, type: !453)
!453 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 166464, elements: !454)
!454 = !{!455}
!455 = !DISubrange(count: 2601)
!456 = !DILocation(line: 544, column: 14, scope: !433)
!457 = !DILocalVariable(name: "seed_pk", scope: !433, file: !66, line: 546, type: !61)
!458 = !DILocation(line: 546, column: 20, scope: !433)
!459 = !DILocalVariable(name: "O", scope: !433, file: !66, line: 547, type: !460)
!460 = !DICompositeType(tag: DW_TAG_array_type, baseType: !51, size: 19312, elements: !189)
!461 = !DILocation(line: 547, column: 19, scope: !433)
!462 = !DILocalVariable(name: "m_vec_limbs", scope: !433, file: !66, line: 549, type: !463)
!463 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !87)
!464 = !DILocation(line: 549, column: 15, scope: !433)
!465 = !DILocation(line: 549, column: 47, scope: !433)
!466 = !DILocation(line: 549, column: 29, scope: !433)
!467 = !DILocalVariable(name: "param_m", scope: !433, file: !66, line: 550, type: !463)
!468 = !DILocation(line: 550, column: 15, scope: !433)
!469 = !DILocation(line: 550, column: 33, scope: !433)
!470 = !DILocation(line: 550, column: 25, scope: !433)
!471 = !DILocalVariable(name: "param_v", scope: !433, file: !66, line: 551, type: !463)
!472 = !DILocation(line: 551, column: 15, scope: !433)
!473 = !DILocation(line: 551, column: 33, scope: !433)
!474 = !DILocation(line: 551, column: 25, scope: !433)
!475 = !DILocalVariable(name: "param_o", scope: !433, file: !66, line: 552, type: !463)
!476 = !DILocation(line: 552, column: 15, scope: !433)
!477 = !DILocation(line: 552, column: 33, scope: !433)
!478 = !DILocation(line: 552, column: 25, scope: !433)
!479 = !DILocalVariable(name: "param_O_bytes", scope: !433, file: !66, line: 553, type: !463)
!480 = !DILocation(line: 553, column: 15, scope: !433)
!481 = !DILocation(line: 553, column: 45, scope: !433)
!482 = !DILocation(line: 553, column: 31, scope: !433)
!483 = !DILocalVariable(name: "param_P1_limbs", scope: !433, file: !66, line: 554, type: !463)
!484 = !DILocation(line: 554, column: 15, scope: !433)
!485 = !DILocation(line: 554, column: 47, scope: !433)
!486 = !DILocation(line: 554, column: 32, scope: !433)
!487 = !DILocalVariable(name: "param_P3_limbs", scope: !433, file: !66, line: 555, type: !463)
!488 = !DILocation(line: 555, column: 15, scope: !433)
!489 = !DILocation(line: 555, column: 47, scope: !433)
!490 = !DILocation(line: 555, column: 32, scope: !433)
!491 = !DILocalVariable(name: "param_pk_seed_bytes", scope: !433, file: !66, line: 556, type: !463)
!492 = !DILocation(line: 556, column: 15, scope: !433)
!493 = !DILocation(line: 556, column: 57, scope: !433)
!494 = !DILocation(line: 556, column: 37, scope: !433)
!495 = !DILocalVariable(name: "param_sk_seed_bytes", scope: !433, file: !66, line: 557, type: !463)
!496 = !DILocation(line: 557, column: 15, scope: !433)
!497 = !DILocation(line: 557, column: 57, scope: !433)
!498 = !DILocation(line: 557, column: 37, scope: !433)
!499 = !DILocalVariable(name: "P1", scope: !433, file: !66, line: 559, type: !52)
!500 = !DILocation(line: 559, column: 15, scope: !433)
!501 = !DILocation(line: 559, column: 20, scope: !433)
!502 = !DILocalVariable(name: "P2", scope: !433, file: !66, line: 560, type: !52)
!503 = !DILocation(line: 560, column: 15, scope: !433)
!504 = !DILocation(line: 560, column: 20, scope: !433)
!505 = !DILocation(line: 560, column: 24, scope: !433)
!506 = !DILocation(line: 560, column: 22, scope: !433)
!507 = !DILocation(line: 566, column: 21, scope: !508)
!508 = distinct !DILexicalBlock(scope: !433, file: !66, line: 566, column: 9)
!509 = !DILocation(line: 566, column: 30, scope: !508)
!510 = !DILocation(line: 566, column: 9, scope: !508)
!511 = !DILocation(line: 566, column: 51, scope: !508)
!512 = !DILocation(line: 567, column: 13, scope: !513)
!513 = distinct !DILexicalBlock(scope: !508, file: !66, line: 566, column: 63)
!514 = !DILocation(line: 568, column: 9, scope: !513)
!515 = !DILocation(line: 573, column: 14, scope: !433)
!516 = !DILocation(line: 573, column: 17, scope: !433)
!517 = !DILocation(line: 573, column: 39, scope: !433)
!518 = !DILocation(line: 573, column: 37, scope: !433)
!519 = !DILocation(line: 573, column: 54, scope: !433)
!520 = !DILocation(line: 574, column: 14, scope: !433)
!521 = !DILocation(line: 573, column: 5, scope: !433)
!522 = !DILocation(line: 576, column: 15, scope: !433)
!523 = !DILocation(line: 576, column: 13, scope: !433)
!524 = !DILocation(line: 579, column: 12, scope: !433)
!525 = !DILocation(line: 579, column: 16, scope: !433)
!526 = !DILocation(line: 579, column: 14, scope: !433)
!527 = !DILocation(line: 579, column: 37, scope: !433)
!528 = !DILocation(line: 579, column: 40, scope: !433)
!529 = !DILocation(line: 579, column: 50, scope: !433)
!530 = !DILocation(line: 579, column: 48, scope: !433)
!531 = !DILocation(line: 579, column: 5, scope: !433)
!532 = !DILocation(line: 585, column: 18, scope: !433)
!533 = !DILocation(line: 585, column: 21, scope: !433)
!534 = !DILocation(line: 585, column: 24, scope: !433)
!535 = !DILocation(line: 585, column: 5, scope: !433)
!536 = !DILocation(line: 588, column: 16, scope: !433)
!537 = !DILocation(line: 588, column: 19, scope: !433)
!538 = !DILocation(line: 588, column: 23, scope: !433)
!539 = !DILocation(line: 588, column: 27, scope: !433)
!540 = !DILocation(line: 588, column: 30, scope: !433)
!541 = !DILocation(line: 588, column: 5, scope: !433)
!542 = !DILocation(line: 591, column: 12, scope: !433)
!543 = !DILocation(line: 591, column: 17, scope: !433)
!544 = !DILocation(line: 591, column: 26, scope: !433)
!545 = !DILocation(line: 591, column: 5, scope: !433)
!546 = !DILocalVariable(name: "P3_upper", scope: !433, file: !66, line: 593, type: !547)
!547 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 88128, elements: !548)
!548 = !{!549}
!549 = !DISubrange(count: 1377)
!550 = !DILocation(line: 593, column: 14, scope: !433)
!551 = !DILocation(line: 596, column: 13, scope: !433)
!552 = !DILocation(line: 596, column: 16, scope: !433)
!553 = !DILocation(line: 596, column: 20, scope: !433)
!554 = !DILocation(line: 596, column: 30, scope: !433)
!555 = !DILocation(line: 596, column: 5, scope: !433)
!556 = !DILocation(line: 597, column: 17, scope: !433)
!557 = !DILocation(line: 597, column: 27, scope: !433)
!558 = !DILocation(line: 597, column: 33, scope: !433)
!559 = !DILocation(line: 597, column: 31, scope: !433)
!560 = !DILocation(line: 597, column: 54, scope: !433)
!561 = !DILocation(line: 597, column: 69, scope: !433)
!562 = !DILocation(line: 597, column: 68, scope: !433)
!563 = !DILocation(line: 597, column: 82, scope: !433)
!564 = !DILocation(line: 597, column: 5, scope: !433)
!565 = !DILabel(scope: !433, name: "err", file: !66, line: 600, column: 5)
!566 = !DILocation(line: 600, column: 5, scope: !433)
!567 = !DILocation(line: 602, column: 23, scope: !433)
!568 = !DILocation(line: 602, column: 5, scope: !433)
!569 = !DILocation(line: 603, column: 23, scope: !433)
!570 = !DILocation(line: 603, column: 42, scope: !433)
!571 = !DILocation(line: 603, column: 27, scope: !433)
!572 = !DILocation(line: 603, column: 44, scope: !433)
!573 = !DILocation(line: 603, column: 5, scope: !433)
!574 = !DILocation(line: 604, column: 23, scope: !433)
!575 = !DILocation(line: 604, column: 5, scope: !433)
!576 = !DILocation(line: 605, column: 12, scope: !433)
!577 = !DILocation(line: 605, column: 5, scope: !433)
!578 = distinct !DISubprogram(name: "decode", scope: !66, file: !66, line: 20, type: !579, scopeLine: 20, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !48, retainedNodes: !69)
!579 = !DISubroutineType(types: !580)
!580 = !{null, !102, !61, !87}
!581 = !DILocalVariable(name: "m", arg: 1, scope: !578, file: !66, line: 20, type: !102)
!582 = !DILocation(line: 20, column: 41, scope: !578)
!583 = !DILocalVariable(name: "mdec", arg: 2, scope: !578, file: !66, line: 20, type: !61)
!584 = !DILocation(line: 20, column: 59, scope: !578)
!585 = !DILocalVariable(name: "mdeclen", arg: 3, scope: !578, file: !66, line: 20, type: !87)
!586 = !DILocation(line: 20, column: 69, scope: !578)
!587 = !DILocalVariable(name: "i", scope: !578, file: !66, line: 21, type: !87)
!588 = !DILocation(line: 21, column: 9, scope: !578)
!589 = !DILocation(line: 22, column: 12, scope: !590)
!590 = distinct !DILexicalBlock(scope: !578, file: !66, line: 22, column: 5)
!591 = !DILocation(line: 22, column: 10, scope: !590)
!592 = !DILocation(line: 22, column: 17, scope: !593)
!593 = distinct !DILexicalBlock(scope: !590, file: !66, line: 22, column: 5)
!594 = !DILocation(line: 22, column: 21, scope: !593)
!595 = !DILocation(line: 22, column: 29, scope: !593)
!596 = !DILocation(line: 22, column: 19, scope: !593)
!597 = !DILocation(line: 22, column: 5, scope: !590)
!598 = !DILocation(line: 23, column: 19, scope: !599)
!599 = distinct !DILexicalBlock(scope: !593, file: !66, line: 22, column: 39)
!600 = !DILocation(line: 23, column: 21, scope: !599)
!601 = !DILocation(line: 23, column: 24, scope: !599)
!602 = !DILocation(line: 23, column: 14, scope: !599)
!603 = !DILocation(line: 23, column: 17, scope: !599)
!604 = !DILocation(line: 24, column: 19, scope: !599)
!605 = !DILocation(line: 24, column: 21, scope: !599)
!606 = !DILocation(line: 24, column: 24, scope: !599)
!607 = !DILocation(line: 24, column: 14, scope: !599)
!608 = !DILocation(line: 24, column: 17, scope: !599)
!609 = !DILocation(line: 25, column: 5, scope: !599)
!610 = !DILocation(line: 22, column: 34, scope: !593)
!611 = !DILocation(line: 22, column: 5, scope: !593)
!612 = distinct !{!612, !597, !613, !148}
!613 = !DILocation(line: 25, column: 5, scope: !590)
!614 = !DILocation(line: 27, column: 9, scope: !615)
!615 = distinct !DILexicalBlock(scope: !578, file: !66, line: 27, column: 9)
!616 = !DILocation(line: 27, column: 17, scope: !615)
!617 = !DILocation(line: 27, column: 21, scope: !615)
!618 = !DILocation(line: 28, column: 19, scope: !619)
!619 = distinct !DILexicalBlock(scope: !615, file: !66, line: 27, column: 27)
!620 = !DILocation(line: 28, column: 21, scope: !619)
!621 = !DILocation(line: 28, column: 24, scope: !619)
!622 = !DILocation(line: 28, column: 14, scope: !619)
!623 = !DILocation(line: 28, column: 17, scope: !619)
!624 = !DILocation(line: 29, column: 5, scope: !619)
!625 = !DILocation(line: 30, column: 1, scope: !578)
!626 = distinct !DISubprogram(name: "expand_P1_P2", scope: !66, file: !66, line: 280, type: !627, scopeLine: 280, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !48, retainedNodes: !69)
!627 = !DISubroutineType(types: !628)
!628 = !{null, !382, !52, !102}
!629 = !DILocalVariable(name: "p", arg: 1, scope: !626, file: !66, line: 280, type: !382)
!630 = !DILocation(line: 280, column: 47, scope: !626)
!631 = !DILocalVariable(name: "P", arg: 2, scope: !626, file: !66, line: 280, type: !52)
!632 = !DILocation(line: 280, column: 60, scope: !626)
!633 = !DILocalVariable(name: "seed_pk", arg: 3, scope: !626, file: !66, line: 280, type: !102)
!634 = !DILocation(line: 280, column: 84, scope: !626)
!635 = !DILocation(line: 284, column: 29, scope: !626)
!636 = !DILocation(line: 284, column: 47, scope: !626)
!637 = !DILocation(line: 284, column: 32, scope: !626)
!638 = !DILocation(line: 284, column: 67, scope: !626)
!639 = !DILocation(line: 284, column: 52, scope: !626)
!640 = !DILocation(line: 284, column: 50, scope: !626)
!641 = !DILocation(line: 284, column: 71, scope: !626)
!642 = !DILocation(line: 284, column: 100, scope: !626)
!643 = !DILocation(line: 284, column: 80, scope: !626)
!644 = !DILocation(line: 284, column: 5, scope: !626)
!645 = !DILocation(line: 285, column: 36, scope: !626)
!646 = !DILocation(line: 285, column: 39, scope: !626)
!647 = !DILocation(line: 285, column: 58, scope: !626)
!648 = !DILocation(line: 285, column: 43, scope: !626)
!649 = !DILocation(line: 285, column: 78, scope: !626)
!650 = !DILocation(line: 285, column: 63, scope: !626)
!651 = !DILocation(line: 285, column: 61, scope: !626)
!652 = !DILocation(line: 285, column: 100, scope: !626)
!653 = !DILocation(line: 285, column: 82, scope: !626)
!654 = !DILocation(line: 285, column: 81, scope: !626)
!655 = !DILocation(line: 285, column: 112, scope: !626)
!656 = !DILocation(line: 285, column: 104, scope: !626)
!657 = !DILocation(line: 285, column: 5, scope: !626)
!658 = !DILocation(line: 286, column: 1, scope: !626)
!659 = distinct !DISubprogram(name: "compute_P3", scope: !660, file: !660, line: 260, type: !661, scopeLine: 260, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !48, retainedNodes: !69)
!660 = !DIFile(filename: "../../src/generic/generic_arithmetic.h", directory: "")
!661 = !DISubroutineType(types: !662)
!662 = !{null, !382, !663, !52, !102, !52}
!663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 32)
!664 = !DILocalVariable(name: "p", arg: 1, scope: !659, file: !660, line: 260, type: !382)
!665 = !DILocation(line: 260, column: 38, scope: !659)
!666 = !DILocalVariable(name: "P1", arg: 2, scope: !659, file: !660, line: 260, type: !663)
!667 = !DILocation(line: 260, column: 57, scope: !659)
!668 = !DILocalVariable(name: "P2", arg: 3, scope: !659, file: !660, line: 260, type: !52)
!669 = !DILocation(line: 260, column: 71, scope: !659)
!670 = !DILocalVariable(name: "O", arg: 4, scope: !659, file: !660, line: 260, type: !102)
!671 = !DILocation(line: 260, column: 96, scope: !659)
!672 = !DILocalVariable(name: "P3", arg: 5, scope: !659, file: !660, line: 260, type: !52)
!673 = !DILocation(line: 260, column: 109, scope: !659)
!674 = !DILocalVariable(name: "m_vec_limbs", scope: !659, file: !660, line: 262, type: !463)
!675 = !DILocation(line: 262, column: 15, scope: !659)
!676 = !DILocation(line: 262, column: 47, scope: !659)
!677 = !DILocation(line: 262, column: 29, scope: !659)
!678 = !DILocalVariable(name: "param_v", scope: !659, file: !660, line: 263, type: !463)
!679 = !DILocation(line: 263, column: 15, scope: !659)
!680 = !DILocation(line: 263, column: 33, scope: !659)
!681 = !DILocation(line: 263, column: 25, scope: !659)
!682 = !DILocalVariable(name: "param_o", scope: !659, file: !660, line: 264, type: !463)
!683 = !DILocation(line: 264, column: 15, scope: !659)
!684 = !DILocation(line: 264, column: 33, scope: !659)
!685 = !DILocation(line: 264, column: 25, scope: !659)
!686 = !DILocation(line: 267, column: 16, scope: !659)
!687 = !DILocation(line: 267, column: 19, scope: !659)
!688 = !DILocation(line: 267, column: 23, scope: !659)
!689 = !DILocation(line: 267, column: 26, scope: !659)
!690 = !DILocation(line: 267, column: 5, scope: !659)
!691 = !DILocation(line: 270, column: 31, scope: !659)
!692 = !DILocation(line: 270, column: 44, scope: !659)
!693 = !DILocation(line: 270, column: 47, scope: !659)
!694 = !DILocation(line: 270, column: 51, scope: !659)
!695 = !DILocation(line: 270, column: 55, scope: !659)
!696 = !DILocation(line: 270, column: 64, scope: !659)
!697 = !DILocation(line: 270, column: 73, scope: !659)
!698 = !DILocation(line: 270, column: 5, scope: !659)
!699 = !DILocation(line: 271, column: 1, scope: !659)
!700 = distinct !DISubprogram(name: "pack_m_vecs", scope: !66, file: !66, line: 272, type: !701, scopeLine: 272, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !48, retainedNodes: !69)
!701 = !DISubroutineType(types: !702)
!702 = !{null, !663, !61, !87, !87}
!703 = !DILocalVariable(name: "in", arg: 1, scope: !700, file: !66, line: 272, type: !663)
!704 = !DILocation(line: 272, column: 41, scope: !700)
!705 = !DILocalVariable(name: "out", arg: 2, scope: !700, file: !66, line: 272, type: !61)
!706 = !DILocation(line: 272, column: 60, scope: !700)
!707 = !DILocalVariable(name: "vecs", arg: 3, scope: !700, file: !66, line: 272, type: !87)
!708 = !DILocation(line: 272, column: 69, scope: !700)
!709 = !DILocalVariable(name: "m", arg: 4, scope: !700, file: !66, line: 272, type: !87)
!710 = !DILocation(line: 272, column: 79, scope: !700)
!711 = !DILocalVariable(name: "m_vec_limbs", scope: !700, file: !66, line: 273, type: !463)
!712 = !DILocation(line: 273, column: 15, scope: !700)
!713 = !DILocation(line: 273, column: 30, scope: !700)
!714 = !DILocation(line: 273, column: 32, scope: !700)
!715 = !DILocation(line: 273, column: 38, scope: !700)
!716 = !DILocalVariable(name: "_in", scope: !700, file: !66, line: 274, type: !61)
!717 = !DILocation(line: 274, column: 20, scope: !700)
!718 = !DILocation(line: 274, column: 44, scope: !700)
!719 = !DILocalVariable(name: "i", scope: !720, file: !66, line: 275, type: !87)
!720 = distinct !DILexicalBlock(scope: !700, file: !66, line: 275, column: 5)
!721 = !DILocation(line: 275, column: 14, scope: !720)
!722 = !DILocation(line: 275, column: 10, scope: !720)
!723 = !DILocation(line: 275, column: 21, scope: !724)
!724 = distinct !DILexicalBlock(scope: !720, file: !66, line: 275, column: 5)
!725 = !DILocation(line: 275, column: 25, scope: !724)
!726 = !DILocation(line: 275, column: 23, scope: !724)
!727 = !DILocation(line: 275, column: 5, scope: !720)
!728 = !DILocation(line: 277, column: 17, scope: !729)
!729 = distinct !DILexicalBlock(scope: !724, file: !66, line: 276, column: 5)
!730 = !DILocation(line: 277, column: 24, scope: !729)
!731 = !DILocation(line: 277, column: 26, scope: !729)
!732 = !DILocation(line: 277, column: 25, scope: !729)
!733 = !DILocation(line: 277, column: 27, scope: !729)
!734 = !DILocation(line: 277, column: 21, scope: !729)
!735 = !DILocation(line: 277, column: 32, scope: !729)
!736 = !DILocation(line: 277, column: 38, scope: !729)
!737 = !DILocation(line: 277, column: 40, scope: !729)
!738 = !DILocation(line: 277, column: 39, scope: !729)
!739 = !DILocation(line: 277, column: 51, scope: !729)
!740 = !DILocation(line: 277, column: 36, scope: !729)
!741 = !DILocation(line: 277, column: 70, scope: !729)
!742 = !DILocation(line: 277, column: 71, scope: !729)
!743 = !DILocation(line: 277, column: 9, scope: !729)
!744 = !DILocation(line: 278, column: 5, scope: !729)
!745 = !DILocation(line: 275, column: 32, scope: !724)
!746 = !DILocation(line: 275, column: 5, scope: !724)
!747 = distinct !{!747, !727, !748, !148}
!748 = !DILocation(line: 278, column: 5, scope: !720)
!749 = !DILocation(line: 279, column: 1, scope: !700)
!750 = distinct !DISubprogram(name: "P1_times_O", scope: !660, file: !660, line: 74, type: !751, scopeLine: 74, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !48, retainedNodes: !69)
!751 = !DISubroutineType(types: !752)
!752 = !{null, !382, !663, !102, !52}
!753 = !DILocalVariable(name: "p", arg: 1, scope: !750, file: !660, line: 74, type: !382)
!754 = !DILocation(line: 74, column: 38, scope: !750)
!755 = !DILocalVariable(name: "P1", arg: 2, scope: !750, file: !660, line: 74, type: !663)
!756 = !DILocation(line: 74, column: 57, scope: !750)
!757 = !DILocalVariable(name: "O", arg: 3, scope: !750, file: !660, line: 74, type: !102)
!758 = !DILocation(line: 74, column: 82, scope: !750)
!759 = !DILocalVariable(name: "acc", arg: 4, scope: !750, file: !660, line: 74, type: !52)
!760 = !DILocation(line: 74, column: 95, scope: !750)
!761 = !DILocation(line: 78, column: 60, scope: !750)
!762 = !DILocation(line: 78, column: 42, scope: !750)
!763 = !DILocation(line: 78, column: 64, scope: !750)
!764 = !DILocation(line: 78, column: 68, scope: !750)
!765 = !DILocation(line: 78, column: 71, scope: !750)
!766 = !DILocation(line: 78, column: 84, scope: !750)
!767 = !DILocation(line: 78, column: 76, scope: !750)
!768 = !DILocation(line: 78, column: 96, scope: !750)
!769 = !DILocation(line: 78, column: 88, scope: !750)
!770 = !DILocation(line: 78, column: 108, scope: !750)
!771 = !DILocation(line: 78, column: 100, scope: !750)
!772 = !DILocation(line: 78, column: 5, scope: !750)
!773 = !DILocation(line: 79, column: 1, scope: !750)
!774 = distinct !DISubprogram(name: "mul_add_mat_trans_x_m_mat", scope: !660, file: !660, line: 47, type: !775, scopeLine: 48, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !48, retainedNodes: !69)
!775 = !DISubroutineType(types: !776)
!776 = !{null, !463, !102, !663, !52, !463, !463, !463}
!777 = !DILocalVariable(name: "m_vec_limbs", arg: 1, scope: !774, file: !660, line: 47, type: !463)
!778 = !DILocation(line: 47, column: 42, scope: !774)
!779 = !DILocalVariable(name: "mat", arg: 2, scope: !774, file: !660, line: 47, type: !102)
!780 = !DILocation(line: 47, column: 76, scope: !774)
!781 = !DILocalVariable(name: "bs_mat", arg: 3, scope: !774, file: !660, line: 47, type: !663)
!782 = !DILocation(line: 47, column: 97, scope: !774)
!783 = !DILocalVariable(name: "acc", arg: 4, scope: !774, file: !660, line: 47, type: !52)
!784 = !DILocation(line: 47, column: 115, scope: !774)
!785 = !DILocalVariable(name: "mat_rows", arg: 5, scope: !774, file: !660, line: 48, type: !463)
!786 = !DILocation(line: 48, column: 42, scope: !774)
!787 = !DILocalVariable(name: "mat_cols", arg: 6, scope: !774, file: !660, line: 48, type: !463)
!788 = !DILocation(line: 48, column: 62, scope: !774)
!789 = !DILocalVariable(name: "bs_mat_cols", arg: 7, scope: !774, file: !660, line: 48, type: !463)
!790 = !DILocation(line: 48, column: 82, scope: !774)
!791 = !DILocalVariable(name: "r", scope: !792, file: !660, line: 50, type: !87)
!792 = distinct !DILexicalBlock(scope: !774, file: !660, line: 50, column: 5)
!793 = !DILocation(line: 50, column: 14, scope: !792)
!794 = !DILocation(line: 50, column: 10, scope: !792)
!795 = !DILocation(line: 50, column: 21, scope: !796)
!796 = distinct !DILexicalBlock(scope: !792, file: !660, line: 50, column: 5)
!797 = !DILocation(line: 50, column: 25, scope: !796)
!798 = !DILocation(line: 50, column: 23, scope: !796)
!799 = !DILocation(line: 50, column: 5, scope: !792)
!800 = !DILocalVariable(name: "c", scope: !801, file: !660, line: 51, type: !87)
!801 = distinct !DILexicalBlock(scope: !802, file: !660, line: 51, column: 9)
!802 = distinct !DILexicalBlock(scope: !796, file: !660, line: 50, column: 40)
!803 = !DILocation(line: 51, column: 18, scope: !801)
!804 = !DILocation(line: 51, column: 14, scope: !801)
!805 = !DILocation(line: 51, column: 25, scope: !806)
!806 = distinct !DILexicalBlock(scope: !801, file: !660, line: 51, column: 9)
!807 = !DILocation(line: 51, column: 29, scope: !806)
!808 = !DILocation(line: 51, column: 27, scope: !806)
!809 = !DILocation(line: 51, column: 9, scope: !801)
!810 = !DILocalVariable(name: "k", scope: !811, file: !660, line: 52, type: !87)
!811 = distinct !DILexicalBlock(scope: !812, file: !660, line: 52, column: 13)
!812 = distinct !DILexicalBlock(scope: !806, file: !660, line: 51, column: 44)
!813 = !DILocation(line: 52, column: 22, scope: !811)
!814 = !DILocation(line: 52, column: 18, scope: !811)
!815 = !DILocation(line: 52, column: 29, scope: !816)
!816 = distinct !DILexicalBlock(scope: !811, file: !660, line: 52, column: 13)
!817 = !DILocation(line: 52, column: 33, scope: !816)
!818 = !DILocation(line: 52, column: 31, scope: !816)
!819 = !DILocation(line: 52, column: 13, scope: !811)
!820 = !DILocation(line: 53, column: 31, scope: !821)
!821 = distinct !DILexicalBlock(scope: !816, file: !660, line: 52, column: 54)
!822 = !DILocation(line: 53, column: 44, scope: !821)
!823 = !DILocation(line: 53, column: 53, scope: !821)
!824 = !DILocation(line: 53, column: 68, scope: !821)
!825 = !DILocation(line: 53, column: 72, scope: !821)
!826 = !DILocation(line: 53, column: 70, scope: !821)
!827 = !DILocation(line: 53, column: 86, scope: !821)
!828 = !DILocation(line: 53, column: 84, scope: !821)
!829 = !DILocation(line: 53, column: 65, scope: !821)
!830 = !DILocation(line: 53, column: 51, scope: !821)
!831 = !DILocation(line: 53, column: 90, scope: !821)
!832 = !DILocation(line: 53, column: 94, scope: !821)
!833 = !DILocation(line: 53, column: 98, scope: !821)
!834 = !DILocation(line: 53, column: 96, scope: !821)
!835 = !DILocation(line: 53, column: 109, scope: !821)
!836 = !DILocation(line: 53, column: 107, scope: !821)
!837 = !DILocation(line: 53, column: 113, scope: !821)
!838 = !DILocation(line: 53, column: 119, scope: !821)
!839 = !DILocation(line: 53, column: 134, scope: !821)
!840 = !DILocation(line: 53, column: 138, scope: !821)
!841 = !DILocation(line: 53, column: 136, scope: !821)
!842 = !DILocation(line: 53, column: 152, scope: !821)
!843 = !DILocation(line: 53, column: 150, scope: !821)
!844 = !DILocation(line: 53, column: 131, scope: !821)
!845 = !DILocation(line: 53, column: 117, scope: !821)
!846 = !DILocation(line: 53, column: 17, scope: !821)
!847 = !DILocation(line: 54, column: 13, scope: !821)
!848 = !DILocation(line: 52, column: 48, scope: !816)
!849 = !DILocation(line: 52, column: 13, scope: !816)
!850 = distinct !{!850, !819, !851, !148}
!851 = !DILocation(line: 54, column: 13, scope: !811)
!852 = !DILocation(line: 55, column: 9, scope: !812)
!853 = !DILocation(line: 51, column: 40, scope: !806)
!854 = !DILocation(line: 51, column: 9, scope: !806)
!855 = distinct !{!855, !809, !856, !148}
!856 = !DILocation(line: 55, column: 9, scope: !801)
!857 = !DILocation(line: 56, column: 5, scope: !802)
!858 = !DILocation(line: 50, column: 36, scope: !796)
!859 = !DILocation(line: 50, column: 5, scope: !796)
!860 = distinct !{!860, !799, !861, !148}
!861 = !DILocation(line: 56, column: 5, scope: !792)
!862 = !DILocation(line: 57, column: 1, scope: !774)
!863 = distinct !DISubprogram(name: "m_vec_mul_add", scope: !864, file: !864, line: 24, type: !865, scopeLine: 24, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !48, retainedNodes: !69)
!864 = !DIFile(filename: "../../src/generic/arithmetic_dynamic.h", directory: "")
!865 = !DISubroutineType(types: !866)
!866 = !{null, !87, !663, !51, !52}
!867 = !DILocalVariable(name: "m_vec_limbs", arg: 1, scope: !863, file: !864, line: 24, type: !87)
!868 = !DILocation(line: 24, column: 24, scope: !863)
!869 = !DILocalVariable(name: "in", arg: 2, scope: !863, file: !864, line: 24, type: !663)
!870 = !DILocation(line: 24, column: 53, scope: !863)
!871 = !DILocalVariable(name: "a", arg: 3, scope: !863, file: !864, line: 24, type: !51)
!872 = !DILocation(line: 24, column: 71, scope: !863)
!873 = !DILocalVariable(name: "acc", arg: 4, scope: !863, file: !864, line: 24, type: !52)
!874 = !DILocation(line: 24, column: 84, scope: !863)
!875 = !DILocalVariable(name: "i", scope: !876, file: !864, line: 25, type: !87)
!876 = distinct !DILexicalBlock(scope: !863, file: !864, line: 25, column: 5)
!877 = !DILocation(line: 25, column: 13, scope: !876)
!878 = !DILocation(line: 25, column: 9, scope: !876)
!879 = !DILocation(line: 25, column: 18, scope: !880)
!880 = distinct !DILexicalBlock(scope: !876, file: !864, line: 25, column: 5)
!881 = !DILocation(line: 25, column: 22, scope: !880)
!882 = !DILocation(line: 25, column: 20, scope: !880)
!883 = !DILocation(line: 25, column: 5, scope: !876)
!884 = !DILocation(line: 26, column: 33, scope: !885)
!885 = distinct !DILexicalBlock(scope: !880, file: !864, line: 25, column: 39)
!886 = !DILocation(line: 26, column: 36, scope: !885)
!887 = !DILocation(line: 26, column: 40, scope: !885)
!888 = !DILocation(line: 26, column: 19, scope: !885)
!889 = !DILocation(line: 26, column: 9, scope: !885)
!890 = !DILocation(line: 26, column: 13, scope: !885)
!891 = !DILocation(line: 26, column: 16, scope: !885)
!892 = !DILocation(line: 27, column: 5, scope: !885)
!893 = !DILocation(line: 25, column: 36, scope: !880)
!894 = !DILocation(line: 25, column: 5, scope: !880)
!895 = distinct !{!895, !883, !896, !148}
!896 = !DILocation(line: 27, column: 5, scope: !876)
!897 = !DILocation(line: 28, column: 1, scope: !863)
!898 = distinct !DISubprogram(name: "gf16v_mul_u64", scope: !899, file: !899, line: 96, type: !900, scopeLine: 96, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !48, retainedNodes: !69)
!899 = !DIFile(filename: "../../src/simple_arithmetic.h", directory: "")
!900 = !DISubroutineType(types: !901)
!901 = !{!53, !53, !187}
!902 = !DILocalVariable(name: "a", arg: 1, scope: !898, file: !899, line: 96, type: !53)
!903 = !DILocation(line: 96, column: 48, scope: !898)
!904 = !DILocalVariable(name: "b", arg: 2, scope: !898, file: !899, line: 96, type: !187)
!905 = !DILocation(line: 96, column: 59, scope: !898)
!906 = !DILocalVariable(name: "mask_msb", scope: !898, file: !899, line: 97, type: !53)
!907 = !DILocation(line: 97, column: 14, scope: !898)
!908 = !DILocalVariable(name: "a_msb", scope: !898, file: !899, line: 98, type: !53)
!909 = !DILocation(line: 98, column: 14, scope: !898)
!910 = !DILocalVariable(name: "a64", scope: !898, file: !899, line: 99, type: !53)
!911 = !DILocation(line: 99, column: 14, scope: !898)
!912 = !DILocation(line: 99, column: 20, scope: !898)
!913 = !DILocalVariable(name: "b32", scope: !898, file: !899, line: 101, type: !53)
!914 = !DILocation(line: 101, column: 14, scope: !898)
!915 = !DILocation(line: 101, column: 20, scope: !898)
!916 = !DILocation(line: 101, column: 24, scope: !898)
!917 = !DILocation(line: 101, column: 22, scope: !898)
!918 = !DILocalVariable(name: "r64", scope: !898, file: !899, line: 105, type: !53)
!919 = !DILocation(line: 105, column: 14, scope: !898)
!920 = !DILocation(line: 105, column: 20, scope: !898)
!921 = !DILocation(line: 105, column: 27, scope: !898)
!922 = !DILocation(line: 105, column: 31, scope: !898)
!923 = !DILocation(line: 105, column: 24, scope: !898)
!924 = !DILocation(line: 107, column: 13, scope: !898)
!925 = !DILocation(line: 107, column: 19, scope: !898)
!926 = !DILocation(line: 107, column: 17, scope: !898)
!927 = !DILocation(line: 107, column: 11, scope: !898)
!928 = !DILocation(line: 108, column: 12, scope: !898)
!929 = !DILocation(line: 108, column: 9, scope: !898)
!930 = !DILocation(line: 109, column: 12, scope: !898)
!931 = !DILocation(line: 109, column: 16, scope: !898)
!932 = !DILocation(line: 109, column: 26, scope: !898)
!933 = !DILocation(line: 109, column: 32, scope: !898)
!934 = !DILocation(line: 109, column: 38, scope: !898)
!935 = !DILocation(line: 109, column: 22, scope: !898)
!936 = !DILocation(line: 109, column: 9, scope: !898)
!937 = !DILocation(line: 110, column: 13, scope: !898)
!938 = !DILocation(line: 110, column: 22, scope: !898)
!939 = !DILocation(line: 110, column: 26, scope: !898)
!940 = !DILocation(line: 110, column: 32, scope: !898)
!941 = !DILocation(line: 110, column: 18, scope: !898)
!942 = !DILocation(line: 110, column: 9, scope: !898)
!943 = !DILocation(line: 112, column: 13, scope: !898)
!944 = !DILocation(line: 112, column: 19, scope: !898)
!945 = !DILocation(line: 112, column: 17, scope: !898)
!946 = !DILocation(line: 112, column: 11, scope: !898)
!947 = !DILocation(line: 113, column: 12, scope: !898)
!948 = !DILocation(line: 113, column: 9, scope: !898)
!949 = !DILocation(line: 114, column: 12, scope: !898)
!950 = !DILocation(line: 114, column: 16, scope: !898)
!951 = !DILocation(line: 114, column: 26, scope: !898)
!952 = !DILocation(line: 114, column: 32, scope: !898)
!953 = !DILocation(line: 114, column: 38, scope: !898)
!954 = !DILocation(line: 114, column: 22, scope: !898)
!955 = !DILocation(line: 114, column: 9, scope: !898)
!956 = !DILocation(line: 115, column: 13, scope: !898)
!957 = !DILocation(line: 115, column: 22, scope: !898)
!958 = !DILocation(line: 115, column: 26, scope: !898)
!959 = !DILocation(line: 115, column: 32, scope: !898)
!960 = !DILocation(line: 115, column: 18, scope: !898)
!961 = !DILocation(line: 115, column: 9, scope: !898)
!962 = !DILocation(line: 117, column: 13, scope: !898)
!963 = !DILocation(line: 117, column: 19, scope: !898)
!964 = !DILocation(line: 117, column: 17, scope: !898)
!965 = !DILocation(line: 117, column: 11, scope: !898)
!966 = !DILocation(line: 118, column: 12, scope: !898)
!967 = !DILocation(line: 118, column: 9, scope: !898)
!968 = !DILocation(line: 119, column: 12, scope: !898)
!969 = !DILocation(line: 119, column: 16, scope: !898)
!970 = !DILocation(line: 119, column: 26, scope: !898)
!971 = !DILocation(line: 119, column: 32, scope: !898)
!972 = !DILocation(line: 119, column: 38, scope: !898)
!973 = !DILocation(line: 119, column: 22, scope: !898)
!974 = !DILocation(line: 119, column: 9, scope: !898)
!975 = !DILocation(line: 120, column: 13, scope: !898)
!976 = !DILocation(line: 120, column: 22, scope: !898)
!977 = !DILocation(line: 120, column: 26, scope: !898)
!978 = !DILocation(line: 120, column: 32, scope: !898)
!979 = !DILocation(line: 120, column: 18, scope: !898)
!980 = !DILocation(line: 120, column: 9, scope: !898)
!981 = !DILocation(line: 122, column: 12, scope: !898)
!982 = !DILocation(line: 122, column: 5, scope: !898)
!983 = distinct !DISubprogram(name: "mul_add_m_upper_triangular_mat_x_mat", scope: !660, file: !660, line: 16, type: !984, scopeLine: 17, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !48, retainedNodes: !69)
!984 = !DISubroutineType(types: !985)
!985 = !{null, !463, !663, !102, !52, !463, !463, !463, !463}
!986 = !DILocalVariable(name: "m_vec_limbs", arg: 1, scope: !983, file: !660, line: 16, type: !463)
!987 = !DILocation(line: 16, column: 53, scope: !983)
!988 = !DILocalVariable(name: "bs_mat", arg: 2, scope: !983, file: !660, line: 16, type: !663)
!989 = !DILocation(line: 16, column: 82, scope: !983)
!990 = !DILocalVariable(name: "mat", arg: 3, scope: !983, file: !660, line: 16, type: !102)
!991 = !DILocation(line: 16, column: 111, scope: !983)
!992 = !DILocalVariable(name: "acc", arg: 4, scope: !983, file: !660, line: 16, type: !52)
!993 = !DILocation(line: 16, column: 126, scope: !983)
!994 = !DILocalVariable(name: "bs_mat_rows", arg: 5, scope: !983, file: !660, line: 17, type: !463)
!995 = !DILocation(line: 17, column: 53, scope: !983)
!996 = !DILocalVariable(name: "bs_mat_cols", arg: 6, scope: !983, file: !660, line: 17, type: !463)
!997 = !DILocation(line: 17, column: 76, scope: !983)
!998 = !DILocalVariable(name: "mat_cols", arg: 7, scope: !983, file: !660, line: 17, type: !463)
!999 = !DILocation(line: 17, column: 99, scope: !983)
!1000 = !DILocalVariable(name: "triangular", arg: 8, scope: !983, file: !660, line: 17, type: !463)
!1001 = !DILocation(line: 17, column: 119, scope: !983)
!1002 = !DILocalVariable(name: "bs_mat_entries_used", scope: !983, file: !660, line: 19, type: !87)
!1003 = !DILocation(line: 19, column: 9, scope: !983)
!1004 = !DILocalVariable(name: "r", scope: !1005, file: !660, line: 20, type: !87)
!1005 = distinct !DILexicalBlock(scope: !983, file: !660, line: 20, column: 5)
!1006 = !DILocation(line: 20, column: 14, scope: !1005)
!1007 = !DILocation(line: 20, column: 10, scope: !1005)
!1008 = !DILocation(line: 20, column: 21, scope: !1009)
!1009 = distinct !DILexicalBlock(scope: !1005, file: !660, line: 20, column: 5)
!1010 = !DILocation(line: 20, column: 25, scope: !1009)
!1011 = !DILocation(line: 20, column: 23, scope: !1009)
!1012 = !DILocation(line: 20, column: 5, scope: !1005)
!1013 = !DILocalVariable(name: "c", scope: !1014, file: !660, line: 21, type: !87)
!1014 = distinct !DILexicalBlock(scope: !1015, file: !660, line: 21, column: 9)
!1015 = distinct !DILexicalBlock(scope: !1009, file: !660, line: 20, column: 43)
!1016 = !DILocation(line: 21, column: 18, scope: !1014)
!1017 = !DILocation(line: 21, column: 22, scope: !1014)
!1018 = !DILocation(line: 21, column: 35, scope: !1014)
!1019 = !DILocation(line: 21, column: 33, scope: !1014)
!1020 = !DILocation(line: 21, column: 14, scope: !1014)
!1021 = !DILocation(line: 21, column: 38, scope: !1022)
!1022 = distinct !DILexicalBlock(scope: !1014, file: !660, line: 21, column: 9)
!1023 = !DILocation(line: 21, column: 42, scope: !1022)
!1024 = !DILocation(line: 21, column: 40, scope: !1022)
!1025 = !DILocation(line: 21, column: 9, scope: !1014)
!1026 = !DILocalVariable(name: "k", scope: !1027, file: !660, line: 22, type: !87)
!1027 = distinct !DILexicalBlock(scope: !1028, file: !660, line: 22, column: 13)
!1028 = distinct !DILexicalBlock(scope: !1022, file: !660, line: 21, column: 60)
!1029 = !DILocation(line: 22, column: 22, scope: !1027)
!1030 = !DILocation(line: 22, column: 18, scope: !1027)
!1031 = !DILocation(line: 22, column: 29, scope: !1032)
!1032 = distinct !DILexicalBlock(scope: !1027, file: !660, line: 22, column: 13)
!1033 = !DILocation(line: 22, column: 33, scope: !1032)
!1034 = !DILocation(line: 22, column: 31, scope: !1032)
!1035 = !DILocation(line: 22, column: 13, scope: !1027)
!1036 = !DILocation(line: 23, column: 31, scope: !1037)
!1037 = distinct !DILexicalBlock(scope: !1032, file: !660, line: 22, column: 51)
!1038 = !DILocation(line: 23, column: 44, scope: !1037)
!1039 = !DILocation(line: 23, column: 53, scope: !1037)
!1040 = !DILocation(line: 23, column: 67, scope: !1037)
!1041 = !DILocation(line: 23, column: 65, scope: !1037)
!1042 = !DILocation(line: 23, column: 51, scope: !1037)
!1043 = !DILocation(line: 23, column: 88, scope: !1037)
!1044 = !DILocation(line: 23, column: 92, scope: !1037)
!1045 = !DILocation(line: 23, column: 96, scope: !1037)
!1046 = !DILocation(line: 23, column: 94, scope: !1037)
!1047 = !DILocation(line: 23, column: 107, scope: !1037)
!1048 = !DILocation(line: 23, column: 105, scope: !1037)
!1049 = !DILocation(line: 23, column: 111, scope: !1037)
!1050 = !DILocation(line: 23, column: 117, scope: !1037)
!1051 = !DILocation(line: 23, column: 132, scope: !1037)
!1052 = !DILocation(line: 23, column: 136, scope: !1037)
!1053 = !DILocation(line: 23, column: 134, scope: !1037)
!1054 = !DILocation(line: 23, column: 147, scope: !1037)
!1055 = !DILocation(line: 23, column: 145, scope: !1037)
!1056 = !DILocation(line: 23, column: 129, scope: !1037)
!1057 = !DILocation(line: 23, column: 115, scope: !1037)
!1058 = !DILocation(line: 23, column: 17, scope: !1037)
!1059 = !DILocation(line: 24, column: 13, scope: !1037)
!1060 = !DILocation(line: 22, column: 45, scope: !1032)
!1061 = !DILocation(line: 22, column: 13, scope: !1032)
!1062 = distinct !{!1062, !1035, !1063, !148}
!1063 = !DILocation(line: 24, column: 13, scope: !1027)
!1064 = !DILocation(line: 25, column: 33, scope: !1028)
!1065 = !DILocation(line: 26, column: 9, scope: !1028)
!1066 = !DILocation(line: 21, column: 56, scope: !1022)
!1067 = !DILocation(line: 21, column: 9, scope: !1022)
!1068 = distinct !{!1068, !1025, !1069, !148}
!1069 = !DILocation(line: 26, column: 9, scope: !1014)
!1070 = !DILocation(line: 27, column: 5, scope: !1015)
!1071 = !DILocation(line: 20, column: 39, scope: !1009)
!1072 = !DILocation(line: 20, column: 5, scope: !1009)
!1073 = distinct !{!1073, !1012, !1074, !148}
!1074 = !DILocation(line: 27, column: 5, scope: !1005)
!1075 = !DILocation(line: 28, column: 1, scope: !983)
!1076 = distinct !DISubprogram(name: "unpack_m_vecs", scope: !66, file: !66, line: 262, type: !1077, scopeLine: 262, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !48, retainedNodes: !69)
!1077 = !DISubroutineType(types: !1078)
!1078 = !{null, !102, !52, !87, !87}
!1079 = !DILocalVariable(name: "in", arg: 1, scope: !1076, file: !66, line: 262, type: !102)
!1080 = !DILocation(line: 262, column: 48, scope: !1076)
!1081 = !DILocalVariable(name: "out", arg: 2, scope: !1076, file: !66, line: 262, type: !52)
!1082 = !DILocation(line: 262, column: 62, scope: !1076)
!1083 = !DILocalVariable(name: "vecs", arg: 3, scope: !1076, file: !66, line: 262, type: !87)
!1084 = !DILocation(line: 262, column: 71, scope: !1076)
!1085 = !DILocalVariable(name: "m", arg: 4, scope: !1076, file: !66, line: 262, type: !87)
!1086 = !DILocation(line: 262, column: 81, scope: !1076)
!1087 = !DILocalVariable(name: "m_vec_limbs", scope: !1076, file: !66, line: 263, type: !463)
!1088 = !DILocation(line: 263, column: 15, scope: !1076)
!1089 = !DILocation(line: 263, column: 30, scope: !1076)
!1090 = !DILocation(line: 263, column: 32, scope: !1076)
!1091 = !DILocation(line: 263, column: 38, scope: !1076)
!1092 = !DILocalVariable(name: "_out", scope: !1076, file: !66, line: 264, type: !61)
!1093 = !DILocation(line: 264, column: 20, scope: !1076)
!1094 = !DILocation(line: 264, column: 45, scope: !1076)
!1095 = !DILocalVariable(name: "tmp", scope: !1076, file: !66, line: 265, type: !1096)
!1096 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 576, elements: !1097)
!1097 = !{!1098}
!1098 = !DISubrange(count: 9)
!1099 = !DILocation(line: 265, column: 14, scope: !1076)
!1100 = !DILocalVariable(name: "i", scope: !1101, file: !66, line: 266, type: !87)
!1101 = distinct !DILexicalBlock(scope: !1076, file: !66, line: 266, column: 5)
!1102 = !DILocation(line: 266, column: 14, scope: !1101)
!1103 = !DILocation(line: 266, column: 18, scope: !1101)
!1104 = !DILocation(line: 266, column: 22, scope: !1101)
!1105 = !DILocation(line: 266, column: 10, scope: !1101)
!1106 = !DILocation(line: 266, column: 26, scope: !1107)
!1107 = distinct !DILexicalBlock(scope: !1101, file: !66, line: 266, column: 5)
!1108 = !DILocation(line: 266, column: 28, scope: !1107)
!1109 = !DILocation(line: 266, column: 5, scope: !1101)
!1110 = !DILocation(line: 268, column: 16, scope: !1111)
!1111 = distinct !DILexicalBlock(scope: !1107, file: !66, line: 267, column: 5)
!1112 = !DILocation(line: 268, column: 21, scope: !1111)
!1113 = !DILocation(line: 268, column: 26, scope: !1111)
!1114 = !DILocation(line: 268, column: 28, scope: !1111)
!1115 = !DILocation(line: 268, column: 27, scope: !1111)
!1116 = !DILocation(line: 268, column: 29, scope: !1111)
!1117 = !DILocation(line: 268, column: 24, scope: !1111)
!1118 = !DILocation(line: 268, column: 33, scope: !1111)
!1119 = !DILocation(line: 268, column: 34, scope: !1111)
!1120 = !DILocation(line: 268, column: 9, scope: !1111)
!1121 = !DILocation(line: 269, column: 16, scope: !1111)
!1122 = !DILocation(line: 269, column: 23, scope: !1111)
!1123 = !DILocation(line: 269, column: 25, scope: !1111)
!1124 = !DILocation(line: 269, column: 24, scope: !1111)
!1125 = !DILocation(line: 269, column: 36, scope: !1111)
!1126 = !DILocation(line: 269, column: 21, scope: !1111)
!1127 = !DILocation(line: 269, column: 55, scope: !1111)
!1128 = !DILocation(line: 269, column: 60, scope: !1111)
!1129 = !DILocation(line: 269, column: 71, scope: !1111)
!1130 = !DILocation(line: 269, column: 9, scope: !1111)
!1131 = !DILocation(line: 270, column: 5, scope: !1111)
!1132 = !DILocation(line: 266, column: 35, scope: !1107)
!1133 = !DILocation(line: 266, column: 5, scope: !1107)
!1134 = distinct !{!1134, !1109, !1135, !148}
!1135 = !DILocation(line: 270, column: 5, scope: !1101)
!1136 = !DILocation(line: 271, column: 1, scope: !1076)
!1137 = distinct !DISubprogram(name: "mayo_expand_sk", scope: !66, file: !66, line: 310, type: !1138, scopeLine: 311, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !48, retainedNodes: !69)
!1138 = !DISubroutineType(types: !1139)
!1139 = !{!87, !382, !102, !1140}
!1140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1141, size: 32)
!1141 = !DIDerivedType(tag: DW_TAG_typedef, name: "sk_t", file: !93, line: 294, baseType: !1142)
!1142 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sk_t", file: !93, line: 291, size: 7257920, elements: !1143)
!1143 = !{!1144, !1145}
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !1142, file: !93, line: 292, baseType: !182, size: 7238592)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "O", scope: !1142, file: !93, line: 293, baseType: !186, size: 19312, offset: 7238592)
!1146 = !DILocalVariable(name: "p", arg: 1, scope: !1137, file: !66, line: 310, type: !382)
!1147 = !DILocation(line: 310, column: 41, scope: !1137)
!1148 = !DILocalVariable(name: "csk", arg: 2, scope: !1137, file: !66, line: 310, type: !102)
!1149 = !DILocation(line: 310, column: 65, scope: !1137)
!1150 = !DILocalVariable(name: "sk", arg: 3, scope: !1137, file: !66, line: 311, type: !1140)
!1151 = !DILocation(line: 311, column: 26, scope: !1137)
!1152 = !DILocalVariable(name: "ret", scope: !1137, file: !66, line: 312, type: !87)
!1153 = !DILocation(line: 312, column: 9, scope: !1137)
!1154 = !DILocalVariable(name: "S", scope: !1137, file: !66, line: 313, type: !446)
!1155 = !DILocation(line: 313, column: 19, scope: !1137)
!1156 = !DILocalVariable(name: "P", scope: !1137, file: !66, line: 314, type: !52)
!1157 = !DILocation(line: 314, column: 15, scope: !1137)
!1158 = !DILocation(line: 314, column: 19, scope: !1137)
!1159 = !DILocation(line: 314, column: 23, scope: !1137)
!1160 = !DILocalVariable(name: "O", scope: !1137, file: !66, line: 315, type: !61)
!1161 = !DILocation(line: 315, column: 20, scope: !1137)
!1162 = !DILocation(line: 315, column: 24, scope: !1137)
!1163 = !DILocation(line: 315, column: 28, scope: !1137)
!1164 = !DILocalVariable(name: "param_o", scope: !1137, file: !66, line: 317, type: !463)
!1165 = !DILocation(line: 317, column: 15, scope: !1137)
!1166 = !DILocation(line: 317, column: 33, scope: !1137)
!1167 = !DILocation(line: 317, column: 25, scope: !1137)
!1168 = !DILocalVariable(name: "param_v", scope: !1137, file: !66, line: 318, type: !463)
!1169 = !DILocation(line: 318, column: 15, scope: !1137)
!1170 = !DILocation(line: 318, column: 33, scope: !1137)
!1171 = !DILocation(line: 318, column: 25, scope: !1137)
!1172 = !DILocalVariable(name: "param_O_bytes", scope: !1137, file: !66, line: 319, type: !463)
!1173 = !DILocation(line: 319, column: 15, scope: !1137)
!1174 = !DILocation(line: 319, column: 45, scope: !1137)
!1175 = !DILocation(line: 319, column: 31, scope: !1137)
!1176 = !DILocalVariable(name: "param_pk_seed_bytes", scope: !1137, file: !66, line: 320, type: !463)
!1177 = !DILocation(line: 320, column: 15, scope: !1137)
!1178 = !DILocation(line: 320, column: 57, scope: !1137)
!1179 = !DILocation(line: 320, column: 37, scope: !1137)
!1180 = !DILocalVariable(name: "param_sk_seed_bytes", scope: !1137, file: !66, line: 321, type: !463)
!1181 = !DILocation(line: 321, column: 15, scope: !1137)
!1182 = !DILocation(line: 321, column: 57, scope: !1137)
!1183 = !DILocation(line: 321, column: 37, scope: !1137)
!1184 = !DILocalVariable(name: "seed_sk", scope: !1137, file: !66, line: 323, type: !102)
!1185 = !DILocation(line: 323, column: 26, scope: !1137)
!1186 = !DILocation(line: 323, column: 36, scope: !1137)
!1187 = !DILocalVariable(name: "seed_pk", scope: !1137, file: !66, line: 324, type: !61)
!1188 = !DILocation(line: 324, column: 20, scope: !1137)
!1189 = !DILocation(line: 324, column: 30, scope: !1137)
!1190 = !DILocation(line: 326, column: 14, scope: !1137)
!1191 = !DILocation(line: 326, column: 17, scope: !1137)
!1192 = !DILocation(line: 326, column: 39, scope: !1137)
!1193 = !DILocation(line: 326, column: 37, scope: !1137)
!1194 = !DILocation(line: 326, column: 54, scope: !1137)
!1195 = !DILocation(line: 327, column: 14, scope: !1137)
!1196 = !DILocation(line: 326, column: 5, scope: !1137)
!1197 = !DILocation(line: 328, column: 12, scope: !1137)
!1198 = !DILocation(line: 328, column: 16, scope: !1137)
!1199 = !DILocation(line: 328, column: 14, scope: !1137)
!1200 = !DILocation(line: 328, column: 37, scope: !1137)
!1201 = !DILocation(line: 328, column: 40, scope: !1137)
!1202 = !DILocation(line: 328, column: 50, scope: !1137)
!1203 = !DILocation(line: 328, column: 48, scope: !1137)
!1204 = !DILocation(line: 328, column: 5, scope: !1137)
