; ModuleID = 'composite'
source_filename = "composite"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "arm-unknown-none-eabi"

%struct.sk_t = type { [106713 x i64], [1704 x i8] }

@__const.example_mayo.msg = private unnamed_addr constant <{ i8, [31 x i8] }> <{ i8 14, [31 x i8] zeroinitializer }>, align 1
@.str = private unnamed_addr constant [17 x i8] c"Example with %s\0A\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [7 x i8] c"MAYO_5\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [17 x i8] c"mayo_keypair -> \00", align 1, !dbg !12
@.str.3 = private unnamed_addr constant [6 x i8] c"FAIL\0A\00", align 1, !dbg !14
@.str.4 = private unnamed_addr constant [4 x i8] c"OK\0A\00", align 1, !dbg !19
@.str.5 = private unnamed_addr constant [19 x i8] c"mayo_expand_sk -> \00", align 1, !dbg !24
@.str.6 = private unnamed_addr constant [19 x i8] c"mayo_expand_pk -> \00", align 1, !dbg !29
@.str.7 = private unnamed_addr constant [14 x i8] c"mayo_sign -> \00", align 1, !dbg !31
@.str.8 = private unnamed_addr constant [39 x i8] c"mayo_open (with correct signature) -> \00", align 1, !dbg !36
@.str.9 = private unnamed_addr constant [41 x i8] c"mayo_verify (with correct signature) -> \00", align 1, !dbg !41
@f_tail = internal unnamed_addr constant [4 x i8] c"\04\00\08\01", align 1, !dbg !46
@pqmayo_MAYO_5_ref_uint32_t_blocker = dso_local local_unnamed_addr global i32 0, align 4, !dbg !82

!60 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 32)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !54, line: 48, baseType: !63)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !56, line: 79, baseType: !60)
!64 = !{!46, !65, !73, !75, !77}
!65 = !DIGlobalVariableExpression(var: !66, expr: !DIExpression())
!66 = distinct !DIGlobalVariable(name: "even_nibbles", scope: !67, file: !68, line: 112, type: !72, isLocal: true, isDefinition: true)
!67 = distinct !DISubprogram(name: "transpose_16x16_nibbles", scope: !68, file: !68, line: 111, type: !69, scopeLine: 111, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !48, retainedNodes: !71)
!68 = !DIFile(filename: "../../../src/mayo.c", directory: "/home/siddhesh/Desktop/MAYO-LLVM/llvm-apps/mayo_pass/build")
!69 = !DISubroutineType(types: !70)
!70 = !{null, !52}
!71 = !{}
!72 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !53)
!73 = !DIGlobalVariableExpression(var: !74, expr: !DIExpression())
!74 = distinct !DIGlobalVariable(name: "even_bytes", scope: !67, file: !68, line: 113, type: !72, isLocal: true, isDefinition: true)
!75 = !DIGlobalVariableExpression(var: !76, expr: !DIExpression())
!76 = distinct !DIGlobalVariable(name: "even_2bytes", scope: !67, file: !68, line: 114, type: !72, isLocal: true, isDefinition: true)
!77 = !DIGlobalVariableExpression(var: !78, expr: !DIExpression())
!78 = distinct !DIGlobalVariable(name: "even_half", scope: !67, file: !68, line: 115, type: !72, isLocal: true, isDefinition: true)
!79 = !DIFile(filename: "../../../include/mayo.h", directory: "/home/siddhesh/Desktop/MAYO-LLVM/llvm-apps/mayo_pass/build")
!80 = !DICompositeType(tag: DW_TAG_array_type, baseType: !81, size: 32, elements: !22)
!81 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !51)
!82 = !DIGlobalVariableExpression(var: !83, expr: !DIExpression())
!83 = distinct !DIGlobalVariable(name: "pqmayo_MAYO_5_ref_uint32_t_blocker", scope: !84, file: !99, line: 126, type: !104, isLocal: false, isDefinition: true)
!84 = distinct !DICompileUnit(language: DW_LANG_C11, file: !49, producer: "Ubuntu clang version 20.1.2 (0ubuntu1~24.04.2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !85, globals: !96, splitDebugInlining: false, nameTableKind: None)
!85 = !{!53, !86, !87, !61, !62, !90, !91, !94}
!86 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !54, line: 56, baseType: !88)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !56, line: 103, baseType: !89)
!89 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 32)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !54, line: 20, baseType: !92)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !56, line: 41, baseType: !93)
!93 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !54, line: 44, baseType: !95)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !56, line: 77, baseType: !86)
!96 = !{!82, !97, !101}
!97 = !DIGlobalVariableExpression(var: !98, expr: !DIExpression())
!98 = distinct !DIGlobalVariable(name: "pqmayo_MAYO_5_ref_uint64_t_blocker", scope: !84, file: !99, line: 127, type: !100, isLocal: false, isDefinition: true)
!99 = !DIFile(filename: "../../../src/arithmetic.c", directory: "/home/siddhesh/Desktop/MAYO-LLVM/llvm-apps/mayo_pass/build")
!100 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !53)
!101 = !DIGlobalVariableExpression(var: !102, expr: !DIExpression())
!102 = distinct !DIGlobalVariable(name: "pqmayo_MAYO_5_ref_unsigned_char_blocker", scope: !84, file: !99, line: 128, type: !103, isLocal: false, isDefinition: true)
!103 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !51)
!104 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !62)
!105 = distinct !DICompileUnit(language: DW_LANG_C11, file: !106, producer: "Ubuntu clang version 20.1.2 (0ubuntu1~24.04.2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, globals: !107, splitDebugInlining: false, nameTableKind: None)
!106 = !DIFile(filename: "../<stdin>", directory: "/home/siddhesh/Desktop/MAYO-LLVM/llvm-apps/mayo_pass/build")
!107 = !{!0, !7, !12, !14, !19, !24, !29, !31, !36, !41}
!108 = !{!"Ubuntu clang version 20.1.2 (0ubuntu1~24.04.2)"}
!109 = !{i32 2, !"Debug Info Version", i32 3}
!110 = !{i32 1, !"wchar_size", i32 4}
!111 = !{i32 1, !"min_enum_size", i32 4}
!112 = !{i32 1, !"Code Model", i32 1}
!113 = distinct !DISubprogram(name: "main", scope: !2, file: !2, line: 138, type: !114, scopeLine: 138, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !105)
!114 = !DISubroutineType(types: !115)
!115 = !{!86}
!116 = !DILocalVariable(name: "p", arg: 1, scope: !117, file: !2, line: 25, type: !120)
!117 = distinct !DISubprogram(name: "example_mayo", scope: !2, file: !2, line: 25, type: !118, scopeLine: 25, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !105, retainedNodes: !71)
!118 = !DISubroutineType(types: !119)
!119 = !{!86, !120}
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 32)
!121 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !122)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "mayo_params_t", file: !79, line: 289, baseType: !123)
!123 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !79, line: 265, size: 736, elements: !124)
!124 = !{!125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !123, file: !79, line: 266, baseType: !86, size: 32)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !123, file: !79, line: 267, baseType: !86, size: 32, offset: 32)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "o", scope: !123, file: !79, line: 268, baseType: !86, size: 32, offset: 64)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "k", scope: !123, file: !79, line: 269, baseType: !86, size: 32, offset: 96)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !123, file: !79, line: 270, baseType: !86, size: 32, offset: 128)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "f_tail", scope: !123, file: !79, line: 271, baseType: !90, size: 32, offset: 160)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "m_bytes", scope: !123, file: !79, line: 272, baseType: !86, size: 32, offset: 192)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "O_bytes", scope: !123, file: !79, line: 273, baseType: !86, size: 32, offset: 224)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "v_bytes", scope: !123, file: !79, line: 274, baseType: !86, size: 32, offset: 256)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "r_bytes", scope: !123, file: !79, line: 275, baseType: !86, size: 32, offset: 288)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "R_bytes", scope: !123, file: !79, line: 276, baseType: !86, size: 32, offset: 320)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "P1_bytes", scope: !123, file: !79, line: 277, baseType: !86, size: 32, offset: 352)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "P2_bytes", scope: !123, file: !79, line: 278, baseType: !86, size: 32, offset: 384)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "P3_bytes", scope: !123, file: !79, line: 279, baseType: !86, size: 32, offset: 416)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "csk_bytes", scope: !123, file: !79, line: 280, baseType: !86, size: 32, offset: 448)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "cpk_bytes", scope: !123, file: !79, line: 281, baseType: !86, size: 32, offset: 480)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "sig_bytes", scope: !123, file: !79, line: 282, baseType: !86, size: 32, offset: 512)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "salt_bytes", scope: !123, file: !79, line: 283, baseType: !86, size: 32, offset: 544)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "sk_seed_bytes", scope: !123, file: !79, line: 284, baseType: !86, size: 32, offset: 576)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "digest_bytes", scope: !123, file: !79, line: 285, baseType: !86, size: 32, offset: 608)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "pk_seed_bytes", scope: !123, file: !79, line: 286, baseType: !86, size: 32, offset: 640)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "m_vec_limbs", scope: !123, file: !79, line: 287, baseType: !86, size: 32, offset: 672)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !123, file: !79, line: 288, baseType: !148, size: 32, offset: 704)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 32)
!149 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!150 = !DILocation(line: 0, scope: !117, inlinedAt: !151)
!151 = distinct !DILocation(line: 148, column: 12, scope: !113)
!152 = !DILocalVariable(name: "msglen", scope: !117, file: !2, line: 27, type: !58)
!153 = !DILocalVariable(name: "smlen", scope: !117, file: !2, line: 28, type: !58)
!154 = !DILocation(line: 30, column: 26, scope: !117, inlinedAt: !151)
!155 = !DILocalVariable(name: "pk", scope: !117, file: !2, line: 30, type: !61)
!156 = !DILocation(line: 31, column: 26, scope: !117, inlinedAt: !151)
!157 = !DILocalVariable(name: "sk", scope: !117, file: !2, line: 31, type: !61)
!158 = !DILocation(line: 33, column: 21, scope: !117, inlinedAt: !151)
!159 = !DILocalVariable(name: "epk", scope: !117, file: !2, line: 33, type: !52)
!160 = !DILocation(line: 34, column: 17, scope: !117, inlinedAt: !151)
!161 = !DILocalVariable(name: "esk", scope: !117, file: !2, line: 34, type: !162)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 32)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "sk_t", file: !79, line: 294, baseType: !164)
!164 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sk_t", file: !79, line: 291, size: 6843264, elements: !165)
!165 = !{!166, !170}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !164, file: !79, line: 292, baseType: !167, size: 6829632)
!167 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 6829632, elements: !168)
!168 = !{!169}
!169 = !DISubrange(count: 106713)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "O", scope: !164, file: !79, line: 293, baseType: !171, size: 13632, offset: 6829632)
!171 = !DICompositeType(tag: DW_TAG_array_type, baseType: !172, size: 13632, elements: !174)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !54, line: 24, baseType: !173)
!173 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !56, line: 43, baseType: !51)
!174 = !{!175}
!175 = !DISubrange(count: 1704)
!176 = !DILocation(line: 36, column: 26, scope: !117, inlinedAt: !151)
!177 = !DILocalVariable(name: "sig", scope: !117, file: !2, line: 36, type: !61)
!178 = !DILocalVariable(name: "msg", scope: !117, file: !2, line: 38, type: !179)
!179 = !DICompositeType(tag: DW_TAG_array_type, baseType: !51, size: 256, elements: !180)
!180 = !{!181}
!181 = !DISubrange(count: 32)
!182 = !DILocation(line: 38, column: 19, scope: !117, inlinedAt: !151)
!183 = !DILocalVariable(name: "msg2", scope: !117, file: !2, line: 39, type: !179)
!184 = !DILocation(line: 39, column: 19, scope: !117, inlinedAt: !151)
!185 = !DILocation(line: 41, column: 5, scope: !117, inlinedAt: !151)
!186 = !DILocation(line: 43, column: 5, scope: !117, inlinedAt: !151)
!187 = !DILocalVariable(name: "p", arg: 1, scope: !188, file: !68, line: 298, type: !191)
!188 = distinct !DISubprogram(name: "pqmayo_MAYO_5_ref_mayo_keypair", scope: !68, file: !68, line: 298, type: !189, scopeLine: 298, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !48, retainedNodes: !71)
!189 = !DISubroutineType(types: !190)
!190 = !{!86, !191, !61, !61}
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 32)
!192 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !193)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "mayo_params_t", file: !79, line: 289, baseType: !194)
!194 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !79, line: 265, size: 736, elements: !195)
!195 = !{!196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !194, file: !79, line: 266, baseType: !86, size: 32)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !194, file: !79, line: 267, baseType: !86, size: 32, offset: 32)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "o", scope: !194, file: !79, line: 268, baseType: !86, size: 32, offset: 64)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "k", scope: !194, file: !79, line: 269, baseType: !86, size: 32, offset: 96)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !194, file: !79, line: 270, baseType: !86, size: 32, offset: 128)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "f_tail", scope: !194, file: !79, line: 271, baseType: !90, size: 32, offset: 160)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "m_bytes", scope: !194, file: !79, line: 272, baseType: !86, size: 32, offset: 192)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "O_bytes", scope: !194, file: !79, line: 273, baseType: !86, size: 32, offset: 224)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "v_bytes", scope: !194, file: !79, line: 274, baseType: !86, size: 32, offset: 256)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "r_bytes", scope: !194, file: !79, line: 275, baseType: !86, size: 32, offset: 288)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "R_bytes", scope: !194, file: !79, line: 276, baseType: !86, size: 32, offset: 320)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "P1_bytes", scope: !194, file: !79, line: 277, baseType: !86, size: 32, offset: 352)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "P2_bytes", scope: !194, file: !79, line: 278, baseType: !86, size: 32, offset: 384)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "P3_bytes", scope: !194, file: !79, line: 279, baseType: !86, size: 32, offset: 416)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "csk_bytes", scope: !194, file: !79, line: 280, baseType: !86, size: 32, offset: 448)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "cpk_bytes", scope: !194, file: !79, line: 281, baseType: !86, size: 32, offset: 480)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "sig_bytes", scope: !194, file: !79, line: 282, baseType: !86, size: 32, offset: 512)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "salt_bytes", scope: !194, file: !79, line: 283, baseType: !86, size: 32, offset: 544)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "sk_seed_bytes", scope: !194, file: !79, line: 284, baseType: !86, size: 32, offset: 576)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "digest_bytes", scope: !194, file: !79, line: 285, baseType: !86, size: 32, offset: 608)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "pk_seed_bytes", scope: !194, file: !79, line: 286, baseType: !86, size: 32, offset: 640)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "m_vec_limbs", scope: !194, file: !79, line: 287, baseType: !86, size: 32, offset: 672)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !194, file: !79, line: 288, baseType: !148, size: 32, offset: 704)
!219 = !DILocation(line: 0, scope: !188, inlinedAt: !220)
!220 = distinct !DILocation(line: 44, column: 15, scope: !117, inlinedAt: !151)
!221 = !DILocalVariable(name: "pk", arg: 2, scope: !188, file: !68, line: 298, type: !61)
!222 = !DILocalVariable(name: "sk", arg: 3, scope: !188, file: !68, line: 298, type: !61)
!223 = !DILocalVariable(name: "ret", scope: !188, file: !68, line: 299, type: !86)
!224 = !DILocalVariable(name: "p", arg: 1, scope: !225, file: !68, line: 538, type: !191)
!225 = distinct !DISubprogram(name: "pqmayo_MAYO_5_ref_mayo_keypair_compact", scope: !68, file: !68, line: 538, type: !189, scopeLine: 539, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !48, retainedNodes: !71)
!226 = !DILocation(line: 0, scope: !225, inlinedAt: !227)
!227 = distinct !DILocation(line: 301, column: 11, scope: !188, inlinedAt: !220)
!228 = !DILocalVariable(name: "cpk", arg: 2, scope: !225, file: !68, line: 538, type: !61)
!229 = !DILocalVariable(name: "csk", arg: 3, scope: !225, file: !68, line: 539, type: !61)
!230 = !DILocalVariable(name: "ret", scope: !225, file: !68, line: 540, type: !86)
!231 = !DILocalVariable(name: "seed_sk", scope: !225, file: !68, line: 541, type: !61)
!232 = !DILocalVariable(name: "S", scope: !225, file: !68, line: 542, type: !233)
!233 = !DICompositeType(tag: DW_TAG_array_type, baseType: !51, size: 6944, elements: !234)
!234 = !{!235}
!235 = !DISubrange(count: 868)
!236 = !DILocation(line: 542, column: 19, scope: !225, inlinedAt: !227)
!237 = !DILocalVariable(name: "P", scope: !225, file: !68, line: 543, type: !167)
!238 = !DILocation(line: 543, column: 14, scope: !225, inlinedAt: !227)
!239 = !DILocalVariable(name: "P3", scope: !225, file: !68, line: 544, type: !240)
!240 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 82944, elements: !241)
!241 = !{!242}
!242 = !DISubrange(count: 1296)
!243 = !DILocation(line: 544, column: 14, scope: !225, inlinedAt: !227)
!244 = !DILocalVariable(name: "O", scope: !225, file: !68, line: 547, type: !245)
!245 = !DICompositeType(tag: DW_TAG_array_type, baseType: !51, size: 13632, elements: !174)
!246 = !DILocation(line: 547, column: 19, scope: !225, inlinedAt: !227)
!247 = !DILocalVariable(name: "m_vec_limbs", scope: !225, file: !68, line: 549, type: !248)
!248 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !86)
!249 = !DILocalVariable(name: "param_m", scope: !225, file: !68, line: 550, type: !248)
!250 = !DILocalVariable(name: "param_v", scope: !225, file: !68, line: 551, type: !248)
!251 = !DILocalVariable(name: "param_o", scope: !225, file: !68, line: 552, type: !248)
!252 = !DILocalVariable(name: "param_O_bytes", scope: !225, file: !68, line: 553, type: !248)
!253 = !DILocalVariable(name: "param_P1_limbs", scope: !225, file: !68, line: 554, type: !248)
!254 = !DILocalVariable(name: "param_P3_limbs", scope: !225, file: !68, line: 555, type: !248)
!255 = !DILocalVariable(name: "param_pk_seed_bytes", scope: !225, file: !68, line: 556, type: !248)
!256 = !DILocalVariable(name: "param_sk_seed_bytes", scope: !225, file: !68, line: 557, type: !248)
!257 = !DILocalVariable(name: "P1", scope: !225, file: !68, line: 559, type: !52)
!258 = !DILocation(line: 560, column: 22, scope: !225, inlinedAt: !227)
!259 = !DILocalVariable(name: "P2", scope: !225, file: !68, line: 560, type: !52)
!260 = !DILocation(line: 566, column: 9, scope: !261, inlinedAt: !227)
!261 = distinct !DILexicalBlock(scope: !225, file: !68, line: 566, column: 9)
!262 = !DILocation(line: 566, column: 51, scope: !261, inlinedAt: !227)
!263 = !DILocation(line: 573, column: 5, scope: !225, inlinedAt: !227)
!264 = !DILocalVariable(name: "seed_pk", scope: !225, file: !68, line: 546, type: !61)
!265 = !DILocation(line: 579, column: 14, scope: !225, inlinedAt: !227)
!266 = !DILocalVariable(name: "m", arg: 1, scope: !267, file: !68, line: 20, type: !90)
!267 = distinct !DISubprogram(name: "decode", scope: !68, file: !68, line: 20, type: !268, scopeLine: 20, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !48, retainedNodes: !71)
!268 = !DISubroutineType(types: !269)
!269 = !{null, !90, !61, !86}
!270 = !DILocation(line: 0, scope: !267, inlinedAt: !271)
!271 = distinct !DILocation(line: 579, column: 5, scope: !225, inlinedAt: !227)
!272 = !DILocalVariable(name: "mdec", arg: 2, scope: !267, file: !68, line: 20, type: !61)
!273 = !DILocalVariable(name: "mdeclen", arg: 3, scope: !267, file: !68, line: 20, type: !86)
!274 = !DILocalVariable(name: "i", scope: !267, file: !68, line: 21, type: !86)
!275 = !DILocation(line: 22, column: 10, scope: !276, inlinedAt: !271)
!276 = distinct !DILexicalBlock(scope: !267, file: !68, line: 22, column: 5)
!277 = !DILocation(line: 22, scope: !276, inlinedAt: !271)
!278 = !DILocation(line: 23, column: 19, scope: !279, inlinedAt: !271)
!279 = distinct !DILexicalBlock(scope: !280, file: !68, line: 22, column: 39)
!280 = distinct !DILexicalBlock(scope: !276, file: !68, line: 22, column: 5)
!281 = !DILocation(line: 23, column: 24, scope: !279, inlinedAt: !271)
!282 = !DILocation(line: 23, column: 14, scope: !279, inlinedAt: !271)
!283 = !DILocation(line: 23, column: 17, scope: !279, inlinedAt: !271)
!284 = !DILocation(line: 24, column: 24, scope: !279, inlinedAt: !271)
!285 = !DILocation(line: 24, column: 17, scope: !279, inlinedAt: !271)
!286 = !DILocation(line: 22, column: 34, scope: !280, inlinedAt: !271)
!287 = !DILocation(line: 24, column: 14, scope: !279, inlinedAt: !271)
!288 = !DILocation(line: 22, column: 19, scope: !280, inlinedAt: !271)
!289 = !DILocation(line: 22, column: 5, scope: !276, inlinedAt: !271)
!290 = !DILocation(line: 22, column: 5, scope: !280, inlinedAt: !271)
!291 = distinct !{!291, !289, !292, !293}
!292 = !DILocation(line: 25, column: 5, scope: !276, inlinedAt: !271)
!293 = !{!"llvm.loop.mustprogress"}
!294 = !DILocalVariable(name: "p", arg: 1, scope: !295, file: !68, line: 280, type: !191)
!295 = distinct !DISubprogram(name: "expand_P1_P2", scope: !68, file: !68, line: 280, type: !296, scopeLine: 280, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !48, retainedNodes: !71)
!296 = !DISubroutineType(types: !297)
!297 = !{null, !191, !52, !90}
!298 = !DILocation(line: 0, scope: !295, inlinedAt: !299)
!299 = distinct !DILocation(line: 585, column: 5, scope: !225, inlinedAt: !227)
!300 = !DILocalVariable(name: "P", arg: 2, scope: !295, file: !68, line: 280, type: !52)
!301 = !DILocalVariable(name: "seed_pk", arg: 3, scope: !295, file: !68, line: 280, type: !90)
!302 = !DILocation(line: 284, column: 5, scope: !295, inlinedAt: !299)
!303 = !DILocalVariable(name: "in", arg: 1, scope: !304, file: !68, line: 262, type: !90)
!304 = distinct !DISubprogram(name: "unpack_m_vecs", scope: !68, file: !68, line: 262, type: !305, scopeLine: 262, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !48, retainedNodes: !71)
!305 = !DISubroutineType(types: !306)
!306 = !{null, !90, !52, !86, !86}
!307 = !DILocation(line: 0, scope: !304, inlinedAt: !308)
!308 = distinct !DILocation(line: 285, column: 5, scope: !295, inlinedAt: !299)
!309 = !DILocalVariable(name: "out", arg: 2, scope: !304, file: !68, line: 262, type: !52)
!310 = !DILocalVariable(name: "vecs", arg: 3, scope: !304, file: !68, line: 262, type: !86)
!311 = !DILocalVariable(name: "m", arg: 4, scope: !304, file: !68, line: 262, type: !86)
!312 = !DILocalVariable(name: "m_vec_limbs", scope: !304, file: !68, line: 263, type: !248)
!313 = !DILocalVariable(name: "_out", scope: !304, file: !68, line: 264, type: !61)
!314 = !DILocalVariable(name: "tmp", scope: !304, file: !68, line: 265, type: !315)
!315 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 576, elements: !316)
!316 = !{!317}
!317 = !DISubrange(count: 9)
!318 = !DILocation(line: 265, column: 14, scope: !304, inlinedAt: !308)
!319 = !DILocalVariable(name: "i", scope: !320, file: !68, line: 266, type: !86)
!320 = distinct !DILexicalBlock(scope: !304, file: !68, line: 266, column: 5)
!321 = !DILocation(line: 0, scope: !320, inlinedAt: !308)
!322 = !DILocation(line: 266, column: 10, scope: !320, inlinedAt: !308)
!323 = !DILocation(line: 266, scope: !320, inlinedAt: !308)
!324 = !DILocation(line: 268, column: 29, scope: !325, inlinedAt: !308)
!325 = distinct !DILexicalBlock(scope: !326, file: !68, line: 267, column: 5)
!326 = distinct !DILexicalBlock(scope: !320, file: !68, line: 266, column: 5)
!327 = !DILocation(line: 268, column: 24, scope: !325, inlinedAt: !308)
!328 = !DILocation(line: 268, column: 9, scope: !325, inlinedAt: !308)
!329 = !DILocation(line: 269, column: 36, scope: !325, inlinedAt: !308)
!330 = !DILocation(line: 269, column: 21, scope: !325, inlinedAt: !308)
!331 = !DILocation(line: 269, column: 9, scope: !325, inlinedAt: !308)
!332 = !DILocation(line: 266, column: 35, scope: !326, inlinedAt: !308)
!333 = !DILocation(line: 266, column: 28, scope: !326, inlinedAt: !308)
!334 = !DILocation(line: 266, column: 5, scope: !320, inlinedAt: !308)
!335 = !DILocation(line: 266, column: 5, scope: !326, inlinedAt: !308)
!336 = distinct !{!336, !334, !337, !293}
!337 = !DILocation(line: 270, column: 5, scope: !320, inlinedAt: !308)
!338 = !DILocation(line: 271, column: 1, scope: !304, inlinedAt: !308)
!339 = !DILocalVariable(name: "p", arg: 1, scope: !340, file: !341, line: 260, type: !191)
!340 = distinct !DISubprogram(name: "compute_P3", scope: !341, file: !341, line: 260, type: !342, scopeLine: 260, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !48, retainedNodes: !71)
!341 = !DIFile(filename: "../../../src/generic/generic_arithmetic.h", directory: "/home/siddhesh/Desktop/MAYO-LLVM/llvm-apps/mayo_pass/build")
!342 = !DISubroutineType(types: !343)
!343 = !{null, !191, !344, !52, !90, !52}
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 32)
!345 = !DILocation(line: 0, scope: !340, inlinedAt: !346)
!346 = distinct !DILocation(line: 588, column: 5, scope: !225, inlinedAt: !227)
!347 = !DILocalVariable(name: "P1", arg: 2, scope: !340, file: !341, line: 260, type: !344)
!348 = !DILocalVariable(name: "P2", arg: 3, scope: !340, file: !341, line: 260, type: !52)
!349 = !DILocalVariable(name: "O", arg: 4, scope: !340, file: !341, line: 260, type: !90)
!350 = !DILocalVariable(name: "P3", arg: 5, scope: !340, file: !341, line: 260, type: !52)
!351 = !DILocalVariable(name: "m_vec_limbs", scope: !340, file: !341, line: 262, type: !248)
!352 = !DILocalVariable(name: "param_v", scope: !340, file: !341, line: 263, type: !248)
!353 = !DILocalVariable(name: "param_o", scope: !340, file: !341, line: 264, type: !248)
!354 = !DILocalVariable(name: "p", arg: 1, scope: !355, file: !341, line: 74, type: !191)
!355 = distinct !DISubprogram(name: "P1_times_O", scope: !341, file: !341, line: 74, type: !356, scopeLine: 74, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !48, retainedNodes: !71)
!356 = !DISubroutineType(types: !357)
!357 = !{null, !191, !344, !90, !52}
!358 = !DILocation(line: 0, scope: !355, inlinedAt: !359)
!359 = distinct !DILocation(line: 267, column: 5, scope: !340, inlinedAt: !346)
!360 = !DILocalVariable(name: "P1", arg: 2, scope: !355, file: !341, line: 74, type: !344)
!361 = !DILocalVariable(name: "O", arg: 3, scope: !355, file: !341, line: 74, type: !90)
!362 = !DILocalVariable(name: "acc", arg: 4, scope: !355, file: !341, line: 74, type: !52)
!363 = !DILocalVariable(name: "m_vec_limbs", arg: 1, scope: !364, file: !341, line: 16, type: !248)
!364 = distinct !DISubprogram(name: "mul_add_m_upper_triangular_mat_x_mat", scope: !341, file: !341, line: 16, type: !365, scopeLine: 17, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !48, retainedNodes: !71)
!365 = !DISubroutineType(types: !366)
!366 = !{null, !248, !344, !90, !52, !248, !248, !248, !248}
!367 = !DILocation(line: 0, scope: !364, inlinedAt: !368)
!368 = distinct !DILocation(line: 78, column: 5, scope: !355, inlinedAt: !359)
!369 = !DILocalVariable(name: "bs_mat", arg: 2, scope: !364, file: !341, line: 16, type: !344)
!370 = !DILocalVariable(name: "mat", arg: 3, scope: !364, file: !341, line: 16, type: !90)
!371 = !DILocalVariable(name: "acc", arg: 4, scope: !364, file: !341, line: 16, type: !52)
!372 = !DILocalVariable(name: "bs_mat_rows", arg: 5, scope: !364, file: !341, line: 17, type: !248)
!373 = !DILocalVariable(name: "bs_mat_cols", arg: 6, scope: !364, file: !341, line: 17, type: !248)
!374 = !DILocalVariable(name: "mat_cols", arg: 7, scope: !364, file: !341, line: 17, type: !248)
!375 = !DILocalVariable(name: "triangular", arg: 8, scope: !364, file: !341, line: 17, type: !248)
!376 = !DILocalVariable(name: "bs_mat_entries_used", scope: !364, file: !341, line: 19, type: !86)
!377 = !DILocalVariable(name: "r", scope: !378, file: !341, line: 20, type: !86)
!378 = distinct !DILexicalBlock(scope: !364, file: !341, line: 20, column: 5)
!379 = !DILocation(line: 0, scope: !378, inlinedAt: !368)
!380 = !DILocation(line: 20, column: 10, scope: !378, inlinedAt: !368)
!381 = !DILocation(line: 19, column: 9, scope: !364, inlinedAt: !368)
!382 = !DILocation(line: 20, scope: !378, inlinedAt: !368)
!383 = !DILocation(line: 20, column: 23, scope: !384, inlinedAt: !368)
!384 = distinct !DILexicalBlock(scope: !378, file: !341, line: 20, column: 5)
!385 = !DILocation(line: 20, column: 5, scope: !378, inlinedAt: !368)
!386 = !DILocation(line: 21, column: 9, scope: !387, inlinedAt: !368)
!387 = distinct !DILexicalBlock(scope: !388, file: !341, line: 21, column: 9)
!388 = distinct !DILexicalBlock(scope: !384, file: !341, line: 20, column: 43)
!389 = !DILocation(line: 21, scope: !387, inlinedAt: !368)
!390 = !DILocalVariable(name: "c", scope: !387, file: !341, line: 21, type: !86)
!391 = !DILocation(line: 0, scope: !387, inlinedAt: !368)
!392 = !DILocation(line: 21, column: 40, scope: !393, inlinedAt: !368)
!393 = distinct !DILexicalBlock(scope: !387, file: !341, line: 21, column: 9)
!394 = !DILocation(line: 22, scope: !395, inlinedAt: !368)
!395 = distinct !DILexicalBlock(scope: !396, file: !341, line: 22, column: 13)
!396 = distinct !DILexicalBlock(scope: !393, file: !341, line: 21, column: 60)
!397 = !DILocalVariable(name: "k", scope: !395, file: !341, line: 22, type: !86)
!398 = !DILocation(line: 0, scope: !395, inlinedAt: !368)
!399 = !DILocation(line: 22, column: 31, scope: !400, inlinedAt: !368)
!400 = distinct !DILexicalBlock(scope: !395, file: !341, line: 22, column: 13)
!401 = !DILocation(line: 22, column: 13, scope: !395, inlinedAt: !368)
!402 = !DILocation(line: 23, column: 51, scope: !403, inlinedAt: !368)
!403 = distinct !DILexicalBlock(scope: !400, file: !341, line: 22, column: 51)
!404 = !DILocation(line: 23, column: 94, scope: !403, inlinedAt: !368)
!405 = !DILocation(line: 23, column: 88, scope: !403, inlinedAt: !368)
!406 = !DILocation(line: 23, column: 134, scope: !403, inlinedAt: !368)
!407 = !DILocation(line: 23, column: 145, scope: !403, inlinedAt: !368)
!408 = !DILocation(line: 23, column: 115, scope: !403, inlinedAt: !368)
!409 = !DILocalVariable(name: "m_vec_limbs", arg: 1, scope: !410, file: !411, line: 31, type: !86)
!410 = distinct !DISubprogram(name: "m_vec_mul_add", scope: !411, file: !411, line: 31, type: !412, scopeLine: 31, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !48, retainedNodes: !71)
!411 = !DIFile(filename: "../../../src/generic/arithmetic_fixed.h", directory: "/home/siddhesh/Desktop/MAYO-LLVM/llvm-apps/mayo_pass/build")
!412 = !DISubroutineType(types: !413)
!413 = !{null, !86, !344, !51, !52}
!414 = !DILocation(line: 0, scope: !410, inlinedAt: !415)
!415 = distinct !DILocation(line: 23, column: 17, scope: !403, inlinedAt: !368)
!416 = !DILocalVariable(name: "in", arg: 2, scope: !410, file: !411, line: 31, type: !344)
!417 = !DILocalVariable(name: "a", arg: 3, scope: !410, file: !411, line: 31, type: !51)
!418 = !DILocalVariable(name: "acc", arg: 4, scope: !410, file: !411, line: 31, type: !52)
!419 = !DILocalVariable(name: "b", arg: 1, scope: !420, file: !421, line: 130, type: !172)
!420 = distinct !DISubprogram(name: "mul_table", scope: !421, file: !421, line: 130, type: !422, scopeLine: 130, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !48, retainedNodes: !71)
!421 = !DIFile(filename: "../../../src/simple_arithmetic.h", directory: "/home/siddhesh/Desktop/MAYO-LLVM/llvm-apps/mayo_pass/build")
!422 = !DISubroutineType(types: !423)
!423 = !{!62, !172}
!424 = !DILocation(line: 0, scope: !420, inlinedAt: !425)
!425 = distinct !DILocation(line: 33, column: 20, scope: !410, inlinedAt: !415)
!426 = !DILocation(line: 131, column: 19, scope: !420, inlinedAt: !425)
!427 = !DILocation(line: 131, column: 33, scope: !420, inlinedAt: !425)
!428 = !DILocalVariable(name: "x", scope: !420, file: !421, line: 131, type: !62)
!429 = !DILocalVariable(name: "high_nibble_mask", scope: !420, file: !421, line: 133, type: !62)
!430 = !DILocation(line: 135, column: 28, scope: !420, inlinedAt: !425)
!431 = !DILocalVariable(name: "high_half", scope: !420, file: !421, line: 135, type: !62)
!432 = !DILocation(line: 136, column: 28, scope: !420, inlinedAt: !425)
!433 = !DILocation(line: 136, column: 47, scope: !420, inlinedAt: !425)
!434 = !DILocation(line: 136, column: 34, scope: !420, inlinedAt: !425)
!435 = !DILocalVariable(name: "tab", scope: !410, file: !411, line: 33, type: !62)
!436 = !DILocalVariable(name: "lsb_ask", scope: !410, file: !411, line: 35, type: !53)
!437 = !DILocalVariable(name: "i", scope: !438, file: !411, line: 37, type: !86)
!438 = distinct !DILexicalBlock(scope: !410, file: !411, line: 37, column: 5)
!439 = !DILocation(line: 0, scope: !438, inlinedAt: !415)
!440 = !DILocation(line: 37, column: 9, scope: !438, inlinedAt: !415)
!441 = !DILocation(line: 37, scope: !438, inlinedAt: !415)
!442 = !DILocation(line: 38, column: 21, scope: !443, inlinedAt: !415)
!443 = distinct !DILexicalBlock(scope: !444, file: !411, line: 37, column: 43)
!444 = distinct !DILexicalBlock(scope: !438, file: !411, line: 37, column: 5)
!445 = !DILocation(line: 38, column: 33, scope: !443, inlinedAt: !415)
!446 = !DILocation(line: 38, column: 51, scope: !443, inlinedAt: !415)
!447 = !DILocation(line: 38, column: 46, scope: !443, inlinedAt: !415)
!448 = !DILocation(line: 38, column: 44, scope: !443, inlinedAt: !415)
!449 = !DILocation(line: 39, column: 27, scope: !443, inlinedAt: !415)
!450 = !DILocation(line: 39, column: 33, scope: !443, inlinedAt: !415)
!451 = !DILocation(line: 39, column: 52, scope: !443, inlinedAt: !415)
!452 = !DILocation(line: 39, column: 59, scope: !443, inlinedAt: !415)
!453 = !DILocation(line: 39, column: 46, scope: !443, inlinedAt: !415)
!454 = !DILocation(line: 39, column: 44, scope: !443, inlinedAt: !415)
!455 = !DILocation(line: 39, column: 17, scope: !443, inlinedAt: !415)
!456 = !DILocation(line: 40, column: 27, scope: !443, inlinedAt: !415)
!457 = !DILocation(line: 40, column: 33, scope: !443, inlinedAt: !415)
!458 = !DILocation(line: 40, column: 52, scope: !443, inlinedAt: !415)
!459 = !DILocation(line: 40, column: 59, scope: !443, inlinedAt: !415)
!460 = !DILocation(line: 40, column: 46, scope: !443, inlinedAt: !415)
!461 = !DILocation(line: 40, column: 44, scope: !443, inlinedAt: !415)
!462 = !DILocation(line: 40, column: 17, scope: !443, inlinedAt: !415)
!463 = !DILocation(line: 41, column: 27, scope: !443, inlinedAt: !415)
!464 = !DILocation(line: 41, column: 33, scope: !443, inlinedAt: !415)
!465 = !DILocation(line: 41, column: 52, scope: !443, inlinedAt: !415)
!466 = !DILocation(line: 41, column: 59, scope: !443, inlinedAt: !415)
!467 = !DILocation(line: 41, column: 46, scope: !443, inlinedAt: !415)
!468 = !DILocation(line: 41, column: 44, scope: !443, inlinedAt: !415)
!469 = !DILocation(line: 41, column: 17, scope: !443, inlinedAt: !415)
!470 = !DILocation(line: 38, column: 9, scope: !443, inlinedAt: !415)
!471 = !DILocation(line: 38, column: 16, scope: !443, inlinedAt: !415)
!472 = !DILocation(line: 37, column: 20, scope: !444, inlinedAt: !415)
!473 = !DILocation(line: 37, column: 5, scope: !438, inlinedAt: !415)
!474 = !DILocation(line: 37, column: 40, scope: !444, inlinedAt: !415)
!475 = !DILocation(line: 37, column: 5, scope: !444, inlinedAt: !415)
!476 = distinct !{!476, !473, !477, !293}
!477 = !DILocation(line: 42, column: 5, scope: !438, inlinedAt: !415)
!478 = !DILocation(line: 22, column: 45, scope: !400, inlinedAt: !368)
!479 = !DILocation(line: 22, column: 13, scope: !400, inlinedAt: !368)
!480 = distinct !{!480, !401, !481, !293}
!481 = !DILocation(line: 24, column: 13, scope: !395, inlinedAt: !368)
!482 = !DILocation(line: 25, column: 33, scope: !396, inlinedAt: !368)
!483 = !DILocation(line: 21, column: 56, scope: !393, inlinedAt: !368)
!484 = !DILocation(line: 21, column: 9, scope: !393, inlinedAt: !368)
!485 = distinct !{!485, !386, !486, !293}
!486 = !DILocation(line: 26, column: 9, scope: !387, inlinedAt: !368)
!487 = !DILocation(line: 20, column: 39, scope: !384, inlinedAt: !368)
!488 = !DILocation(line: 20, column: 5, scope: !384, inlinedAt: !368)
!489 = distinct !{!489, !385, !490, !293}
!490 = !DILocation(line: 27, column: 5, scope: !378, inlinedAt: !368)
!491 = !DILocation(line: 50, scope: !492, inlinedAt: !496)
!492 = distinct !DILexicalBlock(scope: !493, file: !341, line: 50, column: 5)
!493 = distinct !DISubprogram(name: "mul_add_mat_trans_x_m_mat", scope: !341, file: !341, line: 47, type: !494, scopeLine: 48, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !48, retainedNodes: !71)
!494 = !DISubroutineType(types: !495)
!495 = !{null, !248, !90, !344, !52, !248, !248, !248}
!496 = distinct !DILocation(line: 270, column: 5, scope: !340, inlinedAt: !346)
!497 = !DILocalVariable(name: "r", scope: !492, file: !341, line: 50, type: !86)
!498 = !DILocation(line: 0, scope: !492, inlinedAt: !496)
!499 = !DILocation(line: 50, column: 23, scope: !500, inlinedAt: !496)
!500 = distinct !DILexicalBlock(scope: !492, file: !341, line: 50, column: 5)
!501 = !DILocation(line: 50, column: 5, scope: !492, inlinedAt: !496)
!502 = !DILocation(line: 51, scope: !503, inlinedAt: !496)
!503 = distinct !DILexicalBlock(scope: !504, file: !341, line: 51, column: 9)
!504 = distinct !DILexicalBlock(scope: !500, file: !341, line: 50, column: 40)
!505 = !DILocalVariable(name: "c", scope: !503, file: !341, line: 51, type: !86)
!506 = !DILocation(line: 0, scope: !503, inlinedAt: !496)
!507 = !DILocation(line: 51, column: 27, scope: !508, inlinedAt: !496)
!508 = distinct !DILexicalBlock(scope: !503, file: !341, line: 51, column: 9)
!509 = !DILocation(line: 51, column: 9, scope: !503, inlinedAt: !496)
!510 = !DILocation(line: 52, scope: !511, inlinedAt: !496)
!511 = distinct !DILexicalBlock(scope: !512, file: !341, line: 52, column: 13)
!512 = distinct !DILexicalBlock(scope: !508, file: !341, line: 51, column: 44)
!513 = !DILocalVariable(name: "k", scope: !511, file: !341, line: 52, type: !86)
!514 = !DILocation(line: 0, scope: !511, inlinedAt: !496)
!515 = !DILocation(line: 52, column: 31, scope: !516, inlinedAt: !496)
!516 = distinct !DILexicalBlock(scope: !511, file: !341, line: 52, column: 13)
!517 = !DILocation(line: 52, column: 13, scope: !511, inlinedAt: !496)
!518 = !DILocation(line: 53, column: 70, scope: !519, inlinedAt: !496)
!519 = distinct !DILexicalBlock(scope: !516, file: !341, line: 52, column: 54)
!520 = !DILocation(line: 53, column: 84, scope: !519, inlinedAt: !496)
!521 = !DILocation(line: 53, column: 51, scope: !519, inlinedAt: !496)
!522 = !DILocation(line: 53, column: 96, scope: !519, inlinedAt: !496)
!523 = !DILocation(line: 53, column: 90, scope: !519, inlinedAt: !496)
!524 = !DILocation(line: 53, column: 136, scope: !519, inlinedAt: !496)
!525 = !DILocation(line: 53, column: 150, scope: !519, inlinedAt: !496)
!526 = !DILocation(line: 53, column: 117, scope: !519, inlinedAt: !496)
!527 = !DILocation(line: 0, scope: !410, inlinedAt: !528)
!528 = distinct !DILocation(line: 53, column: 17, scope: !519, inlinedAt: !496)
!529 = !DILocation(line: 0, scope: !420, inlinedAt: !530)
!530 = distinct !DILocation(line: 33, column: 20, scope: !410, inlinedAt: !528)
!531 = !DILocation(line: 131, column: 19, scope: !420, inlinedAt: !530)
!532 = !DILocation(line: 131, column: 33, scope: !420, inlinedAt: !530)
!533 = !DILocation(line: 135, column: 28, scope: !420, inlinedAt: !530)
!534 = !DILocation(line: 136, column: 28, scope: !420, inlinedAt: !530)
!535 = !DILocation(line: 136, column: 47, scope: !420, inlinedAt: !530)
!536 = !DILocation(line: 136, column: 34, scope: !420, inlinedAt: !530)
!537 = !DILocation(line: 0, scope: !438, inlinedAt: !528)
!538 = !DILocation(line: 37, column: 9, scope: !438, inlinedAt: !528)
!539 = !DILocation(line: 37, scope: !438, inlinedAt: !528)
!540 = !DILocation(line: 38, column: 21, scope: !443, inlinedAt: !528)
!541 = !DILocation(line: 38, column: 33, scope: !443, inlinedAt: !528)
!542 = !DILocation(line: 38, column: 51, scope: !443, inlinedAt: !528)
!543 = !DILocation(line: 38, column: 46, scope: !443, inlinedAt: !528)
!544 = !DILocation(line: 38, column: 44, scope: !443, inlinedAt: !528)
!545 = !DILocation(line: 39, column: 27, scope: !443, inlinedAt: !528)
!546 = !DILocation(line: 39, column: 33, scope: !443, inlinedAt: !528)
!547 = !DILocation(line: 39, column: 52, scope: !443, inlinedAt: !528)
!548 = !DILocation(line: 39, column: 59, scope: !443, inlinedAt: !528)
!549 = !DILocation(line: 39, column: 46, scope: !443, inlinedAt: !528)
!550 = !DILocation(line: 39, column: 44, scope: !443, inlinedAt: !528)
!551 = !DILocation(line: 39, column: 17, scope: !443, inlinedAt: !528)
!552 = !DILocation(line: 40, column: 27, scope: !443, inlinedAt: !528)
!553 = !DILocation(line: 40, column: 33, scope: !443, inlinedAt: !528)
!554 = !DILocation(line: 40, column: 52, scope: !443, inlinedAt: !528)
!555 = !DILocation(line: 40, column: 59, scope: !443, inlinedAt: !528)
!556 = !DILocation(line: 40, column: 46, scope: !443, inlinedAt: !528)
!557 = !DILocation(line: 40, column: 44, scope: !443, inlinedAt: !528)
!558 = !DILocation(line: 40, column: 17, scope: !443, inlinedAt: !528)
!559 = !DILocation(line: 41, column: 27, scope: !443, inlinedAt: !528)
!560 = !DILocation(line: 41, column: 33, scope: !443, inlinedAt: !528)
!561 = !DILocation(line: 41, column: 52, scope: !443, inlinedAt: !528)
!562 = !DILocation(line: 41, column: 59, scope: !443, inlinedAt: !528)
!563 = !DILocation(line: 41, column: 46, scope: !443, inlinedAt: !528)
!564 = !DILocation(line: 41, column: 44, scope: !443, inlinedAt: !528)
!565 = !DILocation(line: 41, column: 17, scope: !443, inlinedAt: !528)
!566 = !DILocation(line: 38, column: 9, scope: !443, inlinedAt: !528)
!567 = !DILocation(line: 38, column: 16, scope: !443, inlinedAt: !528)
!568 = !DILocation(line: 37, column: 20, scope: !444, inlinedAt: !528)
!569 = !DILocation(line: 37, column: 5, scope: !438, inlinedAt: !528)
!570 = !DILocation(line: 37, column: 40, scope: !444, inlinedAt: !528)
!571 = !DILocation(line: 37, column: 5, scope: !444, inlinedAt: !528)
!572 = distinct !{!572, !569, !573, !293}
!573 = !DILocation(line: 42, column: 5, scope: !438, inlinedAt: !528)
!574 = !DILocation(line: 52, column: 48, scope: !516, inlinedAt: !496)
!575 = !DILocation(line: 52, column: 13, scope: !516, inlinedAt: !496)
!576 = distinct !{!576, !517, !577, !293}
!577 = !DILocation(line: 54, column: 13, scope: !511, inlinedAt: !496)
!578 = !DILocation(line: 51, column: 40, scope: !508, inlinedAt: !496)
!579 = !DILocation(line: 51, column: 9, scope: !508, inlinedAt: !496)
!580 = distinct !{!580, !509, !581, !293}
!581 = !DILocation(line: 55, column: 9, scope: !503, inlinedAt: !496)
!582 = !DILocation(line: 50, column: 36, scope: !500, inlinedAt: !496)
!583 = !DILocation(line: 50, column: 5, scope: !500, inlinedAt: !496)
!584 = distinct !{!584, !501, !585, !293}
!585 = !DILocation(line: 56, column: 5, scope: !492, inlinedAt: !496)
!586 = !DILocation(line: 591, column: 5, scope: !225, inlinedAt: !227)
!587 = !DILocalVariable(name: "P3_upper", scope: !225, file: !68, line: 593, type: !588)
!588 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 44928, elements: !589)
!589 = !{!590}
!590 = !DISubrange(count: 702)
!591 = !DILocation(line: 593, column: 14, scope: !225, inlinedAt: !227)
!592 = !DILocalVariable(name: "p", arg: 1, scope: !593, file: !99, line: 14, type: !596)
!593 = distinct !DISubprogram(name: "pqmayo_MAYO_5_ref_m_upper", scope: !99, file: !99, line: 14, type: !594, scopeLine: 14, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !84, retainedNodes: !71)
!594 = !DISubroutineType(types: !595)
!595 = !{null, !596, !344, !52, !86}
!596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !597, size: 32)
!597 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !598)
!598 = !DIDerivedType(tag: DW_TAG_typedef, name: "mayo_params_t", file: !79, line: 289, baseType: !599)
!599 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !79, line: 265, size: 736, elements: !600)
!600 = !{!601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623}
!601 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !599, file: !79, line: 266, baseType: !86, size: 32)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !599, file: !79, line: 267, baseType: !86, size: 32, offset: 32)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "o", scope: !599, file: !79, line: 268, baseType: !86, size: 32, offset: 64)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "k", scope: !599, file: !79, line: 269, baseType: !86, size: 32, offset: 96)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !599, file: !79, line: 270, baseType: !86, size: 32, offset: 128)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "f_tail", scope: !599, file: !79, line: 271, baseType: !90, size: 32, offset: 160)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "m_bytes", scope: !599, file: !79, line: 272, baseType: !86, size: 32, offset: 192)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "O_bytes", scope: !599, file: !79, line: 273, baseType: !86, size: 32, offset: 224)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "v_bytes", scope: !599, file: !79, line: 274, baseType: !86, size: 32, offset: 256)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "r_bytes", scope: !599, file: !79, line: 275, baseType: !86, size: 32, offset: 288)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "R_bytes", scope: !599, file: !79, line: 276, baseType: !86, size: 32, offset: 320)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "P1_bytes", scope: !599, file: !79, line: 277, baseType: !86, size: 32, offset: 352)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "P2_bytes", scope: !599, file: !79, line: 278, baseType: !86, size: 32, offset: 384)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "P3_bytes", scope: !599, file: !79, line: 279, baseType: !86, size: 32, offset: 416)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "csk_bytes", scope: !599, file: !79, line: 280, baseType: !86, size: 32, offset: 448)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "cpk_bytes", scope: !599, file: !79, line: 281, baseType: !86, size: 32, offset: 480)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "sig_bytes", scope: !599, file: !79, line: 282, baseType: !86, size: 32, offset: 512)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "salt_bytes", scope: !599, file: !79, line: 283, baseType: !86, size: 32, offset: 544)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "sk_seed_bytes", scope: !599, file: !79, line: 284, baseType: !86, size: 32, offset: 576)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "digest_bytes", scope: !599, file: !79, line: 285, baseType: !86, size: 32, offset: 608)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "pk_seed_bytes", scope: !599, file: !79, line: 286, baseType: !86, size: 32, offset: 640)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "m_vec_limbs", scope: !599, file: !79, line: 287, baseType: !86, size: 32, offset: 672)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !599, file: !79, line: 288, baseType: !148, size: 32, offset: 704)
!624 = !DILocation(line: 0, scope: !593, inlinedAt: !625)
!625 = distinct !DILocation(line: 596, column: 5, scope: !225, inlinedAt: !227)
!626 = !DILocalVariable(name: "in", arg: 2, scope: !593, file: !99, line: 14, type: !344)
!627 = !DILocalVariable(name: "out", arg: 3, scope: !593, file: !99, line: 14, type: !52)
!628 = !DILocalVariable(name: "size", arg: 4, scope: !593, file: !99, line: 14, type: !86)
!629 = !DILocalVariable(name: "m_vec_limbs", scope: !593, file: !99, line: 19, type: !248)
!630 = !DILocalVariable(name: "m_vecs_stored", scope: !593, file: !99, line: 20, type: !86)
!631 = !DILocalVariable(name: "r", scope: !632, file: !99, line: 21, type: !86)
!632 = distinct !DILexicalBlock(scope: !593, file: !99, line: 21, column: 5)
!633 = !DILocation(line: 0, scope: !632, inlinedAt: !625)
!634 = !DILocation(line: 21, column: 10, scope: !632, inlinedAt: !625)
!635 = !DILocation(line: 21, scope: !632, inlinedAt: !625)
!636 = !DILocation(line: 20, column: 9, scope: !593, inlinedAt: !625)
!637 = !DILocation(line: 21, column: 23, scope: !638, inlinedAt: !625)
!638 = distinct !DILexicalBlock(scope: !632, file: !99, line: 21, column: 5)
!639 = !DILocation(line: 21, column: 5, scope: !632, inlinedAt: !625)
!640 = !DILocation(line: 22, scope: !641, inlinedAt: !625)
!641 = distinct !DILexicalBlock(scope: !642, file: !99, line: 22, column: 9)
!642 = distinct !DILexicalBlock(scope: !638, file: !99, line: 21, column: 36)
!643 = !DILocalVariable(name: "c", scope: !641, file: !99, line: 22, type: !86)
!644 = !DILocation(line: 0, scope: !641, inlinedAt: !625)
!645 = !DILocation(line: 22, column: 27, scope: !646, inlinedAt: !625)
!646 = distinct !DILexicalBlock(scope: !641, file: !99, line: 22, column: 9)
!647 = !DILocation(line: 22, column: 9, scope: !641, inlinedAt: !625)
!648 = !DILocation(line: 23, column: 59, scope: !649, inlinedAt: !625)
!649 = distinct !DILexicalBlock(scope: !646, file: !99, line: 22, column: 40)
!650 = !DILocation(line: 23, column: 66, scope: !649, inlinedAt: !625)
!651 = !DILocation(line: 23, column: 40, scope: !649, inlinedAt: !625)
!652 = !DILocation(line: 23, column: 76, scope: !649, inlinedAt: !625)
!653 = !DILocalVariable(name: "m_vec_limbs", arg: 1, scope: !654, file: !411, line: 13, type: !86)
!654 = distinct !DISubprogram(name: "m_vec_copy", scope: !411, file: !411, line: 13, type: !655, scopeLine: 13, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !84, retainedNodes: !71)
!655 = !DISubroutineType(types: !656)
!656 = !{null, !86, !344, !52}
!657 = !DILocation(line: 0, scope: !654, inlinedAt: !658)
!658 = distinct !DILocation(line: 23, column: 13, scope: !649, inlinedAt: !625)
!659 = !DILocalVariable(name: "in", arg: 2, scope: !654, file: !411, line: 13, type: !344)
!660 = !DILocalVariable(name: "out", arg: 3, scope: !654, file: !411, line: 13, type: !52)
!661 = !DILocalVariable(name: "i", scope: !662, file: !411, line: 15, type: !58)
!662 = distinct !DILexicalBlock(scope: !654, file: !411, line: 15, column: 5)
!663 = !DILocation(line: 0, scope: !662, inlinedAt: !658)
!664 = !DILocation(line: 17, column: 18, scope: !665, inlinedAt: !658)
!665 = distinct !DILexicalBlock(scope: !666, file: !411, line: 16, column: 5)
!666 = distinct !DILexicalBlock(scope: !662, file: !411, line: 15, column: 5)
!667 = !DILocation(line: 17, column: 16, scope: !665, inlinedAt: !658)
!668 = !DILocation(line: 17, column: 9, scope: !665, inlinedAt: !658)
!669 = !DILocation(line: 24, column: 19, scope: !670, inlinedAt: !625)
!670 = distinct !DILexicalBlock(scope: !649, file: !99, line: 24, column: 17)
!671 = !DILocation(line: 25, column: 62, scope: !672, inlinedAt: !625)
!672 = distinct !DILexicalBlock(scope: !670, file: !99, line: 24, column: 25)
!673 = !DILocation(line: 25, column: 69, scope: !672, inlinedAt: !625)
!674 = !DILocation(line: 25, column: 43, scope: !672, inlinedAt: !625)
!675 = !DILocation(line: 25, column: 79, scope: !672, inlinedAt: !625)
!676 = !DILocalVariable(name: "m_vec_limbs", arg: 1, scope: !677, file: !411, line: 22, type: !86)
!677 = distinct !DISubprogram(name: "m_vec_add", scope: !411, file: !411, line: 22, type: !655, scopeLine: 22, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !84, retainedNodes: !71)
!678 = !DILocation(line: 0, scope: !677, inlinedAt: !679)
!679 = distinct !DILocation(line: 25, column: 17, scope: !672, inlinedAt: !625)
!680 = !DILocalVariable(name: "in", arg: 2, scope: !677, file: !411, line: 22, type: !344)
!681 = !DILocalVariable(name: "acc", arg: 3, scope: !677, file: !411, line: 22, type: !52)
!682 = !DILocalVariable(name: "i", scope: !683, file: !411, line: 24, type: !58)
!683 = distinct !DILexicalBlock(scope: !677, file: !411, line: 24, column: 5)
!684 = !DILocation(line: 0, scope: !683, inlinedAt: !679)
!685 = !DILocation(line: 26, column: 19, scope: !686, inlinedAt: !679)
!686 = distinct !DILexicalBlock(scope: !687, file: !411, line: 25, column: 5)
!687 = distinct !DILexicalBlock(scope: !683, file: !411, line: 24, column: 5)
!688 = !DILocation(line: 26, column: 16, scope: !686, inlinedAt: !679)
!689 = !DILocation(line: 26, column: 9, scope: !686, inlinedAt: !679)
!690 = !DILocation(line: 27, column: 27, scope: !649, inlinedAt: !625)
!691 = !DILocation(line: 22, column: 36, scope: !646, inlinedAt: !625)
!692 = !DILocation(line: 22, column: 9, scope: !646, inlinedAt: !625)
!693 = distinct !{!693, !647, !694, !293}
!694 = !DILocation(line: 28, column: 9, scope: !641, inlinedAt: !625)
!695 = !DILocation(line: 21, column: 32, scope: !638, inlinedAt: !625)
!696 = !DILocation(line: 21, column: 5, scope: !638, inlinedAt: !625)
!697 = distinct !{!697, !639, !698, !293}
!698 = !DILocation(line: 29, column: 5, scope: !632, inlinedAt: !625)
!699 = !DILocation(line: 597, column: 31, scope: !225, inlinedAt: !227)
!700 = !DILocalVariable(name: "in", arg: 1, scope: !701, file: !68, line: 272, type: !344)
!701 = distinct !DISubprogram(name: "pack_m_vecs", scope: !68, file: !68, line: 272, type: !702, scopeLine: 272, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !48, retainedNodes: !71)
!702 = !DISubroutineType(types: !703)
!703 = !{null, !344, !61, !86, !86}
!704 = !DILocation(line: 0, scope: !701, inlinedAt: !705)
!705 = distinct !DILocation(line: 597, column: 5, scope: !225, inlinedAt: !227)
!706 = !DILocalVariable(name: "out", arg: 2, scope: !701, file: !68, line: 272, type: !61)
!707 = !DILocalVariable(name: "vecs", arg: 3, scope: !701, file: !68, line: 272, type: !86)
!708 = !DILocalVariable(name: "m", arg: 4, scope: !701, file: !68, line: 272, type: !86)
!709 = !DILocalVariable(name: "m_vec_limbs", scope: !701, file: !68, line: 273, type: !248)
!710 = !DILocalVariable(name: "_in", scope: !701, file: !68, line: 274, type: !61)
!711 = !DILocalVariable(name: "i", scope: !712, file: !68, line: 275, type: !86)
!712 = distinct !DILexicalBlock(scope: !701, file: !68, line: 275, column: 5)
!713 = !DILocation(line: 0, scope: !712, inlinedAt: !705)
!714 = !DILocation(line: 275, column: 10, scope: !712, inlinedAt: !705)
!715 = !DILocation(line: 275, scope: !712, inlinedAt: !705)
!716 = !DILocation(line: 277, column: 27, scope: !717, inlinedAt: !705)
!717 = distinct !DILexicalBlock(scope: !718, file: !68, line: 276, column: 5)
!718 = distinct !DILexicalBlock(scope: !712, file: !68, line: 275, column: 5)
!719 = !DILocation(line: 277, column: 21, scope: !717, inlinedAt: !705)
!720 = !DILocation(line: 277, column: 51, scope: !717, inlinedAt: !705)
!721 = !DILocation(line: 277, column: 36, scope: !717, inlinedAt: !705)
!722 = !DILocation(line: 277, column: 9, scope: !717, inlinedAt: !705)
!723 = !DILocation(line: 275, column: 32, scope: !718, inlinedAt: !705)
!724 = !DILocation(line: 275, column: 23, scope: !718, inlinedAt: !705)
!725 = !DILocation(line: 275, column: 5, scope: !712, inlinedAt: !705)
!726 = !DILocation(line: 275, column: 5, scope: !718, inlinedAt: !705)
!727 = distinct !{!727, !725, !728, !293}
!728 = !DILocation(line: 278, column: 5, scope: !712, inlinedAt: !705)
!729 = !DILabel(scope: !225, name: "err", file: !68, line: 600)
!730 = !DILocation(line: 600, column: 5, scope: !225, inlinedAt: !227)
!731 = !DILocation(line: 602, column: 5, scope: !225, inlinedAt: !227)
!732 = !DILocation(line: 603, column: 5, scope: !225, inlinedAt: !227)
!733 = !DILocation(line: 604, column: 5, scope: !225, inlinedAt: !227)
!734 = !DILocation(line: 605, column: 5, scope: !225, inlinedAt: !227)
!735 = !DILabel(scope: !188, name: "err", file: !68, line: 306)
!736 = !DILocation(line: 306, column: 1, scope: !188, inlinedAt: !220)
!737 = !DILocalVariable(name: "res", scope: !117, file: !2, line: 44, type: !86)
!738 = !DILocation(line: 50, column: 9, scope: !739, inlinedAt: !151)
!739 = distinct !DILexicalBlock(scope: !740, file: !2, line: 49, column: 12)
!740 = distinct !DILexicalBlock(scope: !117, file: !2, line: 45, column: 9)
!741 = !DILocation(line: 53, column: 5, scope: !117, inlinedAt: !151)
!742 = !DILocalVariable(name: "p", arg: 1, scope: !743, file: !68, line: 310, type: !191)
!743 = distinct !DISubprogram(name: "pqmayo_MAYO_5_ref_mayo_expand_sk", scope: !68, file: !68, line: 310, type: !744, scopeLine: 311, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !48, retainedNodes: !71)
!744 = !DISubroutineType(types: !745)
!745 = !{!86, !191, !90, !746}
!746 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !747, size: 32)
!747 = !DIDerivedType(tag: DW_TAG_typedef, name: "sk_t", file: !79, line: 294, baseType: !748)
!748 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sk_t", file: !79, line: 291, size: 6843264, elements: !749)
!749 = !{!750, !751}
!750 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !748, file: !79, line: 292, baseType: !167, size: 6829632)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "O", scope: !748, file: !79, line: 293, baseType: !171, size: 13632, offset: 6829632)
!752 = !DILocation(line: 0, scope: !743, inlinedAt: !753)
!753 = distinct !DILocation(line: 54, column: 11, scope: !117, inlinedAt: !151)
!754 = !DILocalVariable(name: "csk", arg: 2, scope: !743, file: !68, line: 310, type: !90)
!755 = !DILocalVariable(name: "sk", arg: 3, scope: !743, file: !68, line: 311, type: !746)
!756 = !DILocalVariable(name: "ret", scope: !743, file: !68, line: 312, type: !86)
!757 = !DILocalVariable(name: "S", scope: !743, file: !68, line: 313, type: !233)
!758 = !DILocation(line: 313, column: 19, scope: !743, inlinedAt: !753)
!759 = !DILocalVariable(name: "P", scope: !743, file: !68, line: 314, type: !52)
!760 = !DILocation(line: 315, column: 28, scope: !743, inlinedAt: !753)
!761 = !DILocalVariable(name: "O", scope: !743, file: !68, line: 315, type: !61)
!762 = !DILocalVariable(name: "param_o", scope: !743, file: !68, line: 317, type: !248)
!763 = !DILocalVariable(name: "param_v", scope: !743, file: !68, line: 318, type: !248)
!764 = !DILocalVariable(name: "param_O_bytes", scope: !743, file: !68, line: 319, type: !248)
!765 = !DILocalVariable(name: "param_pk_seed_bytes", scope: !743, file: !68, line: 320, type: !248)
!766 = !DILocalVariable(name: "param_sk_seed_bytes", scope: !743, file: !68, line: 321, type: !248)
!767 = !DILocalVariable(name: "seed_sk", scope: !743, file: !68, line: 323, type: !90)
!768 = !DILocalVariable(name: "seed_pk", scope: !743, file: !68, line: 324, type: !61)
!769 = !DILocation(line: 326, column: 5, scope: !743, inlinedAt: !753)
!770 = !DILocation(line: 328, column: 14, scope: !743, inlinedAt: !753)
!771 = !DILocation(line: 0, scope: !267, inlinedAt: !772)
!772 = distinct !DILocation(line: 328, column: 5, scope: !743, inlinedAt: !753)
!773 = !DILocation(line: 22, column: 10, scope: !276, inlinedAt: !772)
!774 = !DILocation(line: 46, column: 9, scope: !775, inlinedAt: !151)
!775 = distinct !DILexicalBlock(scope: !740, file: !2, line: 45, column: 25)
!776 = !DILocation(line: 48, column: 9, scope: !775, inlinedAt: !151)
!777 = !DILocation(line: 22, scope: !276, inlinedAt: !772)
!778 = !DILocation(line: 23, column: 19, scope: !279, inlinedAt: !772)
!779 = !DILocation(line: 23, column: 24, scope: !279, inlinedAt: !772)
!780 = !DILocation(line: 23, column: 14, scope: !279, inlinedAt: !772)
!781 = !DILocation(line: 23, column: 17, scope: !279, inlinedAt: !772)
!782 = !DILocation(line: 24, column: 24, scope: !279, inlinedAt: !772)
!783 = !DILocation(line: 24, column: 17, scope: !279, inlinedAt: !772)
!784 = !DILocation(line: 22, column: 34, scope: !280, inlinedAt: !772)
!785 = !DILocation(line: 24, column: 14, scope: !279, inlinedAt: !772)
!786 = !DILocation(line: 22, column: 19, scope: !280, inlinedAt: !772)
!787 = !DILocation(line: 22, column: 5, scope: !276, inlinedAt: !772)
!788 = !DILocation(line: 22, column: 5, scope: !280, inlinedAt: !772)
!789 = distinct !{!789, !787, !790, !293}
!790 = !DILocation(line: 25, column: 5, scope: !276, inlinedAt: !772)
!791 = !DILocation(line: 0, scope: !295, inlinedAt: !792)
!792 = distinct !DILocation(line: 334, column: 5, scope: !743, inlinedAt: !753)
!793 = !DILocation(line: 284, column: 5, scope: !295, inlinedAt: !792)
!794 = !DILocation(line: 0, scope: !304, inlinedAt: !795)
!795 = distinct !DILocation(line: 285, column: 5, scope: !295, inlinedAt: !792)
!796 = !DILocation(line: 265, column: 14, scope: !304, inlinedAt: !795)
!797 = !DILocation(line: 0, scope: !320, inlinedAt: !795)
!798 = !DILocation(line: 266, column: 10, scope: !320, inlinedAt: !795)
!799 = !DILocation(line: 266, scope: !320, inlinedAt: !795)
!800 = !DILocation(line: 268, column: 29, scope: !325, inlinedAt: !795)
!801 = !DILocation(line: 268, column: 24, scope: !325, inlinedAt: !795)
!802 = !DILocation(line: 268, column: 9, scope: !325, inlinedAt: !795)
!803 = !DILocation(line: 269, column: 36, scope: !325, inlinedAt: !795)
