; ModuleID = 'composite'
source_filename = "composite"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.mayo_params_t = type { i32, i32, i32, i32, i32, ptr, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, ptr }
%struct.sk_t = type { [113103 x i64], [2414 x i8] }

@MAYO_1 = external constant %struct.mayo_params_t, align 8
@MAYO_2 = external constant %struct.mayo_params_t, align 8
@MAYO_3 = external constant %struct.mayo_params_t, align 8
@MAYO_5 = external constant %struct.mayo_params_t, align 8
@__const.main.params = private unnamed_addr constant [4 x ptr] [ptr @MAYO_1, ptr @MAYO_2, ptr @MAYO_3, ptr @MAYO_5], align 16
@__const.example_mayo.msg = private unnamed_addr constant <{ i8, [31 x i8] }> <{ i8 14, [31 x i8] zeroinitializer }>, align 16
@.str = private unnamed_addr constant [17 x i8] c"Example with %s\0A\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [17 x i8] c"mayo_keypair -> \00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [6 x i8] c"FAIL\0A\00", align 1, !dbg !9
@.str.3 = private unnamed_addr constant [4 x i8] c"OK\0A\00", align 1, !dbg !14
@.str.4 = private unnamed_addr constant [19 x i8] c"mayo_expand_sk -> \00", align 1, !dbg !19
@.str.5 = private unnamed_addr constant [19 x i8] c"mayo_expand_pk -> \00", align 1, !dbg !24

!19 = !DIGlobalVariableExpression(var: !20, expr: !DIExpression())
!20 = distinct !DIGlobalVariable(scope: null, file: !2, line: 53, type: !21, isLocal: true, isDefinition: true)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 152, elements: !22)
!22 = !{!23}
!23 = !DISubrange(count: 19)
!24 = !DIGlobalVariableExpression(var: !25, expr: !DIExpression())
!25 = distinct !DIGlobalVariable(scope: null, file: !2, line: 63, type: !21, isLocal: true, isDefinition: true)
!26 = !DIGlobalVariableExpression(var: !27, expr: !DIExpression())
!27 = distinct !DIGlobalVariable(scope: null, file: !2, line: 73, type: !28, isLocal: true, isDefinition: true)
!28 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 112, elements: !29)
!29 = !{!30}
!30 = !DISubrange(count: 14)
!31 = !DIGlobalVariableExpression(var: !32, expr: !DIExpression())
!32 = distinct !DIGlobalVariable(scope: null, file: !2, line: 83, type: !33, isLocal: true, isDefinition: true)
!33 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 312, elements: !34)
!34 = !{!35}
!35 = !DISubrange(count: 39)
!36 = !DIGlobalVariableExpression(var: !37, expr: !DIExpression())
!37 = distinct !DIGlobalVariable(scope: null, file: !2, line: 94, type: !38, isLocal: true, isDefinition: true)
!38 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 328, elements: !39)
!39 = !{!40}
!40 = !DISubrange(count: 41)
!41 = !DIGlobalVariableExpression(var: !42, expr: !DIExpression())
!42 = distinct !DIGlobalVariable(scope: null, file: !2, line: 105, type: !33, isLocal: true, isDefinition: true)
!43 = !DIGlobalVariableExpression(var: !44, expr: !DIExpression())
!44 = distinct !DIGlobalVariable(scope: null, file: !2, line: 118, type: !38, isLocal: true, isDefinition: true)
!45 = distinct !DICompileUnit(language: DW_LANG_C11, file: !46, producer: "clang version 23.0.0git (https://github.com/llvm/llvm-project.git 49a2335fab0e61117655f25393e86cd48d99445c)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, globals: !47, splitDebugInlining: false, nameTableKind: None)
!46 = !DIFile(filename: "<stdin>", directory: "")
!47 = !{!0, !7, !9, !14, !19, !24, !26, !31, !36, !41, !43}
!48 = distinct !DICompileUnit(language: DW_LANG_C11, file: !49, producer: "clang version 23.0.0git (https://github.com/llvm/llvm-project.git 49a2335fab0e61117655f25393e86cd48d99445c)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !50, globals: !61, splitDebugInlining: false, nameTableKind: None)
!49 = !DIFile(filename: "../src/<stdin>", directory: "")
!50 = !{!51, !52, !58, !60}
!51 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !54, line: 27, baseType: !55)
!54 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !56, line: 45, baseType: !57)
!56 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!57 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !59, line: 18, baseType: !57)
!59 = !DIFile(filename: "/usr/local/lib/clang/23/include/__stddef_size_t.h", directory: "")
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64)
!61 = !{!62, !70, !72, !74}
!62 = !DIGlobalVariableExpression(var: !63, expr: !DIExpression())
!63 = distinct !DIGlobalVariable(name: "even_nibbles", scope: !64, file: !65, line: 112, type: !69, isLocal: true, isDefinition: true)
!64 = distinct !DISubprogram(name: "transpose_16x16_nibbles", scope: !65, file: !65, line: 111, type: !66, scopeLine: 111, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !48, retainedNodes: !68)
!65 = !DIFile(filename: "../src/mayo.c", directory: "")
!66 = !DISubroutineType(types: !67)
!67 = !{null, !52}
!68 = !{}
!69 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !53)
!70 = !DIGlobalVariableExpression(var: !71, expr: !DIExpression())
!71 = distinct !DIGlobalVariable(name: "even_bytes", scope: !64, file: !65, line: 113, type: !69, isLocal: true, isDefinition: true)
!72 = !DIGlobalVariableExpression(var: !73, expr: !DIExpression())
!73 = distinct !DIGlobalVariable(name: "even_2bytes", scope: !64, file: !65, line: 114, type: !69, isLocal: true, isDefinition: true)
!74 = !DIGlobalVariableExpression(var: !75, expr: !DIExpression())
!75 = distinct !DIGlobalVariable(name: "even_half", scope: !64, file: !65, line: 115, type: !69, isLocal: true, isDefinition: true)
!76 = !{!"clang version 23.0.0git (https://github.com/llvm/llvm-project.git 49a2335fab0e61117655f25393e86cd48d99445c)"}
!77 = !{i32 2, !"Debug Info Version", i32 3}
!78 = !{i32 1, !"wchar_size", i32 4}
!79 = distinct !DISubprogram(name: "main", scope: !2, file: !2, line: 138, type: !80, scopeLine: 138, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !45, retainedNodes: !68)
!80 = !DISubroutineType(types: !81)
!81 = !{!82}
!82 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!83 = !DILocalVariable(name: "params", scope: !79, file: !2, line: 140, type: !84)
!84 = !DICompositeType(tag: DW_TAG_array_type, baseType: !85, size: 256, elements: !17)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!86 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !87)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "mayo_params_t", file: !88, line: 289, baseType: !89)
!88 = !DIFile(filename: "../include/mayo.h", directory: "")
!89 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !88, line: 265, size: 832, elements: !90)
!90 = !{!91, !92, !93, !94, !95, !96, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115}
!91 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !89, file: !88, line: 266, baseType: !82, size: 32)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !89, file: !88, line: 267, baseType: !82, size: 32, offset: 32)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "o", scope: !89, file: !88, line: 268, baseType: !82, size: 32, offset: 64)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "k", scope: !89, file: !88, line: 269, baseType: !82, size: 32, offset: 96)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !89, file: !88, line: 270, baseType: !82, size: 32, offset: 128)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "f_tail", scope: !89, file: !88, line: 271, baseType: !97, size: 64, offset: 192)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!98 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !51)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "m_bytes", scope: !89, file: !88, line: 272, baseType: !82, size: 32, offset: 256)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "O_bytes", scope: !89, file: !88, line: 273, baseType: !82, size: 32, offset: 288)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "v_bytes", scope: !89, file: !88, line: 274, baseType: !82, size: 32, offset: 320)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "r_bytes", scope: !89, file: !88, line: 275, baseType: !82, size: 32, offset: 352)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "R_bytes", scope: !89, file: !88, line: 276, baseType: !82, size: 32, offset: 384)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "P1_bytes", scope: !89, file: !88, line: 277, baseType: !82, size: 32, offset: 416)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "P2_bytes", scope: !89, file: !88, line: 278, baseType: !82, size: 32, offset: 448)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "P3_bytes", scope: !89, file: !88, line: 279, baseType: !82, size: 32, offset: 480)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "csk_bytes", scope: !89, file: !88, line: 280, baseType: !82, size: 32, offset: 512)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "cpk_bytes", scope: !89, file: !88, line: 281, baseType: !82, size: 32, offset: 544)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "sig_bytes", scope: !89, file: !88, line: 282, baseType: !82, size: 32, offset: 576)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "salt_bytes", scope: !89, file: !88, line: 283, baseType: !82, size: 32, offset: 608)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "sk_seed_bytes", scope: !89, file: !88, line: 284, baseType: !82, size: 32, offset: 640)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "digest_bytes", scope: !89, file: !88, line: 285, baseType: !82, size: 32, offset: 672)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "pk_seed_bytes", scope: !89, file: !88, line: 286, baseType: !82, size: 32, offset: 704)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "m_vec_limbs", scope: !89, file: !88, line: 287, baseType: !82, size: 32, offset: 736)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !89, file: !88, line: 288, baseType: !116, size: 64, offset: 768)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!117 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!118 = !DILocation(line: 140, column: 26, scope: !79)
!119 = !DILocalVariable(name: "paramslen", scope: !79, file: !2, line: 141, type: !82)
!120 = !DILocation(line: 141, column: 9, scope: !79)
!121 = !DILocalVariable(name: "i", scope: !122, file: !2, line: 142, type: !82)
!122 = distinct !DILexicalBlock(scope: !79, file: !2, line: 142, column: 5)
!123 = !DILocation(line: 142, column: 14, scope: !122)
!124 = !DILocation(line: 142, column: 10, scope: !122)
!125 = !DILocation(line: 142, column: 21, scope: !126)
!126 = distinct !DILexicalBlock(scope: !122, file: !2, line: 142, column: 5)
!127 = !DILocation(line: 142, column: 25, scope: !126)
!128 = !DILocation(line: 142, column: 23, scope: !126)
!129 = !DILocation(line: 142, column: 5, scope: !122)
!130 = !DILocation(line: 143, column: 33, scope: !131)
!131 = distinct !DILexicalBlock(scope: !132, file: !2, line: 143, column: 13)
!132 = distinct !DILexicalBlock(scope: !126, file: !2, line: 142, column: 41)
!133 = !DILocation(line: 143, column: 26, scope: !131)
!134 = !DILocation(line: 143, column: 13, scope: !131)
!135 = !DILocation(line: 143, column: 37, scope: !131)
!136 = !DILocation(line: 144, column: 13, scope: !137)
!137 = distinct !DILexicalBlock(scope: !131, file: !2, line: 143, column: 49)
!138 = !DILocation(line: 146, column: 5, scope: !132)
!139 = !DILocation(line: 142, column: 36, scope: !126)
!140 = !DILocation(line: 142, column: 5, scope: !126)
!141 = distinct !{!141, !129, !142, !143}
!142 = !DILocation(line: 146, column: 5, scope: !122)
!143 = !{!"llvm.loop.mustprogress"}
!144 = !DILocation(line: 150, column: 1, scope: !79)
!145 = distinct !DISubprogram(name: "example_mayo", scope: !2, file: !2, line: 25, type: !146, scopeLine: 25, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !45, retainedNodes: !68)
!146 = !DISubroutineType(types: !147)
!147 = !{!82, !85}
!148 = !DILocalVariable(name: "p", arg: 1, scope: !145, file: !2, line: 25, type: !85)
!149 = !DILocation(line: 25, column: 46, scope: !145)
!150 = !DILocalVariable(name: "msglen", scope: !145, file: !2, line: 27, type: !58)
!151 = !DILocation(line: 27, column: 12, scope: !145)
!152 = !DILocalVariable(name: "smlen", scope: !145, file: !2, line: 28, type: !58)
!153 = !DILocation(line: 28, column: 12, scope: !145)
!154 = !DILocation(line: 28, column: 36, scope: !145)
!155 = !DILocation(line: 28, column: 20, scope: !145)
!156 = !DILocation(line: 28, column: 41, scope: !145)
!157 = !DILocation(line: 28, column: 39, scope: !145)
!158 = !DILocalVariable(name: "pk", scope: !145, file: !2, line: 30, type: !60)
!159 = !DILocation(line: 30, column: 20, scope: !145)
!160 = !DILocation(line: 30, column: 49, scope: !145)
!161 = !DILocation(line: 30, column: 33, scope: !145)
!162 = !DILocation(line: 30, column: 26, scope: !145)
!163 = !DILocalVariable(name: "sk", scope: !145, file: !2, line: 31, type: !60)
!164 = !DILocation(line: 31, column: 20, scope: !145)
!165 = !DILocation(line: 31, column: 49, scope: !145)
!166 = !DILocation(line: 31, column: 33, scope: !145)
!167 = !DILocation(line: 31, column: 26, scope: !145)
!168 = !DILocalVariable(name: "epk", scope: !145, file: !2, line: 33, type: !52)
!169 = !DILocation(line: 33, column: 15, scope: !145)
!170 = !DILocation(line: 33, column: 21, scope: !145)
!171 = !DILocalVariable(name: "esk", scope: !145, file: !2, line: 34, type: !172)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64)
!173 = !DIDerivedType(tag: DW_TAG_typedef, name: "sk_t", file: !88, line: 294, baseType: !174)
!174 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sk_t", file: !88, line: 291, size: 7257920, elements: !175)
!175 = !{!176, !180}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !174, file: !88, line: 292, baseType: !177, size: 7238592)
!177 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 7238592, elements: !178)
!178 = !{!179}
!179 = !DISubrange(count: 113103)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "O", scope: !174, file: !88, line: 293, baseType: !181, size: 19312, offset: 7238592)
!181 = !DICompositeType(tag: DW_TAG_array_type, baseType: !182, size: 19312, elements: !184)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !54, line: 24, baseType: !183)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !56, line: 38, baseType: !51)
!184 = !{!185}
!185 = !DISubrange(count: 2414)
!186 = !DILocation(line: 34, column: 11, scope: !145)
!187 = !DILocation(line: 34, column: 17, scope: !145)
!188 = !DILocalVariable(name: "sig", scope: !145, file: !2, line: 36, type: !60)
!189 = !DILocation(line: 36, column: 20, scope: !145)
!190 = !DILocation(line: 36, column: 49, scope: !145)
!191 = !DILocation(line: 36, column: 33, scope: !145)
!192 = !DILocation(line: 36, column: 54, scope: !145)
!193 = !DILocation(line: 36, column: 52, scope: !145)
!194 = !DILocation(line: 36, column: 26, scope: !145)
!195 = !DILocalVariable(name: "msg", scope: !145, file: !2, line: 38, type: !196)
!196 = !DICompositeType(tag: DW_TAG_array_type, baseType: !51, size: 256, elements: !197)
!197 = !{!198}
!198 = !DISubrange(count: 32)
!199 = !DILocation(line: 38, column: 19, scope: !145)
!200 = !DILocalVariable(name: "msg2", scope: !145, file: !2, line: 39, type: !196)
!201 = !DILocation(line: 39, column: 19, scope: !145)
!202 = !DILocation(line: 41, column: 44, scope: !145)
!203 = !DILocation(line: 41, column: 33, scope: !145)
!204 = !DILocation(line: 41, column: 5, scope: !145)
!205 = !DILocation(line: 43, column: 5, scope: !145)
!206 = !DILocalVariable(name: "res", scope: !145, file: !2, line: 44, type: !82)
!207 = !DILocation(line: 44, column: 9, scope: !145)
!208 = !DILocation(line: 44, column: 28, scope: !145)
!209 = !DILocation(line: 44, column: 31, scope: !145)
!210 = !DILocation(line: 44, column: 35, scope: !145)
!211 = !DILocation(line: 44, column: 15, scope: !145)
!212 = !DILocation(line: 45, column: 9, scope: !213)
!213 = distinct !DILexicalBlock(scope: !145, file: !2, line: 45, column: 9)
!214 = !DILocation(line: 45, column: 13, scope: !213)
!215 = !DILocation(line: 46, column: 9, scope: !216)
!216 = distinct !DILexicalBlock(scope: !213, file: !2, line: 45, column: 25)
!217 = !DILocation(line: 47, column: 13, scope: !216)
!218 = !DILocation(line: 48, column: 9, scope: !216)
!219 = !DILocation(line: 50, column: 9, scope: !220)
!220 = distinct !DILexicalBlock(scope: !213, file: !2, line: 49, column: 12)
!221 = !DILocation(line: 53, column: 5, scope: !145)
!222 = !DILocation(line: 54, column: 26, scope: !145)
!223 = !DILocation(line: 54, column: 29, scope: !145)
!224 = !DILocation(line: 54, column: 33, scope: !145)
!225 = !DILocation(line: 54, column: 11, scope: !145)
!226 = !DILocation(line: 54, column: 9, scope: !145)
!227 = !DILocation(line: 55, column: 9, scope: !228)
!228 = distinct !DILexicalBlock(scope: !145, file: !2, line: 55, column: 9)
!229 = !DILocation(line: 55, column: 13, scope: !228)
!230 = !DILocation(line: 56, column: 9, scope: !231)
!231 = distinct !DILexicalBlock(scope: !228, file: !2, line: 55, column: 25)
!232 = !DILocation(line: 57, column: 13, scope: !231)
!233 = !DILocation(line: 58, column: 9, scope: !231)
!234 = !DILocation(line: 60, column: 9, scope: !235)
!235 = distinct !DILexicalBlock(scope: !228, file: !2, line: 59, column: 12)
!236 = !DILocation(line: 63, column: 5, scope: !145)
!237 = !DILocation(line: 64, column: 26, scope: !145)
!238 = !DILocation(line: 64, column: 29, scope: !145)
!239 = !DILocation(line: 64, column: 33, scope: !145)
!240 = !DILocation(line: 64, column: 11, scope: !145)
!241 = !DILocation(line: 64, column: 9, scope: !145)
!242 = !DILocation(line: 65, column: 9, scope: !243)
!243 = distinct !DILexicalBlock(scope: !145, file: !2, line: 65, column: 9)
!244 = !DILocation(line: 65, column: 13, scope: !243)
!245 = !DILocation(line: 66, column: 9, scope: !246)
!246 = distinct !DILexicalBlock(scope: !243, file: !2, line: 65, column: 25)
!247 = !DILocation(line: 67, column: 13, scope: !246)
!248 = !DILocation(line: 68, column: 9, scope: !246)
!249 = !DILocation(line: 70, column: 9, scope: !250)
!250 = distinct !DILexicalBlock(scope: !243, file: !2, line: 69, column: 12)
!251 = !DILocation(line: 73, column: 5, scope: !145)
!252 = !DILocation(line: 74, column: 21, scope: !145)
!253 = !DILocation(line: 74, column: 24, scope: !145)
!254 = !DILocation(line: 74, column: 37, scope: !145)
!255 = !DILocation(line: 74, column: 42, scope: !145)
!256 = !DILocation(line: 74, column: 50, scope: !145)
!257 = !DILocation(line: 74, column: 11, scope: !145)
!258 = !DILocation(line: 74, column: 9, scope: !145)
!259 = !DILocation(line: 75, column: 9, scope: !260)
!260 = distinct !DILexicalBlock(scope: !145, file: !2, line: 75, column: 9)
!261 = !DILocation(line: 75, column: 13, scope: !260)
!262 = !DILocation(line: 76, column: 9, scope: !263)
!263 = distinct !DILexicalBlock(scope: !260, file: !2, line: 75, column: 25)
!264 = !DILocation(line: 77, column: 13, scope: !263)
!265 = !DILocation(line: 78, column: 9, scope: !263)
!266 = !DILocation(line: 80, column: 9, scope: !267)
!267 = distinct !DILexicalBlock(scope: !260, file: !2, line: 79, column: 12)
!268 = !DILocation(line: 83, column: 5, scope: !145)
!269 = !DILocation(line: 84, column: 21, scope: !145)
!270 = !DILocation(line: 84, column: 24, scope: !145)
!271 = !DILocation(line: 84, column: 39, scope: !145)
!272 = !DILocation(line: 84, column: 44, scope: !145)
!273 = !DILocation(line: 84, column: 51, scope: !145)
!274 = !DILocation(line: 84, column: 11, scope: !145)
!275 = !DILocation(line: 84, column: 9, scope: !145)
!276 = !DILocation(line: 85, column: 9, scope: !277)
!277 = distinct !DILexicalBlock(scope: !145, file: !2, line: 85, column: 9)
!278 = !DILocation(line: 85, column: 13, scope: !277)
!279 = !DILocation(line: 85, column: 24, scope: !277)
!280 = !DILocation(line: 85, column: 34, scope: !277)
!281 = !DILocation(line: 85, column: 39, scope: !277)
!282 = !DILocation(line: 85, column: 45, scope: !277)
!283 = !DILocation(line: 85, column: 27, scope: !277)
!284 = !DILocation(line: 86, column: 9, scope: !285)
!285 = distinct !DILexicalBlock(scope: !277, file: !2, line: 85, column: 54)
!286 = !DILocation(line: 87, column: 13, scope: !285)
!287 = !DILocation(line: 88, column: 9, scope: !285)
!288 = !DILocation(line: 90, column: 13, scope: !289)
!289 = distinct !DILexicalBlock(scope: !277, file: !2, line: 89, column: 12)
!290 = !DILocation(line: 91, column: 9, scope: !289)
!291 = !DILocation(line: 94, column: 5, scope: !145)
!292 = !DILocation(line: 95, column: 23, scope: !145)
!293 = !DILocation(line: 95, column: 26, scope: !145)
!294 = !DILocation(line: 95, column: 31, scope: !145)
!295 = !DILocation(line: 95, column: 39, scope: !145)
!296 = !DILocation(line: 95, column: 44, scope: !145)
!297 = !DILocation(line: 95, column: 11, scope: !145)
!298 = !DILocation(line: 95, column: 9, scope: !145)
!299 = !DILocation(line: 96, column: 9, scope: !300)
!300 = distinct !DILexicalBlock(scope: !145, file: !2, line: 96, column: 9)
!301 = !DILocation(line: 96, column: 13, scope: !300)
!302 = !DILocation(line: 97, column: 9, scope: !303)
!303 = distinct !DILexicalBlock(scope: !300, file: !2, line: 96, column: 25)
!304 = !DILocation(line: 98, column: 13, scope: !303)
!305 = !DILocation(line: 99, column: 9, scope: !303)
!306 = !DILocation(line: 101, column: 13, scope: !307)
!307 = distinct !DILexicalBlock(scope: !300, file: !2, line: 100, column: 12)
!308 = !DILocation(line: 102, column: 9, scope: !307)
!309 = !DILocation(line: 105, column: 5, scope: !145)
!310 = !DILocation(line: 106, column: 15, scope: !145)
!311 = !DILocation(line: 106, column: 14, scope: !145)
!312 = !DILocation(line: 106, column: 5, scope: !145)
!313 = !DILocation(line: 106, column: 12, scope: !145)
!314 = !DILocation(line: 107, column: 5, scope: !145)
!315 = !DILocation(line: 107, column: 21, scope: !145)
!316 = !DILocation(line: 108, column: 21, scope: !145)
!317 = !DILocation(line: 108, column: 24, scope: !145)
!318 = !DILocation(line: 108, column: 39, scope: !145)
!319 = !DILocation(line: 108, column: 44, scope: !145)
!320 = !DILocation(line: 108, column: 51, scope: !145)
!321 = !DILocation(line: 108, column: 11, scope: !145)
!322 = !DILocation(line: 108, column: 9, scope: !145)
!323 = !DILocation(line: 109, column: 9, scope: !324)
!324 = distinct !DILexicalBlock(scope: !145, file: !2, line: 109, column: 9)
!325 = !DILocation(line: 109, column: 13, scope: !324)
!326 = !DILocation(line: 109, column: 25, scope: !324)
!327 = !DILocation(line: 109, column: 36, scope: !324)
!328 = !DILocation(line: 109, column: 41, scope: !324)
!329 = !DILocation(line: 109, column: 47, scope: !324)
!330 = !DILocation(line: 109, column: 29, scope: !324)
!331 = !DILocation(line: 110, column: 9, scope: !332)
!332 = distinct !DILexicalBlock(scope: !324, file: !2, line: 109, column: 56)
!333 = !DILocation(line: 111, column: 13, scope: !332)
!334 = !DILocation(line: 112, column: 9, scope: !332)
!335 = !DILocation(line: 114, column: 13, scope: !336)
!336 = distinct !DILexicalBlock(scope: !324, file: !2, line: 113, column: 12)
!337 = !DILocation(line: 115, column: 9, scope: !336)
!338 = !DILocation(line: 118, column: 5, scope: !145)
!339 = !DILocation(line: 119, column: 23, scope: !145)
!340 = !DILocation(line: 119, column: 26, scope: !145)
!341 = !DILocation(line: 119, column: 31, scope: !145)
!342 = !DILocation(line: 119, column: 39, scope: !145)
!343 = !DILocation(line: 119, column: 44, scope: !145)
!344 = !DILocation(line: 119, column: 11, scope: !145)
!345 = !DILocation(line: 119, column: 9, scope: !145)
!346 = !DILocation(line: 120, column: 9, scope: !347)
!347 = distinct !DILexicalBlock(scope: !145, file: !2, line: 120, column: 9)
!348 = !DILocation(line: 120, column: 13, scope: !347)
!349 = !DILocation(line: 121, column: 9, scope: !350)
!350 = distinct !DILexicalBlock(scope: !347, file: !2, line: 120, column: 25)
!351 = !DILocation(line: 122, column: 13, scope: !350)
!352 = !DILocation(line: 123, column: 9, scope: !350)
!353 = !DILocation(line: 125, column: 13, scope: !354)
!354 = distinct !DILexicalBlock(scope: !347, file: !2, line: 124, column: 12)
!355 = !DILocation(line: 126, column: 9, scope: !354)
!356 = !DILocation(line: 120, column: 16, scope: !347)
!357 = !DILabel(scope: !145, name: "err", file: !2, line: 129, column: 1)
!358 = !DILocation(line: 129, column: 1, scope: !145)
!359 = !DILocation(line: 130, column: 10, scope: !145)
!360 = !DILocation(line: 130, column: 5, scope: !145)
!361 = !DILocation(line: 131, column: 10, scope: !145)
!362 = !DILocation(line: 131, column: 5, scope: !145)
!363 = !DILocation(line: 132, column: 22, scope: !145)
!364 = !DILocation(line: 132, column: 42, scope: !145)
!365 = !DILocation(line: 132, column: 26, scope: !145)
!366 = !DILocation(line: 132, column: 5, scope: !145)
!367 = !DILocation(line: 133, column: 22, scope: !145)
!368 = !DILocation(line: 133, column: 5, scope: !145)
!369 = !DILocation(line: 134, column: 10, scope: !145)
!370 = !DILocation(line: 134, column: 5, scope: !145)
!371 = !DILocation(line: 135, column: 12, scope: !145)
!372 = !DILocation(line: 135, column: 5, scope: !145)
!373 = distinct !DISubprogram(name: "mayo_keypair", scope: !65, file: !65, line: 298, type: !374, scopeLine: 298, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !48, retainedNodes: !68)
!374 = !DISubroutineType(types: !375)
!375 = !{!82, !376, !60, !60}
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64)
!377 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !378)
!378 = !DIDerivedType(tag: DW_TAG_typedef, name: "mayo_params_t", file: !88, line: 289, baseType: !379)
!379 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !88, line: 265, size: 832, elements: !380)
!380 = !{!381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !379, file: !88, line: 266, baseType: !82, size: 32)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !379, file: !88, line: 267, baseType: !82, size: 32, offset: 32)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "o", scope: !379, file: !88, line: 268, baseType: !82, size: 32, offset: 64)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "k", scope: !379, file: !88, line: 269, baseType: !82, size: 32, offset: 96)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !379, file: !88, line: 270, baseType: !82, size: 32, offset: 128)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "f_tail", scope: !379, file: !88, line: 271, baseType: !97, size: 64, offset: 192)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "m_bytes", scope: !379, file: !88, line: 272, baseType: !82, size: 32, offset: 256)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "O_bytes", scope: !379, file: !88, line: 273, baseType: !82, size: 32, offset: 288)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "v_bytes", scope: !379, file: !88, line: 274, baseType: !82, size: 32, offset: 320)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "r_bytes", scope: !379, file: !88, line: 275, baseType: !82, size: 32, offset: 352)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "R_bytes", scope: !379, file: !88, line: 276, baseType: !82, size: 32, offset: 384)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "P1_bytes", scope: !379, file: !88, line: 277, baseType: !82, size: 32, offset: 416)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "P2_bytes", scope: !379, file: !88, line: 278, baseType: !82, size: 32, offset: 448)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "P3_bytes", scope: !379, file: !88, line: 279, baseType: !82, size: 32, offset: 480)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "csk_bytes", scope: !379, file: !88, line: 280, baseType: !82, size: 32, offset: 512)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "cpk_bytes", scope: !379, file: !88, line: 281, baseType: !82, size: 32, offset: 544)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "sig_bytes", scope: !379, file: !88, line: 282, baseType: !82, size: 32, offset: 576)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "salt_bytes", scope: !379, file: !88, line: 283, baseType: !82, size: 32, offset: 608)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "sk_seed_bytes", scope: !379, file: !88, line: 284, baseType: !82, size: 32, offset: 640)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "digest_bytes", scope: !379, file: !88, line: 285, baseType: !82, size: 32, offset: 672)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "pk_seed_bytes", scope: !379, file: !88, line: 286, baseType: !82, size: 32, offset: 704)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "m_vec_limbs", scope: !379, file: !88, line: 287, baseType: !82, size: 32, offset: 736)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !379, file: !88, line: 288, baseType: !116, size: 64, offset: 768)
!404 = !DILocalVariable(name: "p", arg: 1, scope: !373, file: !65, line: 298, type: !376)
!405 = !DILocation(line: 298, column: 39, scope: !373)
!406 = !DILocalVariable(name: "pk", arg: 2, scope: !373, file: !65, line: 298, type: !60)
!407 = !DILocation(line: 298, column: 57, scope: !373)
!408 = !DILocalVariable(name: "sk", arg: 3, scope: !373, file: !65, line: 298, type: !60)
!409 = !DILocation(line: 298, column: 76, scope: !373)
!410 = !DILocalVariable(name: "ret", scope: !373, file: !65, line: 299, type: !82)
!411 = !DILocation(line: 299, column: 9, scope: !373)
!412 = !DILocation(line: 301, column: 32, scope: !373)
!413 = !DILocation(line: 301, column: 35, scope: !373)
!414 = !DILocation(line: 301, column: 39, scope: !373)
!415 = !DILocation(line: 301, column: 11, scope: !373)
!416 = !DILocation(line: 301, column: 9, scope: !373)
!417 = !DILocation(line: 302, column: 9, scope: !418)
!418 = distinct !DILexicalBlock(scope: !373, file: !65, line: 302, column: 9)
!419 = !DILocation(line: 302, column: 13, scope: !418)
!420 = !DILocation(line: 303, column: 9, scope: !421)
!421 = distinct !DILexicalBlock(scope: !418, file: !65, line: 302, column: 25)
!422 = !DILocation(line: 302, column: 16, scope: !418)
!423 = !DILabel(scope: !373, name: "err", file: !65, line: 306, column: 1)
!424 = !DILocation(line: 306, column: 1, scope: !373)
!425 = !DILocation(line: 307, column: 12, scope: !373)
!426 = !DILocation(line: 307, column: 5, scope: !373)
!427 = distinct !DISubprogram(name: "mayo_keypair_compact", scope: !65, file: !65, line: 538, type: !374, scopeLine: 539, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !48, retainedNodes: !68)
!428 = !DILocalVariable(name: "p", arg: 1, scope: !427, file: !65, line: 538, type: !376)
!429 = !DILocation(line: 538, column: 47, scope: !427)
!430 = !DILocalVariable(name: "cpk", arg: 2, scope: !427, file: !65, line: 538, type: !60)
!431 = !DILocation(line: 538, column: 65, scope: !427)
!432 = !DILocalVariable(name: "csk", arg: 3, scope: !427, file: !65, line: 539, type: !60)
!433 = !DILocation(line: 539, column: 41, scope: !427)
!434 = !DILocalVariable(name: "ret", scope: !427, file: !65, line: 540, type: !82)
!435 = !DILocation(line: 540, column: 9, scope: !427)
!436 = !DILocalVariable(name: "seed_sk", scope: !427, file: !65, line: 541, type: !60)
!437 = !DILocation(line: 541, column: 20, scope: !427)
!438 = !DILocation(line: 541, column: 30, scope: !427)
!439 = !DILocalVariable(name: "S", scope: !427, file: !65, line: 542, type: !440)
!440 = !DICompositeType(tag: DW_TAG_array_type, baseType: !51, size: 6944, elements: !441)
!441 = !{!442}
!442 = !DISubrange(count: 868)
!443 = !DILocation(line: 542, column: 19, scope: !427)
!444 = !DILocalVariable(name: "P", scope: !427, file: !65, line: 543, type: !177)
!445 = !DILocation(line: 543, column: 14, scope: !427)
!446 = !DILocalVariable(name: "P3", scope: !427, file: !65, line: 544, type: !447)
!447 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 166464, elements: !448)
!448 = !{!449}
!449 = !DISubrange(count: 2601)
!450 = !DILocation(line: 544, column: 14, scope: !427)
!451 = !DILocalVariable(name: "seed_pk", scope: !427, file: !65, line: 546, type: !60)
!452 = !DILocation(line: 546, column: 20, scope: !427)
!453 = !DILocalVariable(name: "O", scope: !427, file: !65, line: 547, type: !454)
!454 = !DICompositeType(tag: DW_TAG_array_type, baseType: !51, size: 19312, elements: !184)
!455 = !DILocation(line: 547, column: 19, scope: !427)
!456 = !DILocalVariable(name: "m_vec_limbs", scope: !427, file: !65, line: 549, type: !457)
!457 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !82)
!458 = !DILocation(line: 549, column: 15, scope: !427)
!459 = !DILocation(line: 549, column: 47, scope: !427)
!460 = !DILocation(line: 549, column: 29, scope: !427)
!461 = !DILocalVariable(name: "param_m", scope: !427, file: !65, line: 550, type: !457)
!462 = !DILocation(line: 550, column: 15, scope: !427)
!463 = !DILocation(line: 550, column: 33, scope: !427)
!464 = !DILocation(line: 550, column: 25, scope: !427)
!465 = !DILocalVariable(name: "param_v", scope: !427, file: !65, line: 551, type: !457)
!466 = !DILocation(line: 551, column: 15, scope: !427)
!467 = !DILocation(line: 551, column: 33, scope: !427)
!468 = !DILocation(line: 551, column: 25, scope: !427)
!469 = !DILocalVariable(name: "param_o", scope: !427, file: !65, line: 552, type: !457)
!470 = !DILocation(line: 552, column: 15, scope: !427)
!471 = !DILocation(line: 552, column: 33, scope: !427)
!472 = !DILocation(line: 552, column: 25, scope: !427)
!473 = !DILocalVariable(name: "param_O_bytes", scope: !427, file: !65, line: 553, type: !457)
!474 = !DILocation(line: 553, column: 15, scope: !427)
!475 = !DILocation(line: 553, column: 45, scope: !427)
!476 = !DILocation(line: 553, column: 31, scope: !427)
!477 = !DILocalVariable(name: "param_P1_limbs", scope: !427, file: !65, line: 554, type: !457)
!478 = !DILocation(line: 554, column: 15, scope: !427)
!479 = !DILocation(line: 554, column: 47, scope: !427)
!480 = !DILocation(line: 554, column: 32, scope: !427)
!481 = !DILocalVariable(name: "param_P3_limbs", scope: !427, file: !65, line: 555, type: !457)
!482 = !DILocation(line: 555, column: 15, scope: !427)
!483 = !DILocation(line: 555, column: 47, scope: !427)
!484 = !DILocation(line: 555, column: 32, scope: !427)
!485 = !DILocalVariable(name: "param_pk_seed_bytes", scope: !427, file: !65, line: 556, type: !457)
!486 = !DILocation(line: 556, column: 15, scope: !427)
!487 = !DILocation(line: 556, column: 57, scope: !427)
!488 = !DILocation(line: 556, column: 37, scope: !427)
!489 = !DILocalVariable(name: "param_sk_seed_bytes", scope: !427, file: !65, line: 557, type: !457)
!490 = !DILocation(line: 557, column: 15, scope: !427)
!491 = !DILocation(line: 557, column: 57, scope: !427)
!492 = !DILocation(line: 557, column: 37, scope: !427)
!493 = !DILocalVariable(name: "P1", scope: !427, file: !65, line: 559, type: !52)
!494 = !DILocation(line: 559, column: 15, scope: !427)
!495 = !DILocation(line: 559, column: 20, scope: !427)
!496 = !DILocalVariable(name: "P2", scope: !427, file: !65, line: 560, type: !52)
!497 = !DILocation(line: 560, column: 15, scope: !427)
!498 = !DILocation(line: 560, column: 20, scope: !427)
!499 = !DILocation(line: 560, column: 24, scope: !427)
!500 = !DILocation(line: 560, column: 22, scope: !427)
!501 = !DILocation(line: 566, column: 21, scope: !502)
!502 = distinct !DILexicalBlock(scope: !427, file: !65, line: 566, column: 9)
!503 = !DILocation(line: 566, column: 30, scope: !502)
!504 = !DILocation(line: 566, column: 9, scope: !502)
!505 = !DILocation(line: 566, column: 51, scope: !502)
!506 = !DILocation(line: 567, column: 13, scope: !507)
!507 = distinct !DILexicalBlock(scope: !502, file: !65, line: 566, column: 63)
!508 = !DILocation(line: 568, column: 9, scope: !507)
!509 = !DILocation(line: 573, column: 14, scope: !427)
!510 = !DILocation(line: 573, column: 17, scope: !427)
!511 = !DILocation(line: 573, column: 39, scope: !427)
!512 = !DILocation(line: 573, column: 37, scope: !427)
!513 = !DILocation(line: 573, column: 54, scope: !427)
!514 = !DILocation(line: 574, column: 14, scope: !427)
!515 = !DILocation(line: 573, column: 5, scope: !427)
!516 = !DILocation(line: 576, column: 15, scope: !427)
!517 = !DILocation(line: 576, column: 13, scope: !427)
!518 = !DILocation(line: 579, column: 12, scope: !427)
!519 = !DILocation(line: 579, column: 16, scope: !427)
!520 = !DILocation(line: 579, column: 14, scope: !427)
!521 = !DILocation(line: 579, column: 37, scope: !427)
!522 = !DILocation(line: 579, column: 40, scope: !427)
!523 = !DILocation(line: 579, column: 50, scope: !427)
!524 = !DILocation(line: 579, column: 48, scope: !427)
!525 = !DILocation(line: 579, column: 5, scope: !427)
!526 = !DILocation(line: 585, column: 18, scope: !427)
!527 = !DILocation(line: 585, column: 21, scope: !427)
!528 = !DILocation(line: 585, column: 24, scope: !427)
!529 = !DILocation(line: 585, column: 5, scope: !427)
!530 = !DILocation(line: 588, column: 16, scope: !427)
!531 = !DILocation(line: 588, column: 19, scope: !427)
!532 = !DILocation(line: 588, column: 23, scope: !427)
!533 = !DILocation(line: 588, column: 27, scope: !427)
!534 = !DILocation(line: 588, column: 30, scope: !427)
!535 = !DILocation(line: 588, column: 5, scope: !427)
!536 = !DILocation(line: 591, column: 12, scope: !427)
!537 = !DILocation(line: 591, column: 17, scope: !427)
!538 = !DILocation(line: 591, column: 26, scope: !427)
!539 = !DILocation(line: 591, column: 5, scope: !427)
!540 = !DILocalVariable(name: "P3_upper", scope: !427, file: !65, line: 593, type: !541)
!541 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 88128, elements: !542)
!542 = !{!543}
!543 = !DISubrange(count: 1377)
!544 = !DILocation(line: 593, column: 14, scope: !427)
!545 = !DILocation(line: 596, column: 13, scope: !427)
!546 = !DILocation(line: 596, column: 16, scope: !427)
!547 = !DILocation(line: 596, column: 20, scope: !427)
!548 = !DILocation(line: 596, column: 30, scope: !427)
!549 = !DILocation(line: 596, column: 5, scope: !427)
!550 = !DILocation(line: 597, column: 17, scope: !427)
!551 = !DILocation(line: 597, column: 27, scope: !427)
!552 = !DILocation(line: 597, column: 33, scope: !427)
!553 = !DILocation(line: 597, column: 31, scope: !427)
!554 = !DILocation(line: 597, column: 54, scope: !427)
!555 = !DILocation(line: 597, column: 69, scope: !427)
!556 = !DILocation(line: 597, column: 68, scope: !427)
!557 = !DILocation(line: 597, column: 82, scope: !427)
!558 = !DILocation(line: 597, column: 5, scope: !427)
!559 = !DILabel(scope: !427, name: "err", file: !65, line: 600, column: 5)
!560 = !DILocation(line: 600, column: 5, scope: !427)
!561 = !DILocation(line: 602, column: 23, scope: !427)
!562 = !DILocation(line: 602, column: 5, scope: !427)
!563 = !DILocation(line: 603, column: 23, scope: !427)
!564 = !DILocation(line: 603, column: 42, scope: !427)
!565 = !DILocation(line: 603, column: 27, scope: !427)
!566 = !DILocation(line: 603, column: 44, scope: !427)
!567 = !DILocation(line: 603, column: 5, scope: !427)
!568 = !DILocation(line: 604, column: 23, scope: !427)
!569 = !DILocation(line: 604, column: 5, scope: !427)
!570 = !DILocation(line: 605, column: 12, scope: !427)
!571 = !DILocation(line: 605, column: 5, scope: !427)
!572 = distinct !DISubprogram(name: "decode", scope: !65, file: !65, line: 20, type: !573, scopeLine: 20, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !48, retainedNodes: !68)
!573 = !DISubroutineType(types: !574)
!574 = !{null, !97, !60, !82}
!575 = !DILocalVariable(name: "m", arg: 1, scope: !572, file: !65, line: 20, type: !97)
!576 = !DILocation(line: 20, column: 41, scope: !572)
!577 = !DILocalVariable(name: "mdec", arg: 2, scope: !572, file: !65, line: 20, type: !60)
!578 = !DILocation(line: 20, column: 59, scope: !572)
!579 = !DILocalVariable(name: "mdeclen", arg: 3, scope: !572, file: !65, line: 20, type: !82)
!580 = !DILocation(line: 20, column: 69, scope: !572)
!581 = !DILocalVariable(name: "i", scope: !572, file: !65, line: 21, type: !82)
!582 = !DILocation(line: 21, column: 9, scope: !572)
!583 = !DILocation(line: 22, column: 12, scope: !584)
!584 = distinct !DILexicalBlock(scope: !572, file: !65, line: 22, column: 5)
!585 = !DILocation(line: 22, column: 10, scope: !584)
!586 = !DILocation(line: 22, column: 17, scope: !587)
!587 = distinct !DILexicalBlock(scope: !584, file: !65, line: 22, column: 5)
!588 = !DILocation(line: 22, column: 21, scope: !587)
!589 = !DILocation(line: 22, column: 29, scope: !587)
!590 = !DILocation(line: 22, column: 19, scope: !587)
!591 = !DILocation(line: 22, column: 5, scope: !584)
!592 = !DILocation(line: 23, column: 19, scope: !593)
!593 = distinct !DILexicalBlock(scope: !587, file: !65, line: 22, column: 39)
!594 = !DILocation(line: 23, column: 21, scope: !593)
!595 = !DILocation(line: 23, column: 24, scope: !593)
!596 = !DILocation(line: 23, column: 14, scope: !593)
!597 = !DILocation(line: 23, column: 17, scope: !593)
!598 = !DILocation(line: 24, column: 19, scope: !593)
!599 = !DILocation(line: 24, column: 21, scope: !593)
!600 = !DILocation(line: 24, column: 24, scope: !593)
!601 = !DILocation(line: 24, column: 14, scope: !593)
!602 = !DILocation(line: 24, column: 17, scope: !593)
!603 = !DILocation(line: 25, column: 5, scope: !593)
!604 = !DILocation(line: 22, column: 34, scope: !587)
!605 = !DILocation(line: 22, column: 5, scope: !587)
!606 = distinct !{!606, !591, !607, !143}
!607 = !DILocation(line: 25, column: 5, scope: !584)
!608 = !DILocation(line: 27, column: 9, scope: !609)
!609 = distinct !DILexicalBlock(scope: !572, file: !65, line: 27, column: 9)
!610 = !DILocation(line: 27, column: 17, scope: !609)
!611 = !DILocation(line: 27, column: 21, scope: !609)
!612 = !DILocation(line: 28, column: 19, scope: !613)
!613 = distinct !DILexicalBlock(scope: !609, file: !65, line: 27, column: 27)
!614 = !DILocation(line: 28, column: 21, scope: !613)
!615 = !DILocation(line: 28, column: 24, scope: !613)
!616 = !DILocation(line: 28, column: 14, scope: !613)
!617 = !DILocation(line: 28, column: 17, scope: !613)
!618 = !DILocation(line: 29, column: 5, scope: !613)
!619 = !DILocation(line: 30, column: 1, scope: !572)
!620 = distinct !DISubprogram(name: "expand_P1_P2", scope: !65, file: !65, line: 280, type: !621, scopeLine: 280, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !48, retainedNodes: !68)
!621 = !DISubroutineType(types: !622)
!622 = !{null, !376, !52, !97}
!623 = !DILocalVariable(name: "p", arg: 1, scope: !620, file: !65, line: 280, type: !376)
!624 = !DILocation(line: 280, column: 47, scope: !620)
!625 = !DILocalVariable(name: "P", arg: 2, scope: !620, file: !65, line: 280, type: !52)
!626 = !DILocation(line: 280, column: 60, scope: !620)
!627 = !DILocalVariable(name: "seed_pk", arg: 3, scope: !620, file: !65, line: 280, type: !97)
!628 = !DILocation(line: 280, column: 84, scope: !620)
!629 = !DILocation(line: 284, column: 29, scope: !620)
!630 = !DILocation(line: 284, column: 47, scope: !620)
!631 = !DILocation(line: 284, column: 32, scope: !620)
!632 = !DILocation(line: 284, column: 67, scope: !620)
!633 = !DILocation(line: 284, column: 52, scope: !620)
!634 = !DILocation(line: 284, column: 50, scope: !620)
!635 = !DILocation(line: 284, column: 71, scope: !620)
!636 = !DILocation(line: 284, column: 100, scope: !620)
!637 = !DILocation(line: 284, column: 80, scope: !620)
!638 = !DILocation(line: 284, column: 5, scope: !620)
!639 = !DILocation(line: 285, column: 36, scope: !620)
!640 = !DILocation(line: 285, column: 39, scope: !620)
!641 = !DILocation(line: 285, column: 58, scope: !620)
!642 = !DILocation(line: 285, column: 43, scope: !620)
!643 = !DILocation(line: 285, column: 78, scope: !620)
!644 = !DILocation(line: 285, column: 63, scope: !620)
!645 = !DILocation(line: 285, column: 61, scope: !620)
!646 = !DILocation(line: 285, column: 100, scope: !620)
!647 = !DILocation(line: 285, column: 82, scope: !620)
!648 = !DILocation(line: 285, column: 81, scope: !620)
!649 = !DILocation(line: 285, column: 112, scope: !620)
!650 = !DILocation(line: 285, column: 104, scope: !620)
!651 = !DILocation(line: 285, column: 5, scope: !620)
!652 = !DILocation(line: 286, column: 1, scope: !620)
!653 = distinct !DISubprogram(name: "compute_P3", scope: !654, file: !654, line: 260, type: !655, scopeLine: 260, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !48, retainedNodes: !68)
!654 = !DIFile(filename: "../src/generic/generic_arithmetic.h", directory: "")
!655 = !DISubroutineType(types: !656)
!656 = !{null, !376, !657, !52, !97, !52}
!657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!658 = !DILocalVariable(name: "p", arg: 1, scope: !653, file: !654, line: 260, type: !376)
!659 = !DILocation(line: 260, column: 38, scope: !653)
!660 = !DILocalVariable(name: "P1", arg: 2, scope: !653, file: !654, line: 260, type: !657)
!661 = !DILocation(line: 260, column: 57, scope: !653)
!662 = !DILocalVariable(name: "P2", arg: 3, scope: !653, file: !654, line: 260, type: !52)
!663 = !DILocation(line: 260, column: 71, scope: !653)
!664 = !DILocalVariable(name: "O", arg: 4, scope: !653, file: !654, line: 260, type: !97)
!665 = !DILocation(line: 260, column: 96, scope: !653)
!666 = !DILocalVariable(name: "P3", arg: 5, scope: !653, file: !654, line: 260, type: !52)
!667 = !DILocation(line: 260, column: 109, scope: !653)
!668 = !DILocalVariable(name: "m_vec_limbs", scope: !653, file: !654, line: 262, type: !457)
!669 = !DILocation(line: 262, column: 15, scope: !653)
!670 = !DILocation(line: 262, column: 47, scope: !653)
!671 = !DILocation(line: 262, column: 29, scope: !653)
!672 = !DILocalVariable(name: "param_v", scope: !653, file: !654, line: 263, type: !457)
!673 = !DILocation(line: 263, column: 15, scope: !653)
!674 = !DILocation(line: 263, column: 33, scope: !653)
!675 = !DILocation(line: 263, column: 25, scope: !653)
!676 = !DILocalVariable(name: "param_o", scope: !653, file: !654, line: 264, type: !457)
!677 = !DILocation(line: 264, column: 15, scope: !653)
!678 = !DILocation(line: 264, column: 33, scope: !653)
!679 = !DILocation(line: 264, column: 25, scope: !653)
!680 = !DILocation(line: 267, column: 16, scope: !653)
!681 = !DILocation(line: 267, column: 19, scope: !653)
!682 = !DILocation(line: 267, column: 23, scope: !653)
!683 = !DILocation(line: 267, column: 26, scope: !653)
!684 = !DILocation(line: 267, column: 5, scope: !653)
!685 = !DILocation(line: 270, column: 31, scope: !653)
!686 = !DILocation(line: 270, column: 44, scope: !653)
!687 = !DILocation(line: 270, column: 47, scope: !653)
!688 = !DILocation(line: 270, column: 51, scope: !653)
!689 = !DILocation(line: 270, column: 55, scope: !653)
!690 = !DILocation(line: 270, column: 64, scope: !653)
!691 = !DILocation(line: 270, column: 73, scope: !653)
!692 = !DILocation(line: 270, column: 5, scope: !653)
!693 = !DILocation(line: 271, column: 1, scope: !653)
!694 = distinct !DISubprogram(name: "pack_m_vecs", scope: !65, file: !65, line: 272, type: !695, scopeLine: 272, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !48, retainedNodes: !68)
!695 = !DISubroutineType(types: !696)
!696 = !{null, !657, !60, !82, !82}
!697 = !DILocalVariable(name: "in", arg: 1, scope: !694, file: !65, line: 272, type: !657)
!698 = !DILocation(line: 272, column: 41, scope: !694)
!699 = !DILocalVariable(name: "out", arg: 2, scope: !694, file: !65, line: 272, type: !60)
!700 = !DILocation(line: 272, column: 60, scope: !694)
!701 = !DILocalVariable(name: "vecs", arg: 3, scope: !694, file: !65, line: 272, type: !82)
!702 = !DILocation(line: 272, column: 69, scope: !694)
!703 = !DILocalVariable(name: "m", arg: 4, scope: !694, file: !65, line: 272, type: !82)
!704 = !DILocation(line: 272, column: 79, scope: !694)
!705 = !DILocalVariable(name: "m_vec_limbs", scope: !694, file: !65, line: 273, type: !457)
!706 = !DILocation(line: 273, column: 15, scope: !694)
!707 = !DILocation(line: 273, column: 30, scope: !694)
!708 = !DILocation(line: 273, column: 32, scope: !694)
!709 = !DILocation(line: 273, column: 38, scope: !694)
!710 = !DILocalVariable(name: "_in", scope: !694, file: !65, line: 274, type: !60)
!711 = !DILocation(line: 274, column: 20, scope: !694)
!712 = !DILocation(line: 274, column: 44, scope: !694)
!713 = !DILocalVariable(name: "i", scope: !714, file: !65, line: 275, type: !82)
!714 = distinct !DILexicalBlock(scope: !694, file: !65, line: 275, column: 5)
!715 = !DILocation(line: 275, column: 14, scope: !714)
!716 = !DILocation(line: 275, column: 10, scope: !714)
!717 = !DILocation(line: 275, column: 21, scope: !718)
!718 = distinct !DILexicalBlock(scope: !714, file: !65, line: 275, column: 5)
!719 = !DILocation(line: 275, column: 25, scope: !718)
!720 = !DILocation(line: 275, column: 23, scope: !718)
!721 = !DILocation(line: 275, column: 5, scope: !714)
!722 = !DILocation(line: 277, column: 17, scope: !723)
!723 = distinct !DILexicalBlock(scope: !718, file: !65, line: 276, column: 5)
!724 = !DILocation(line: 277, column: 24, scope: !723)
!725 = !DILocation(line: 277, column: 26, scope: !723)
!726 = !DILocation(line: 277, column: 25, scope: !723)
!727 = !DILocation(line: 277, column: 27, scope: !723)
!728 = !DILocation(line: 277, column: 9, scope: !723)
!729 = !DILocation(line: 277, column: 32, scope: !723)
!730 = !DILocation(line: 277, column: 38, scope: !723)
!731 = !DILocation(line: 277, column: 40, scope: !723)
!732 = !DILocation(line: 277, column: 39, scope: !723)
!733 = !DILocation(line: 277, column: 51, scope: !723)
!734 = !DILocation(line: 277, column: 70, scope: !723)
!735 = !DILocation(line: 277, column: 71, scope: !723)
!736 = !DILocation(line: 278, column: 5, scope: !723)
!737 = !DILocation(line: 275, column: 32, scope: !718)
!738 = !DILocation(line: 275, column: 5, scope: !718)
!739 = distinct !{!739, !721, !740, !143}
!740 = !DILocation(line: 278, column: 5, scope: !714)
!741 = !DILocation(line: 279, column: 1, scope: !694)
!742 = distinct !DISubprogram(name: "P1_times_O", scope: !654, file: !654, line: 74, type: !743, scopeLine: 74, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !48, retainedNodes: !68)
!743 = !DISubroutineType(types: !744)
!744 = !{null, !376, !657, !97, !52}
!745 = !DILocalVariable(name: "p", arg: 1, scope: !742, file: !654, line: 74, type: !376)
!746 = !DILocation(line: 74, column: 38, scope: !742)
!747 = !DILocalVariable(name: "P1", arg: 2, scope: !742, file: !654, line: 74, type: !657)
!748 = !DILocation(line: 74, column: 57, scope: !742)
!749 = !DILocalVariable(name: "O", arg: 3, scope: !742, file: !654, line: 74, type: !97)
!750 = !DILocation(line: 74, column: 82, scope: !742)
!751 = !DILocalVariable(name: "acc", arg: 4, scope: !742, file: !654, line: 74, type: !52)
!752 = !DILocation(line: 74, column: 95, scope: !742)
!753 = !DILocation(line: 78, column: 60, scope: !742)
!754 = !DILocation(line: 78, column: 42, scope: !742)
!755 = !DILocation(line: 78, column: 64, scope: !742)
!756 = !DILocation(line: 78, column: 68, scope: !742)
!757 = !DILocation(line: 78, column: 71, scope: !742)
!758 = !DILocation(line: 78, column: 84, scope: !742)
!759 = !DILocation(line: 78, column: 76, scope: !742)
!760 = !DILocation(line: 78, column: 96, scope: !742)
!761 = !DILocation(line: 78, column: 88, scope: !742)
!762 = !DILocation(line: 78, column: 108, scope: !742)
!763 = !DILocation(line: 78, column: 100, scope: !742)
!764 = !DILocation(line: 78, column: 5, scope: !742)
!765 = !DILocation(line: 79, column: 1, scope: !742)
!766 = distinct !DISubprogram(name: "mul_add_mat_trans_x_m_mat", scope: !654, file: !654, line: 47, type: !767, scopeLine: 48, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !48, retainedNodes: !68)
!767 = !DISubroutineType(types: !768)
!768 = !{null, !457, !97, !657, !52, !457, !457, !457}
!769 = !DILocalVariable(name: "m_vec_limbs", arg: 1, scope: !766, file: !654, line: 47, type: !457)
!770 = !DILocation(line: 47, column: 42, scope: !766)
!771 = !DILocalVariable(name: "mat", arg: 2, scope: !766, file: !654, line: 47, type: !97)
!772 = !DILocation(line: 47, column: 76, scope: !766)
!773 = !DILocalVariable(name: "bs_mat", arg: 3, scope: !766, file: !654, line: 47, type: !657)
!774 = !DILocation(line: 47, column: 97, scope: !766)
!775 = !DILocalVariable(name: "acc", arg: 4, scope: !766, file: !654, line: 47, type: !52)
!776 = !DILocation(line: 47, column: 115, scope: !766)
!777 = !DILocalVariable(name: "mat_rows", arg: 5, scope: !766, file: !654, line: 48, type: !457)
!778 = !DILocation(line: 48, column: 42, scope: !766)
!779 = !DILocalVariable(name: "mat_cols", arg: 6, scope: !766, file: !654, line: 48, type: !457)
!780 = !DILocation(line: 48, column: 62, scope: !766)
!781 = !DILocalVariable(name: "bs_mat_cols", arg: 7, scope: !766, file: !654, line: 48, type: !457)
!782 = !DILocation(line: 48, column: 82, scope: !766)
!783 = !DILocalVariable(name: "r", scope: !784, file: !654, line: 50, type: !82)
!784 = distinct !DILexicalBlock(scope: !766, file: !654, line: 50, column: 5)
!785 = !DILocation(line: 50, column: 14, scope: !784)
!786 = !DILocation(line: 50, column: 10, scope: !784)
!787 = !DILocation(line: 50, column: 21, scope: !788)
!788 = distinct !DILexicalBlock(scope: !784, file: !654, line: 50, column: 5)
!789 = !DILocation(line: 50, column: 25, scope: !788)
!790 = !DILocation(line: 50, column: 23, scope: !788)
!791 = !DILocation(line: 50, column: 5, scope: !784)
!792 = !DILocalVariable(name: "c", scope: !793, file: !654, line: 51, type: !82)
!793 = distinct !DILexicalBlock(scope: !794, file: !654, line: 51, column: 9)
!794 = distinct !DILexicalBlock(scope: !788, file: !654, line: 50, column: 40)
!795 = !DILocation(line: 51, column: 18, scope: !793)
!796 = !DILocation(line: 51, column: 14, scope: !793)
!797 = !DILocation(line: 51, column: 25, scope: !798)
!798 = distinct !DILexicalBlock(scope: !793, file: !654, line: 51, column: 9)
!799 = !DILocation(line: 51, column: 29, scope: !798)
!800 = !DILocation(line: 51, column: 27, scope: !798)
!801 = !DILocation(line: 51, column: 9, scope: !793)
!802 = !DILocalVariable(name: "k", scope: !803, file: !654, line: 52, type: !82)
!803 = distinct !DILexicalBlock(scope: !804, file: !654, line: 52, column: 13)
!804 = distinct !DILexicalBlock(scope: !798, file: !654, line: 51, column: 44)
!805 = !DILocation(line: 52, column: 22, scope: !803)
!806 = !DILocation(line: 52, column: 18, scope: !803)
!807 = !DILocation(line: 52, column: 29, scope: !808)
!808 = distinct !DILexicalBlock(scope: !803, file: !654, line: 52, column: 13)
!809 = !DILocation(line: 52, column: 33, scope: !808)
!810 = !DILocation(line: 52, column: 31, scope: !808)
!811 = !DILocation(line: 52, column: 13, scope: !803)
!812 = !DILocation(line: 53, column: 31, scope: !813)
!813 = distinct !DILexicalBlock(scope: !808, file: !654, line: 52, column: 54)
!814 = !DILocation(line: 53, column: 44, scope: !813)
!815 = !DILocation(line: 53, column: 53, scope: !813)
!816 = !DILocation(line: 53, column: 68, scope: !813)
!817 = !DILocation(line: 53, column: 72, scope: !813)
!818 = !DILocation(line: 53, column: 70, scope: !813)
!819 = !DILocation(line: 53, column: 86, scope: !813)
!820 = !DILocation(line: 53, column: 84, scope: !813)
!821 = !DILocation(line: 53, column: 65, scope: !813)
!822 = !DILocation(line: 53, column: 51, scope: !813)
!823 = !DILocation(line: 53, column: 90, scope: !813)
!824 = !DILocation(line: 53, column: 94, scope: !813)
!825 = !DILocation(line: 53, column: 98, scope: !813)
!826 = !DILocation(line: 53, column: 96, scope: !813)
!827 = !DILocation(line: 53, column: 109, scope: !813)
!828 = !DILocation(line: 53, column: 107, scope: !813)
!829 = !DILocation(line: 53, column: 113, scope: !813)
!830 = !DILocation(line: 53, column: 119, scope: !813)
!831 = !DILocation(line: 53, column: 134, scope: !813)
!832 = !DILocation(line: 53, column: 138, scope: !813)
!833 = !DILocation(line: 53, column: 136, scope: !813)
!834 = !DILocation(line: 53, column: 152, scope: !813)
!835 = !DILocation(line: 53, column: 150, scope: !813)
!836 = !DILocation(line: 53, column: 131, scope: !813)
!837 = !DILocation(line: 53, column: 117, scope: !813)
!838 = !DILocation(line: 53, column: 17, scope: !813)
!839 = !DILocation(line: 54, column: 13, scope: !813)
!840 = !DILocation(line: 52, column: 48, scope: !808)
!841 = !DILocation(line: 52, column: 13, scope: !808)
!842 = distinct !{!842, !811, !843, !143}
!843 = !DILocation(line: 54, column: 13, scope: !803)
!844 = !DILocation(line: 55, column: 9, scope: !804)
!845 = !DILocation(line: 51, column: 40, scope: !798)
!846 = !DILocation(line: 51, column: 9, scope: !798)
!847 = distinct !{!847, !801, !848, !143}
!848 = !DILocation(line: 55, column: 9, scope: !793)
!849 = !DILocation(line: 56, column: 5, scope: !794)
!850 = !DILocation(line: 50, column: 36, scope: !788)
!851 = !DILocation(line: 50, column: 5, scope: !788)
!852 = distinct !{!852, !791, !853, !143}
!853 = !DILocation(line: 56, column: 5, scope: !784)
!854 = !DILocation(line: 57, column: 1, scope: !766)
!855 = distinct !DISubprogram(name: "m_vec_mul_add", scope: !856, file: !856, line: 24, type: !857, scopeLine: 24, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !48, retainedNodes: !68)
!856 = !DIFile(filename: "../src/generic/arithmetic_dynamic.h", directory: "")
!857 = !DISubroutineType(types: !858)
!858 = !{null, !82, !657, !51, !52}
!859 = !DILocalVariable(name: "m_vec_limbs", arg: 1, scope: !855, file: !856, line: 24, type: !82)
!860 = !DILocation(line: 24, column: 24, scope: !855)
!861 = !DILocalVariable(name: "in", arg: 2, scope: !855, file: !856, line: 24, type: !657)
!862 = !DILocation(line: 24, column: 53, scope: !855)
!863 = !DILocalVariable(name: "a", arg: 3, scope: !855, file: !856, line: 24, type: !51)
!864 = !DILocation(line: 24, column: 71, scope: !855)
!865 = !DILocalVariable(name: "acc", arg: 4, scope: !855, file: !856, line: 24, type: !52)
!866 = !DILocation(line: 24, column: 84, scope: !855)
!867 = !DILocalVariable(name: "i", scope: !868, file: !856, line: 25, type: !82)
!868 = distinct !DILexicalBlock(scope: !855, file: !856, line: 25, column: 5)
!869 = !DILocation(line: 25, column: 13, scope: !868)
!870 = !DILocation(line: 25, column: 9, scope: !868)
!871 = !DILocation(line: 25, column: 18, scope: !872)
!872 = distinct !DILexicalBlock(scope: !868, file: !856, line: 25, column: 5)
!873 = !DILocation(line: 25, column: 22, scope: !872)
!874 = !DILocation(line: 25, column: 20, scope: !872)
!875 = !DILocation(line: 25, column: 5, scope: !868)
!876 = !DILocation(line: 26, column: 33, scope: !877)
!877 = distinct !DILexicalBlock(scope: !872, file: !856, line: 25, column: 39)
!878 = !DILocation(line: 26, column: 36, scope: !877)
!879 = !DILocation(line: 26, column: 40, scope: !877)
!880 = !DILocation(line: 26, column: 19, scope: !877)
!881 = !DILocation(line: 26, column: 9, scope: !877)
!882 = !DILocation(line: 26, column: 13, scope: !877)
!883 = !DILocation(line: 26, column: 16, scope: !877)
!884 = !DILocation(line: 27, column: 5, scope: !877)
!885 = !DILocation(line: 25, column: 36, scope: !872)
!886 = !DILocation(line: 25, column: 5, scope: !872)
!887 = distinct !{!887, !875, !888, !143}
!888 = !DILocation(line: 27, column: 5, scope: !868)
!889 = !DILocation(line: 28, column: 1, scope: !855)
!890 = distinct !DISubprogram(name: "gf16v_mul_u64", scope: !891, file: !891, line: 96, type: !892, scopeLine: 96, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !48, retainedNodes: !68)
!891 = !DIFile(filename: "../src/simple_arithmetic.h", directory: "")
!892 = !DISubroutineType(types: !893)
!893 = !{!53, !53, !182}
!894 = !DILocalVariable(name: "a", arg: 1, scope: !890, file: !891, line: 96, type: !53)
!895 = !DILocation(line: 96, column: 48, scope: !890)
!896 = !DILocalVariable(name: "b", arg: 2, scope: !890, file: !891, line: 96, type: !182)
!897 = !DILocation(line: 96, column: 59, scope: !890)
!898 = !DILocalVariable(name: "mask_msb", scope: !890, file: !891, line: 97, type: !53)
!899 = !DILocation(line: 97, column: 14, scope: !890)
!900 = !DILocalVariable(name: "a_msb", scope: !890, file: !891, line: 98, type: !53)
!901 = !DILocation(line: 98, column: 14, scope: !890)
!902 = !DILocalVariable(name: "a64", scope: !890, file: !891, line: 99, type: !53)
!903 = !DILocation(line: 99, column: 14, scope: !890)
!904 = !DILocation(line: 99, column: 20, scope: !890)
!905 = !DILocalVariable(name: "b32", scope: !890, file: !891, line: 101, type: !53)
!906 = !DILocation(line: 101, column: 14, scope: !890)
!907 = !DILocation(line: 101, column: 20, scope: !890)
!908 = !DILocation(line: 101, column: 24, scope: !890)
!909 = !DILocation(line: 101, column: 22, scope: !890)
!910 = !DILocalVariable(name: "r64", scope: !890, file: !891, line: 105, type: !53)
!911 = !DILocation(line: 105, column: 14, scope: !890)
!912 = !DILocation(line: 105, column: 20, scope: !890)
!913 = !DILocation(line: 105, column: 27, scope: !890)
!914 = !DILocation(line: 105, column: 31, scope: !890)
!915 = !DILocation(line: 105, column: 24, scope: !890)
!916 = !DILocation(line: 107, column: 13, scope: !890)
!917 = !DILocation(line: 107, column: 19, scope: !890)
!918 = !DILocation(line: 107, column: 17, scope: !890)
!919 = !DILocation(line: 107, column: 11, scope: !890)
!920 = !DILocation(line: 108, column: 12, scope: !890)
!921 = !DILocation(line: 108, column: 9, scope: !890)
!922 = !DILocation(line: 109, column: 12, scope: !890)
!923 = !DILocation(line: 109, column: 16, scope: !890)
!924 = !DILocation(line: 109, column: 26, scope: !890)
!925 = !DILocation(line: 109, column: 32, scope: !890)
!926 = !DILocation(line: 109, column: 38, scope: !890)
!927 = !DILocation(line: 109, column: 22, scope: !890)
!928 = !DILocation(line: 109, column: 9, scope: !890)
!929 = !DILocation(line: 110, column: 13, scope: !890)
!930 = !DILocation(line: 110, column: 22, scope: !890)
!931 = !DILocation(line: 110, column: 26, scope: !890)
!932 = !DILocation(line: 110, column: 32, scope: !890)
!933 = !DILocation(line: 110, column: 18, scope: !890)
!934 = !DILocation(line: 110, column: 9, scope: !890)
!935 = !DILocation(line: 112, column: 13, scope: !890)
!936 = !DILocation(line: 112, column: 19, scope: !890)
!937 = !DILocation(line: 112, column: 17, scope: !890)
!938 = !DILocation(line: 112, column: 11, scope: !890)
!939 = !DILocation(line: 113, column: 12, scope: !890)
!940 = !DILocation(line: 113, column: 9, scope: !890)
!941 = !DILocation(line: 114, column: 12, scope: !890)
!942 = !DILocation(line: 114, column: 16, scope: !890)
!943 = !DILocation(line: 114, column: 26, scope: !890)
!944 = !DILocation(line: 114, column: 32, scope: !890)
!945 = !DILocation(line: 114, column: 38, scope: !890)
!946 = !DILocation(line: 114, column: 22, scope: !890)
!947 = !DILocation(line: 114, column: 9, scope: !890)
!948 = !DILocation(line: 115, column: 13, scope: !890)
!949 = !DILocation(line: 115, column: 22, scope: !890)
!950 = !DILocation(line: 115, column: 26, scope: !890)
!951 = !DILocation(line: 115, column: 32, scope: !890)
!952 = !DILocation(line: 115, column: 18, scope: !890)
!953 = !DILocation(line: 115, column: 9, scope: !890)
!954 = !DILocation(line: 117, column: 13, scope: !890)
!955 = !DILocation(line: 117, column: 19, scope: !890)
!956 = !DILocation(line: 117, column: 17, scope: !890)
!957 = !DILocation(line: 117, column: 11, scope: !890)
!958 = !DILocation(line: 118, column: 12, scope: !890)
!959 = !DILocation(line: 118, column: 9, scope: !890)
!960 = !DILocation(line: 119, column: 12, scope: !890)
!961 = !DILocation(line: 119, column: 16, scope: !890)
!962 = !DILocation(line: 119, column: 26, scope: !890)
!963 = !DILocation(line: 119, column: 32, scope: !890)
!964 = !DILocation(line: 119, column: 38, scope: !890)
!965 = !DILocation(line: 119, column: 22, scope: !890)
!966 = !DILocation(line: 119, column: 9, scope: !890)
!967 = !DILocation(line: 120, column: 13, scope: !890)
!968 = !DILocation(line: 120, column: 22, scope: !890)
!969 = !DILocation(line: 120, column: 26, scope: !890)
!970 = !DILocation(line: 120, column: 32, scope: !890)
!971 = !DILocation(line: 120, column: 18, scope: !890)
!972 = !DILocation(line: 120, column: 9, scope: !890)
!973 = !DILocation(line: 122, column: 12, scope: !890)
!974 = !DILocation(line: 122, column: 5, scope: !890)
!975 = distinct !DISubprogram(name: "mul_add_m_upper_triangular_mat_x_mat", scope: !654, file: !654, line: 16, type: !976, scopeLine: 17, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !48, retainedNodes: !68)
!976 = !DISubroutineType(types: !977)
!977 = !{null, !457, !657, !97, !52, !457, !457, !457, !457}
!978 = !DILocalVariable(name: "m_vec_limbs", arg: 1, scope: !975, file: !654, line: 16, type: !457)
!979 = !DILocation(line: 16, column: 53, scope: !975)
!980 = !DILocalVariable(name: "bs_mat", arg: 2, scope: !975, file: !654, line: 16, type: !657)
!981 = !DILocation(line: 16, column: 82, scope: !975)
!982 = !DILocalVariable(name: "mat", arg: 3, scope: !975, file: !654, line: 16, type: !97)
!983 = !DILocation(line: 16, column: 111, scope: !975)
!984 = !DILocalVariable(name: "acc", arg: 4, scope: !975, file: !654, line: 16, type: !52)
!985 = !DILocation(line: 16, column: 126, scope: !975)
!986 = !DILocalVariable(name: "bs_mat_rows", arg: 5, scope: !975, file: !654, line: 17, type: !457)
!987 = !DILocation(line: 17, column: 53, scope: !975)
!988 = !DILocalVariable(name: "bs_mat_cols", arg: 6, scope: !975, file: !654, line: 17, type: !457)
!989 = !DILocation(line: 17, column: 76, scope: !975)
!990 = !DILocalVariable(name: "mat_cols", arg: 7, scope: !975, file: !654, line: 17, type: !457)
!991 = !DILocation(line: 17, column: 99, scope: !975)
!992 = !DILocalVariable(name: "triangular", arg: 8, scope: !975, file: !654, line: 17, type: !457)
!993 = !DILocation(line: 17, column: 119, scope: !975)
!994 = !DILocalVariable(name: "bs_mat_entries_used", scope: !975, file: !654, line: 19, type: !82)
!995 = !DILocation(line: 19, column: 9, scope: !975)
!996 = !DILocalVariable(name: "r", scope: !997, file: !654, line: 20, type: !82)
!997 = distinct !DILexicalBlock(scope: !975, file: !654, line: 20, column: 5)
!998 = !DILocation(line: 20, column: 14, scope: !997)
!999 = !DILocation(line: 20, column: 10, scope: !997)
!1000 = !DILocation(line: 20, column: 21, scope: !1001)
!1001 = distinct !DILexicalBlock(scope: !997, file: !654, line: 20, column: 5)
!1002 = !DILocation(line: 20, column: 25, scope: !1001)
!1003 = !DILocation(line: 20, column: 23, scope: !1001)
!1004 = !DILocation(line: 20, column: 5, scope: !997)
!1005 = !DILocalVariable(name: "c", scope: !1006, file: !654, line: 21, type: !82)
!1006 = distinct !DILexicalBlock(scope: !1007, file: !654, line: 21, column: 9)
!1007 = distinct !DILexicalBlock(scope: !1001, file: !654, line: 20, column: 43)
!1008 = !DILocation(line: 21, column: 18, scope: !1006)
!1009 = !DILocation(line: 21, column: 22, scope: !1006)
!1010 = !DILocation(line: 21, column: 35, scope: !1006)
!1011 = !DILocation(line: 21, column: 33, scope: !1006)
!1012 = !DILocation(line: 21, column: 14, scope: !1006)
!1013 = !DILocation(line: 21, column: 38, scope: !1014)
!1014 = distinct !DILexicalBlock(scope: !1006, file: !654, line: 21, column: 9)
!1015 = !DILocation(line: 21, column: 42, scope: !1014)
!1016 = !DILocation(line: 21, column: 40, scope: !1014)
!1017 = !DILocation(line: 21, column: 9, scope: !1006)
!1018 = !DILocalVariable(name: "k", scope: !1019, file: !654, line: 22, type: !82)
!1019 = distinct !DILexicalBlock(scope: !1020, file: !654, line: 22, column: 13)
!1020 = distinct !DILexicalBlock(scope: !1014, file: !654, line: 21, column: 60)
!1021 = !DILocation(line: 22, column: 22, scope: !1019)
!1022 = !DILocation(line: 22, column: 18, scope: !1019)
!1023 = !DILocation(line: 22, column: 29, scope: !1024)
!1024 = distinct !DILexicalBlock(scope: !1019, file: !654, line: 22, column: 13)
!1025 = !DILocation(line: 22, column: 33, scope: !1024)
!1026 = !DILocation(line: 22, column: 31, scope: !1024)
!1027 = !DILocation(line: 22, column: 13, scope: !1019)
!1028 = !DILocation(line: 23, column: 31, scope: !1029)
!1029 = distinct !DILexicalBlock(scope: !1024, file: !654, line: 22, column: 51)
!1030 = !DILocation(line: 23, column: 44, scope: !1029)
!1031 = !DILocation(line: 23, column: 53, scope: !1029)
!1032 = !DILocation(line: 23, column: 67, scope: !1029)
!1033 = !DILocation(line: 23, column: 65, scope: !1029)
!1034 = !DILocation(line: 23, column: 51, scope: !1029)
!1035 = !DILocation(line: 23, column: 88, scope: !1029)
!1036 = !DILocation(line: 23, column: 92, scope: !1029)
!1037 = !DILocation(line: 23, column: 96, scope: !1029)
!1038 = !DILocation(line: 23, column: 94, scope: !1029)
!1039 = !DILocation(line: 23, column: 107, scope: !1029)
!1040 = !DILocation(line: 23, column: 105, scope: !1029)
!1041 = !DILocation(line: 23, column: 111, scope: !1029)
!1042 = !DILocation(line: 23, column: 117, scope: !1029)
!1043 = !DILocation(line: 23, column: 132, scope: !1029)
!1044 = !DILocation(line: 23, column: 136, scope: !1029)
!1045 = !DILocation(line: 23, column: 134, scope: !1029)
!1046 = !DILocation(line: 23, column: 147, scope: !1029)
!1047 = !DILocation(line: 23, column: 145, scope: !1029)
!1048 = !DILocation(line: 23, column: 129, scope: !1029)
!1049 = !DILocation(line: 23, column: 115, scope: !1029)
!1050 = !DILocation(line: 23, column: 17, scope: !1029)
!1051 = !DILocation(line: 24, column: 13, scope: !1029)
!1052 = !DILocation(line: 22, column: 45, scope: !1024)
!1053 = !DILocation(line: 22, column: 13, scope: !1024)
!1054 = distinct !{!1054, !1027, !1055, !143}
!1055 = !DILocation(line: 24, column: 13, scope: !1019)
!1056 = !DILocation(line: 25, column: 33, scope: !1020)
!1057 = !DILocation(line: 26, column: 9, scope: !1020)
!1058 = !DILocation(line: 21, column: 56, scope: !1014)
!1059 = !DILocation(line: 21, column: 9, scope: !1014)
!1060 = distinct !{!1060, !1017, !1061, !143}
!1061 = !DILocation(line: 26, column: 9, scope: !1006)
!1062 = !DILocation(line: 27, column: 5, scope: !1007)
!1063 = !DILocation(line: 20, column: 39, scope: !1001)
!1064 = !DILocation(line: 20, column: 5, scope: !1001)
!1065 = distinct !{!1065, !1004, !1066, !143}
!1066 = !DILocation(line: 27, column: 5, scope: !997)
!1067 = !DILocation(line: 28, column: 1, scope: !975)
!1068 = distinct !DISubprogram(name: "unpack_m_vecs", scope: !65, file: !65, line: 262, type: !1069, scopeLine: 262, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !48, retainedNodes: !68)
!1069 = !DISubroutineType(types: !1070)
!1070 = !{null, !97, !52, !82, !82}
!1071 = !DILocalVariable(name: "in", arg: 1, scope: !1068, file: !65, line: 262, type: !97)
!1072 = !DILocation(line: 262, column: 48, scope: !1068)
!1073 = !DILocalVariable(name: "out", arg: 2, scope: !1068, file: !65, line: 262, type: !52)
!1074 = !DILocation(line: 262, column: 62, scope: !1068)
!1075 = !DILocalVariable(name: "vecs", arg: 3, scope: !1068, file: !65, line: 262, type: !82)
!1076 = !DILocation(line: 262, column: 71, scope: !1068)
!1077 = !DILocalVariable(name: "m", arg: 4, scope: !1068, file: !65, line: 262, type: !82)
!1078 = !DILocation(line: 262, column: 81, scope: !1068)
!1079 = !DILocalVariable(name: "m_vec_limbs", scope: !1068, file: !65, line: 263, type: !457)
!1080 = !DILocation(line: 263, column: 15, scope: !1068)
!1081 = !DILocation(line: 263, column: 30, scope: !1068)
!1082 = !DILocation(line: 263, column: 32, scope: !1068)
!1083 = !DILocation(line: 263, column: 38, scope: !1068)
!1084 = !DILocalVariable(name: "_out", scope: !1068, file: !65, line: 264, type: !60)
!1085 = !DILocation(line: 264, column: 20, scope: !1068)
!1086 = !DILocation(line: 264, column: 45, scope: !1068)
!1087 = !DILocalVariable(name: "tmp", scope: !1068, file: !65, line: 265, type: !1088)
!1088 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 576, elements: !1089)
!1089 = !{!1090}
!1090 = !DISubrange(count: 9)
!1091 = !DILocation(line: 265, column: 14, scope: !1068)
!1092 = !DILocalVariable(name: "i", scope: !1093, file: !65, line: 266, type: !82)
!1093 = distinct !DILexicalBlock(scope: !1068, file: !65, line: 266, column: 5)
!1094 = !DILocation(line: 266, column: 14, scope: !1093)
!1095 = !DILocation(line: 266, column: 18, scope: !1093)
!1096 = !DILocation(line: 266, column: 22, scope: !1093)
!1097 = !DILocation(line: 266, column: 10, scope: !1093)
!1098 = !DILocation(line: 266, column: 26, scope: !1099)
!1099 = distinct !DILexicalBlock(scope: !1093, file: !65, line: 266, column: 5)
!1100 = !DILocation(line: 266, column: 28, scope: !1099)
!1101 = !DILocation(line: 266, column: 5, scope: !1093)
!1102 = !DILocation(line: 268, column: 9, scope: !1103)
!1103 = distinct !DILexicalBlock(scope: !1099, file: !65, line: 267, column: 5)
!1104 = !DILocation(line: 268, column: 21, scope: !1103)
!1105 = !DILocation(line: 268, column: 26, scope: !1103)
!1106 = !DILocation(line: 268, column: 28, scope: !1103)
!1107 = !DILocation(line: 268, column: 27, scope: !1103)
!1108 = !DILocation(line: 268, column: 29, scope: !1103)
!1109 = !DILocation(line: 268, column: 33, scope: !1103)
!1110 = !DILocation(line: 268, column: 34, scope: !1103)
!1111 = !DILocation(line: 269, column: 16, scope: !1103)
!1112 = !DILocation(line: 269, column: 23, scope: !1103)
!1113 = !DILocation(line: 269, column: 25, scope: !1103)
!1114 = !DILocation(line: 269, column: 24, scope: !1103)
!1115 = !DILocation(line: 269, column: 36, scope: !1103)
!1116 = !DILocation(line: 269, column: 9, scope: !1103)
!1117 = !DILocation(line: 269, column: 60, scope: !1103)
!1118 = !DILocation(line: 269, column: 71, scope: !1103)
!1119 = !DILocation(line: 270, column: 5, scope: !1103)
!1120 = !DILocation(line: 266, column: 35, scope: !1099)
!1121 = !DILocation(line: 266, column: 5, scope: !1099)
!1122 = distinct !{!1122, !1101, !1123, !143}
!1123 = !DILocation(line: 270, column: 5, scope: !1093)
!1124 = !DILocation(line: 271, column: 1, scope: !1068)
!1125 = distinct !DISubprogram(name: "mayo_expand_sk", scope: !65, file: !65, line: 310, type: !1126, scopeLine: 311, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !48, retainedNodes: !68)
!1126 = !DISubroutineType(types: !1127)
!1127 = !{!82, !376, !97, !1128}
!1128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1129, size: 64)
!1129 = !DIDerivedType(tag: DW_TAG_typedef, name: "sk_t", file: !88, line: 294, baseType: !1130)
!1130 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sk_t", file: !88, line: 291, size: 7257920, elements: !1131)
!1131 = !{!1132, !1133}
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !1130, file: !88, line: 292, baseType: !177, size: 7238592)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "O", scope: !1130, file: !88, line: 293, baseType: !181, size: 19312, offset: 7238592)
!1134 = !DILocalVariable(name: "p", arg: 1, scope: !1125, file: !65, line: 310, type: !376)
!1135 = !DILocation(line: 310, column: 41, scope: !1125)
!1136 = !DILocalVariable(name: "csk", arg: 2, scope: !1125, file: !65, line: 310, type: !97)
!1137 = !DILocation(line: 310, column: 65, scope: !1125)
!1138 = !DILocalVariable(name: "sk", arg: 3, scope: !1125, file: !65, line: 311, type: !1128)
!1139 = !DILocation(line: 311, column: 26, scope: !1125)
!1140 = !DILocalVariable(name: "ret", scope: !1125, file: !65, line: 312, type: !82)
!1141 = !DILocation(line: 312, column: 9, scope: !1125)
!1142 = !DILocalVariable(name: "S", scope: !1125, file: !65, line: 313, type: !440)
!1143 = !DILocation(line: 313, column: 19, scope: !1125)
!1144 = !DILocalVariable(name: "P", scope: !1125, file: !65, line: 314, type: !52)
!1145 = !DILocation(line: 314, column: 15, scope: !1125)
!1146 = !DILocation(line: 314, column: 19, scope: !1125)
!1147 = !DILocation(line: 314, column: 23, scope: !1125)
!1148 = !DILocalVariable(name: "O", scope: !1125, file: !65, line: 315, type: !60)
!1149 = !DILocation(line: 315, column: 20, scope: !1125)
!1150 = !DILocation(line: 315, column: 24, scope: !1125)
!1151 = !DILocation(line: 315, column: 28, scope: !1125)
!1152 = !DILocalVariable(name: "param_o", scope: !1125, file: !65, line: 317, type: !457)
!1153 = !DILocation(line: 317, column: 15, scope: !1125)
!1154 = !DILocation(line: 317, column: 33, scope: !1125)
!1155 = !DILocation(line: 317, column: 25, scope: !1125)
!1156 = !DILocalVariable(name: "param_v", scope: !1125, file: !65, line: 318, type: !457)
!1157 = !DILocation(line: 318, column: 15, scope: !1125)
!1158 = !DILocation(line: 318, column: 33, scope: !1125)
!1159 = !DILocation(line: 318, column: 25, scope: !1125)
!1160 = !DILocalVariable(name: "param_O_bytes", scope: !1125, file: !65, line: 319, type: !457)
!1161 = !DILocation(line: 319, column: 15, scope: !1125)
!1162 = !DILocation(line: 319, column: 45, scope: !1125)
!1163 = !DILocation(line: 319, column: 31, scope: !1125)
!1164 = !DILocalVariable(name: "param_pk_seed_bytes", scope: !1125, file: !65, line: 320, type: !457)
!1165 = !DILocation(line: 320, column: 15, scope: !1125)
!1166 = !DILocation(line: 320, column: 57, scope: !1125)
!1167 = !DILocation(line: 320, column: 37, scope: !1125)
!1168 = !DILocalVariable(name: "param_sk_seed_bytes", scope: !1125, file: !65, line: 321, type: !457)
!1169 = !DILocation(line: 321, column: 15, scope: !1125)
!1170 = !DILocation(line: 321, column: 57, scope: !1125)
!1171 = !DILocation(line: 321, column: 37, scope: !1125)
!1172 = !DILocalVariable(name: "seed_sk", scope: !1125, file: !65, line: 323, type: !97)
!1173 = !DILocation(line: 323, column: 26, scope: !1125)
!1174 = !DILocation(line: 323, column: 36, scope: !1125)
!1175 = !DILocalVariable(name: "seed_pk", scope: !1125, file: !65, line: 324, type: !60)
!1176 = !DILocation(line: 324, column: 20, scope: !1125)
!1177 = !DILocation(line: 324, column: 30, scope: !1125)
!1178 = !DILocation(line: 326, column: 14, scope: !1125)
!1179 = !DILocation(line: 326, column: 17, scope: !1125)
!1180 = !DILocation(line: 326, column: 39, scope: !1125)
!1181 = !DILocation(line: 326, column: 37, scope: !1125)
!1182 = !DILocation(line: 326, column: 54, scope: !1125)
!1183 = !DILocation(line: 327, column: 14, scope: !1125)
!1184 = !DILocation(line: 326, column: 5, scope: !1125)
!1185 = !DILocation(line: 328, column: 12, scope: !1125)
!1186 = !DILocation(line: 328, column: 16, scope: !1125)
!1187 = !DILocation(line: 328, column: 14, scope: !1125)
!1188 = !DILocation(line: 328, column: 37, scope: !1125)
!1189 = !DILocation(line: 328, column: 40, scope: !1125)
!1190 = !DILocation(line: 328, column: 50, scope: !1125)
!1191 = !DILocation(line: 328, column: 48, scope: !1125)
!1192 = !DILocation(line: 328, column: 5, scope: !1125)
!1193 = !DILocation(line: 334, column: 18, scope: !1125)
